{
    "paper_id": "00a81cd5730114b23206cabe550df34381bf0a89",
    "metadata": {
        "title": "Linderung bei Kribbeln und Schmerz",
        "authors": []
    },
    "abstract": [
        {
            "text": "Die Therapie bei diabetischer sensomotorischer Polyneuropathie (DSPN) ist eine große Herausforderung. Die meisten Präparate sind wenig schmerzlindernd bei vielen Nebeneffekten und wirken nur symptomatisch, nicht pathogenetisch. Uneinheitliche Leitlinien und mangelnde Evidenz lassen Behandler oft auf die eigene Erfahrung bauen. Umso wichtiger ist es, diese zu teilen, was hier mit einem Bündel von Kurzkasuistiken geschehen soll.",
            "cite_spans": [],
            "ref_spans": [],
            "section": "Abstract"
        }
    ],
    "body_text": [
        {
            "text": "Die diabetische sensomotorische Polyneuropathie (DSPN) ist eine der häufigsten Diabeteskomplikationen und kann bis zu einem Drittel der Patienten mit Diabetes mellitus (DM) betreffen [1] . Bis zu 25 % entwickeln eine chronisch-schmerzhafte Form der Neuropathie [1] . Die Therapie bei schmerzhafter DSPN ist trotz der Vielzahl an Möglichkeiten schwierig, in erster Linie wegen der geringen Wirksamkeit der meisten Präparate, die meist auch nicht pathogenetisch wirken. In einer kürzlich publizierten Studie mit einem deutschen Kollektiv erhielten nur 38 % der Patienten mit Neuropathie eine medikamentöse Therapie, die ihre schmerzhafte DSPN adressieren sollte. Sie bestand zudem überwiegend aus nichtsteroidalen Antirheumatika, deren Wirksamkeit für diese Erkrankung nicht belegt ist [2] .",
            "cite_spans": [
                {
                    "start": 183,
                    "end": 186,
                    "text": "[1]",
                    "ref_id": null
                },
                {
                    "start": 261,
                    "end": 264,
                    "text": "[1]",
                    "ref_id": null
                },
                {
                    "start": 784,
                    "end": 787,
                    "text": "[2]",
                    "ref_id": null
                }
            ],
            "ref_spans": [],
            "section": ""
        },
        {
            "text": "Die Therapie bei DSPN sollte grundsätzlich auf 3 Säulen ruhen: ",
            "cite_spans": [],
            "ref_spans": [],
            "section": ""
        },
        {
            "text": "Eine 75-jährige Patientin mit Typ-2-DM seit 8 Jahren stellte sich mit brennenden Schmerzen in beiden Unterschenkeln vor. Die Schmerzintensität betrug 8/10 auf der Schmerzskala (1: kein Schmerz, 10: Schmerz von maximal vorstellbarer Intensität). Da das HbA 1c bei Intensivierter konventioneller Insulintherapie (ICT) bei 8,5 % lag, wurde zuerst ein GLP-1-Rezeptoragonist (GLP-1-RA) ergänzt. Aufgrund der Coronavirus-Pandemie hatte die Patientin wenig Bewegung und litt darunter, dass sie ihre Enkelkinder nicht sehen durfte, was zu einer Depression geführt hatte. Daher entschieden wir uns für Duloxetin, da es mit die beste Evidenz für die DSNP-Therapie mitbringt und antidepressiv wirkt [3] . Die Therapie wurde mit 30 mg/Tag begonnen. Nach 4 Wochen war die Schmerzintensität auf 6/10 gesunken, die Depression war leicht gebessert, dazu kam aber vermehrt Müdigkeit als Nebenwirkung. Wir entschieden gemeinsam mit der Patientin, die Duloxetin-Dosis auf 60 mg/Tag zu erhöhen. Nach weiteren 8 Wochen war die Schmerzintensität auf 3/10 gesunken, die Müdigkeit hatte stark nachgelassen und die Depression war deutlich gebessert. Die Therapie wurde deshalb in dieser Dosierung weitergeführt.",
            "cite_spans": [
                {
                    "start": 688,
                    "end": 691,
                    "text": "[3]",
                    "ref_id": null
                }
            ],
            "ref_spans": [],
            "section": "Therapie mit dem SNRI Duloxetin"
        },
        {
            "text": "Ein 68-jähriger Patient mit Typ-2-DM seit 2 Jahren und einem HbA 1c von 7,2 % (Diabetestherapie: Metformin 1000 mg: 1-0-1 und ein DPP-4-Inhibitor) stellte sich mit folgenden Symptomen vor: Kribbeln in den Beinen, überwiegend nachts, sowie Gangunsicherheit. Wegen der Kribbelsymptomatik nahm er seit mehreren Monaten Prega balin 150 mg/Tag.",
            "cite_spans": [],
            "ref_spans": [],
            "section": "Substitution mit Vitamin B12"
        },
        {
            "text": "Die Therapie mit Metformin führt häufig zu einem Vitamin-B12-Mangel, abhängig von Dauer und Dosis [4] . Die Laboruntersuchung zeigte dann auch eine hyperchrome, makrozytäre Anämie und einen Vitamin-B12-(183 pmol/L) sowie Folsäuremangel. Da eine Vitamin-B12-Injektion abgelehnt wurde, haben wir mit einer hochdosierten oralen Substitution (2x1000 µg/ Tag) sowie einer Substitution mit Folsäure (5 mg/Tag) begonnen. Nach 3 Wochen waren Kribbeln und Blutbild deutlich ge-bessert. Pregabalin wurde abgesetzt und die Vitamin-B12-Substitution auf 1000 µg/Tag reduziert. Die Folsäuredosis blieb unverändert. Nach 8 Wochen war das Kribbeln fast verschwunden, das Blutbild hatte sich normalisiert, die Substitution wurde reduziert auf 2x1000 µg /Woche Vitamin B12 und Folsäure auf zweimal 5 mg/Woche. Der klinische und laborchemische Befund waren nach 6 Monaten komplett unauffällig, Nebenwirkungen wurden nicht beschrieben. Die Substitution wurde beibehalten, ebenso die Metformin-Einnahme, von der der Patient weiterhin deutlich profitierte.",
            "cite_spans": [
                {
                    "start": 98,
                    "end": 101,
                    "text": "[4]",
                    "ref_id": null
                }
            ],
            "ref_spans": [],
            "section": "Substitution mit Vitamin B12"
        },
        {
            "text": "Wir sahen einen 38-jährigen Patienten mit Typ-2-DM seit 2 Jahren, der mit Metformin und einem GLP-1-RA gut eingestellt war (HbA 1c 6,7%). Als Beschwerden gab er Kribbeln und Schmerzen in den Füßen an (Intensität 8/10), überwiegend nachts. Als LKW-Fahrer hatte er Therapieversuche mit Pregabalin oder Duloxetin abbrechen müssen (Müdigkeit, Konzentrationsschwäche). Im Labor war kein Vitamin-B12-oder Folsäuremangel festzustellen. Wir starteten die Therapie mit dem Vitamin-B1(Thiamin)-Prodrug Benfotiamin 600 mg/Tag p. o. für 6 Wochen und reduzierten die Dosis danach auf 300 mg/Tag. Das wurde nebenwirkungsfrei vertragen, nach 3 Monaten war die Schmerzintensität auf 2/10 gesunken. Wir führten die Therapie mit 300 mg Benfotiamin/Tag weiter. Nach 6 Monaten betrug die Schmerzintensität 4/10. Die Therapie mit Benfotiamin kann auch noch über längere Zeit (bis 12 Monaten) zu einer Linderung neuropathischer Schmerzen führen [5] .",
            "cite_spans": [
                {
                    "start": 923,
                    "end": 926,
                    "text": "[5]",
                    "ref_id": null
                }
            ],
            "ref_spans": [],
            "section": "Therapie mit Benfotiamin"
        },
        {
            "text": "Ein Patienten, 52 Jahre alt mit Typ-1-DM seit 26 Jahren, befand sich stationär bei uns wegen einer diabetischen Osteoarthropathie mit plantarem Ulkus. Es wurde eine schmerzhafte DSPN mit elektrisierenden Schmerzen (Intensität 9/10) in den Füßen festgestellt, wiederum überwiegend nachts.",
            "cite_spans": [],
            "ref_spans": [],
            "section": "Therapie mit Alpha-Liponsäure"
        },
        {
            "text": "Wir leiteten eine intravenöse Therapie mit Alpha-Liponsäure (600 mg/Tag) ein. Nach 2 Wochen, vor der Klinikentlassung, war die Schmerzintensität auf 5/10 gesunken, sodass wir empfahlen, die Therapie oral mit 600 mg/Tag ambulant weiterzuführen. Nach 6 Monaten lag die Schmerzintensität bei 4/10, es wurden keinerlei Nebenwirkungen beschrieben. Alpha-Liponsäure lindert neuropathische Schmerzen und reduziert neuropathische Defizite, besonders wenn es intravenös zugeführt wird [6] .",
            "cite_spans": [
                {
                    "start": 476,
                    "end": 479,
                    "text": "[6]",
                    "ref_id": null
                }
            ],
            "ref_spans": [],
            "section": "Therapie mit Alpha-Liponsäure"
        },
        {
            "text": "Ein Patient (55 Jahre) mit Typ-2-DM seit 7 Jahren, gut eingestellt mit einem HbA 1c von 6,4 %), klagte über starke brennende Schmerzen (Intensität 10/10) plantar beidseits. Seit mehreren Wochen nahm er Pregabalin (300 mg/Tag) sowie Metamizol (bis zu 3000 mg/Tag). Die schmerzhaften Areale konnten mit einem Wattestäbchen gut eingegrenzt werden, daraufhin wurde auf beiden Seiten jeweils ein Capsaicin-8%-Pflaster geklebt. Wegen starker Exazerbation der lokalen Schmerzen musste lokal vorsichtig gekühlt werden, was der Patient zuhause noch am nächsten Tag vorsichtig fortsetzte. Nach 2 Wochen war die Schmerzintensität auf 8/10 gesunken und wir haben die Schmerzmedikation halbiert. Nach 3 Monaten lag die Schmerzintensität nur noch bei 2/10, sodass wir die orale Medikation komplett abgesetzt und die Capsaicin-Therapie wiederholt haben. Der klinische Befund blieb, bei Pflastertherapie alle 3 Monate, über 12 Monate stabil.",
            "cite_spans": [],
            "ref_spans": [],
            "section": "Therapie mit Capsaicin-8%-Pflaster"
        },
        {
            "text": "Die Capsaicin-8%-Pflaster werden für 30 Minuten auf die schmerzhaften Areale geklebt, danach wird der Bereich gewaschen. Eine Exazerbation der lokalen Beschwerden während der Therapie und 1-2 Tage danach ist nicht ungewöhnlich. Nach ca. 7 Tagen erleben die Patienten aber meistens eine klinisch signifikante Schmerzreduktion [7] . Die Applikation muss in der Regel nach 8-12 Wochen wiederholt werden.",
            "cite_spans": [
                {
                    "start": 325,
                    "end": 328,
                    "text": "[7]",
                    "ref_id": null
                }
            ],
            "ref_spans": [],
            "section": "Therapie mit Capsaicin-8%-Pflaster"
        },
        {
            "text": "Eine Patientin im Alter von 63 Jahren, Typ-2-DM seit 10 Jahren (HbA 1c 7,4 %), hatte schmerzhafte Krämpfe in den Füßen (Intensität 8/10). Nach 2 Wochen Hochtontherapie (30 Minuten, zweimal wöchentlich) beschrieb sie keine Besserung, wollte aber weitermachen. Nach 3 Wochen waren die Krämpfe komplett abgeklungen, was einen Monat später noch anhielt.",
            "cite_spans": [],
            "ref_spans": [],
            "section": "Hochtontherapie"
        },
        {
            "text": "Die Hochtontherapie ist eine Weiterentwicklung der elektrischen Muskelstimulation. Bislang sind die wissenschaftlichen Daten zur Wirksamkeit bei schmerzhafter DSPN begrenzt [8] . Die klinische Erfahrung zeigt aber, dass sie manchmal bei therapierefraktärer schmerzhafter DSPN oder wenn eine medikamentöse Therapie nicht erwünscht ist, wirksam sein kann. Bei wenig mobilen Patienten hat sie darüber hinaus den Vorteil, dass die Muskeln zur Kontraktion gebracht werden.",
            "cite_spans": [
                {
                    "start": 173,
                    "end": 176,
                    "text": "[8]",
                    "ref_id": null
                }
            ],
            "ref_spans": [],
            "section": "Hochtontherapie"
        }
    ],
    "bib_entries": {
        "BIBREF8": {
            "ref_id": "b8",
            "title": "Fabula docet",
            "authors": [],
            "year": null,
            "venue": "",
            "volume": "",
            "issn": "",
            "pages": "",
            "other_ids": {}
        },
        "BIBREF9": {
            "ref_id": "b9",
            "title": "Die Diagnose \"DSPN\" sollte immer kritisch überprüft werden, manchmal stehen andere Ursachen (z. B. ein Vitamin-B12-Mangel bei Metformintherapie) im Vordergrund",
            "authors": [],
            "year": null,
            "venue": "",
            "volume": "",
            "issn": "",
            "pages": "",
            "other_ids": {}
        },
        "BIBREF10": {
            "ref_id": "b10",
            "title": "Die Therapie der schmerzhaften DSPN muss individuell angepasst werden, nicht zuletzt anhand der Komorbiditäten (z. B. Depression oder Immobilisation) oder des Berufes eines Patienten. Bei Berufen, die eine besondere Vigilanz erfordern, sind manche Präparate aufgrund der Nebenwirkungen nicht oder nur mit großer Vorsicht einzusetzen",
            "authors": [],
            "year": null,
            "venue": "",
            "volume": "",
            "issn": "",
            "pages": "",
            "other_ids": {}
        }
    },
    "ref_entries": {},
    "back_matter": []
}