{
    "paper_id": "00a913b19b4adfad90d73551035c3fb8508256b2",
    "metadata": {
        "title": "12 Executive Board, Association of Schools of Public Health in the European Region (ASPHER)",
        "authors": [
            {
                "first": "Brian",
                "middle": [
                    "L H"
                ],
                "last": "Wong",
                "suffix": "",
                "affiliation": {
                    "laboratory": "MRC Unit for Lifelong Health and Ageing at UCL",
                    "institution": "University College London",
                    "location": {
                        "settlement": "London",
                        "country": "United Kingdom"
                    }
                },
                "email": ""
            },
            {
                "first": "Manfred",
                "middle": [
                    "S"
                ],
                "last": "Green",
                "suffix": "",
                "affiliation": {
                    "laboratory": "Vaccination Group",
                    "institution": "",
                    "location": {}
                },
                "email": ""
            },
            {
                "first": "John",
                "middle": [],
                "last": "Reid",
                "suffix": "",
                "affiliation": {
                    "laboratory": "Vaccination Group",
                    "institution": "",
                    "location": {}
                },
                "email": ""
            },
            {
                "first": "Jose",
                "middle": [
                    "M"
                ],
                "last": "Martin-Moreno",
                "suffix": "",
                "affiliation": {
                    "laboratory": "Vaccination Group",
                    "institution": "",
                    "location": {}
                },
                "email": ""
            },
            {
                "first": "Nadav",
                "middle": [],
                "last": "Davidovitch",
                "suffix": "",
                "affiliation": {
                    "laboratory": "Vaccination Group",
                    "institution": "",
                    "location": {}
                },
                "email": ""
            },
            {
                "first": "Laurent",
                "middle": [],
                "last": "Chambaud",
                "suffix": "",
                "affiliation": {
                    "laboratory": "Vaccination Group",
                    "institution": "",
                    "location": {}
                },
                "email": ""
            },
            {
                "first": "Lore",
                "middle": [],
                "last": "Leighton",
                "suffix": "",
                "affiliation": {
                    "laboratory": "Secretariat, Vaccination Group",
                    "institution": "",
                    "location": {}
                },
                "email": ""
            },
            {
                "first": "Mohamud",
                "middle": [],
                "last": "Sheek-Hussein",
                "suffix": "",
                "affiliation": {
                    "laboratory": "Vaccination Group",
                    "institution": "",
                    "location": {}
                },
                "email": ""
            },
            {
                "first": "Ranjeet",
                "middle": [],
                "last": "Dhonkal",
                "suffix": "",
                "affiliation": {
                    "laboratory": "Vaccination Group",
                    "institution": "",
                    "location": {}
                },
                "email": ""
            },
            {
                "first": "Robert",
                "middle": [],
                "last": "Otok",
                "suffix": "",
                "affiliation": {
                    "laboratory": "Secretariat, Vaccination Group",
                    "institution": "",
                    "location": {}
                },
                "email": ""
            },
            {
                "first": "John",
                "middle": [
                    "D"
                ],
                "last": "Middleton",
                "suffix": "",
                "affiliation": {
                    "laboratory": "Vaccination Group",
                    "institution": "",
                    "location": {}
                },
                "email": ""
            }
        ]
    },
    "abstract": [],
    "body_text": [
        {
            "text": "The prompt achievement of (vaccine-derived) herd immunity worldwide should be the core aim of all COVID-19 vaccination programmes, as it would thereby minimize viral transmission both between and within countries [1, 2] . Failure to address underlying structural and systemic inequalities in the acquisition and delivery of vaccinations is a fundamental ethical and moral concern. Additionally, there is a strategic imperative with pragmatic consequences in ensuring other vital goals of comprehensive global vaccination. These include: supporting sustainable economic development; allowing international travel/ movement; and restoring adequate, accessible health and social care systems for all populations worldwide.",
            "cite_spans": [
                {
                    "start": 213,
                    "end": 216,
                    "text": "[1,",
                    "ref_id": "BIBREF0"
                },
                {
                    "start": 217,
                    "end": 219,
                    "text": "2]",
                    "ref_id": "BIBREF1"
                }
            ],
            "ref_spans": [],
            "section": ""
        },
        {
            "text": "No region/nation will truly be free of the pandemic until all nations are free of it. Until an international consensus has been reached and a coordinated operational strategy has been adopted, the virus will find new vulnerable populations and continue to spread [3] . It will neither respect international boundaries, nor be limited/eradicated by sporadic vaccination coverage across populations and countries. It will continue to replicate and mutate to new, unpredictable forms, which potentially limit the effectiveness of current and future vaccines, and further threaten global health security and economic prosperity. Consequently, there will persist a need for restrictions on international travel, variably and inadequately implemented by individual countries.",
            "cite_spans": [
                {
                    "start": 263,
                    "end": 266,
                    "text": "[3]",
                    "ref_id": "BIBREF2"
                }
            ],
            "ref_spans": [],
            "section": ""
        },
        {
            "text": "ASPHER is deeply concerned about chaotic differences in vaccination policies between and within countries which threaten our collective ability to control and suppress the virus worldwide [4] . Given the potential for further virus mutations, some of which may be vaccine-resistant, the need for a coordinated global approach to vaccination through an equity lens has never been more evident. We need to overcome the ugly face of 'vaccine nationalism' and replace it with 'vaccine internationalism' [5] if we are to address the challenges impeding global access to COVID-19 vaccines (production, affordability, allocation, and deployment) [6] .",
            "cite_spans": [
                {
                    "start": 188,
                    "end": 191,
                    "text": "[4]",
                    "ref_id": "BIBREF3"
                },
                {
                    "start": 499,
                    "end": 502,
                    "text": "[5]",
                    "ref_id": "BIBREF4"
                },
                {
                    "start": 639,
                    "end": 642,
                    "text": "[6]",
                    "ref_id": "BIBREF5"
                }
            ],
            "ref_spans": [],
            "section": ""
        },
        {
            "text": "ASPHER calls upon the WHO to lead efforts in securing global international collaboration and capacity (in immunology, virology, public health, and vaccinology) to anticipate potential antigenic drift/shift in the severe acute respiratory syndrome coronavirus 2 (SARS-COV-2) virus. It is crucial for the WHO to not only bolster its efforts to maintain and develop comprehensive vaccine responses to the virus, but also adapt them to combat potential new strains.",
            "cite_spans": [],
            "ref_spans": [],
            "section": ""
        },
        {
            "text": "ASPHER calls upon national governments to commit to international vaccine leadership through the WHO, supported by other key international agencies and integrated with the COVAX GAVI initiative. National governments must adopt an international consensus with a clear public health strategy and measurable targets for reducing the virus spread. Such a strategy requires recognition of the need for appropriate vaccine deployment, in accordance with local health system contexts and is not merely about obtaining funding to support poorer countries with vaccine access [7] . ASPHER further calls on national governments to contribute to a coordinated international effort to ensure vaccine deployment programmes are comprehensive and fit for purpose, with considerations made regarding the circumstances within countries in which they are administered. Additionally, we call on national governments to strengthen issues around anticipating new variants and decreasing effectiveness of vaccines, proactively planning for if/when vaccines stop working to prevent mild/moderate disease as well as considering how countries are reimbursed for vaccines purchased which may be less effective. Finally, it is essential that national governments evaluate their need to access global vaccine stockpiles, bearing in mind the context of global equity.",
            "cite_spans": [
                {
                    "start": 567,
                    "end": 570,
                    "text": "[7]",
                    "ref_id": "BIBREF6"
                }
            ],
            "ref_spans": [],
            "section": ""
        },
        {
            "text": "Global surveillance and disease epidemiology, rapid reporting of vaccine delivery and uptake with planned seroprevalence studies, and support for alerting and mobilizing outbreak control for emergent diseases within the rapid reporting dashboard are crucial components of a coordinated global approach. Therefore, ASPHER calls upon the WHO and national public health agencies to develop an international nomenclature for current and future virus mutations as well as urgently revise and agree on global evaluation frameworks for COVID-19 vaccines, building upon historical and recent pandemic-related approaches to communicable disease control, elimination, and eradication. We further call for the reporting of funding levels backed with COVAX pledges from countries and timely delivery of vaccines as well as the facilitation of post-marketing surveillance, including that of pharmaceutical companies.",
            "cite_spans": [],
            "ref_spans": [],
            "section": ""
        },
        {
            "text": "ASPHER also calls upon civil society organisations (CSOs) and schools of public health to support the WHO and national governments in catalyzing efforts to combat the spread of disinformation and misinformation. CSOs and schools of public health must not only continue to convey factual, evidence-based information, but also identify and share best practices and expertize with policymakers.",
            "cite_spans": [],
            "ref_spans": [],
            "section": ""
        },
        {
            "text": "ASPHER strongly believes the creation of a range of vaccines to combat SARS-COV-2 is a major scientific achievement brought about through truly international efforts. We reinforce our stance on the need for transparent and evidence-based decision making in policy, particularly with respect to vaccination approaches [8] . The willingness of scientists to collaborate must now be matched by politicians from all nations. Without coordinated global capacity and collaboration to anticipate new virus strains and new vaccine modifications, we may be faced with a perpetual COVID pandemic. As such, the costly 'vaccine nationalism' we have seen thus far must not persist [9] .",
            "cite_spans": [
                {
                    "start": 317,
                    "end": 320,
                    "text": "[8]",
                    "ref_id": "BIBREF8"
                },
                {
                    "start": 668,
                    "end": 671,
                    "text": "[9]",
                    "ref_id": "BIBREF9"
                }
            ],
            "ref_spans": [],
            "section": ""
        },
        {
            "text": "Politicians of all nations must commit to a global strategy for the control and eventual elimination of the SARS-COV-2 virus. There must be a genuine commitment to ensuring equitable access to vaccines both between and within countries. This is more than just a fundamental question of fairness and the right of all global citizens to health. The virus will not be eliminated anywhere, if it is not eliminated everywhere. Restoring the pursuit of health and better socioeconomic futures for all requires global commitment to the largest vaccination program to date. For this to succeed, nations will need to pool their resources and sovereignty, and put their weight behind the WHO's leadership.",
            "cite_spans": [],
            "ref_spans": [],
            "section": ""
        },
        {
            "text": "Recent disputes between the EU and the United Kingdom on vaccine distribution [10] drastically undermine effective vaccine rollout globally, doing more harm than good. Political leaders have set high expectations among their citizens to ensure rapid vaccine rollouts; however, limitations in technical production are inherent to all vaccine production efforts. While we have seen extraordinary success so far and so quickly, it is important to bear in mind that disinformation and misinformation will persist, and there are both commercial and political factors at play which can exacerbate existing health inequities [1] . Vaccine internationalism requires measured calm heads, diplomacy, and generous visionary leadership. Our aim above everything else as a global community needs to be defeating the virus first.",
            "cite_spans": [
                {
                    "start": 78,
                    "end": 82,
                    "text": "[10]",
                    "ref_id": "BIBREF10"
                },
                {
                    "start": 618,
                    "end": 621,
                    "text": "[1]",
                    "ref_id": "BIBREF0"
                }
            ],
            "ref_spans": [],
            "section": ""
        },
        {
            "text": "BW led the writing of this manuscript. All authors contributed to the writing of the manuscript.",
            "cite_spans": [],
            "ref_spans": [],
            "section": "AUTHOR CONTRIBUTIONS"
        }
    ],
    "bib_entries": {
        "BIBREF0": {
            "ref_id": "b0",
            "title": "ASPHER statement on the novel coronavirus disease (COVID-19) outbreak emergency",
            "authors": [
                {
                    "first": "J",
                    "middle": [],
                    "last": "Middleton",
                    "suffix": ""
                },
                {
                    "first": "J",
                    "middle": [
                        "M"
                    ],
                    "last": "Martin-Moreno",
                    "suffix": ""
                },
                {
                    "first": "H",
                    "middle": [],
                    "last": "Barros",
                    "suffix": ""
                },
                {
                    "first": "L",
                    "middle": [],
                    "last": "Chambaud",
                    "suffix": ""
                },
                {
                    "first": "C",
                    "middle": [],
                    "last": "Signorelli",
                    "suffix": ""
                }
            ],
            "year": 2020,
            "venue": "Int J Public Health",
            "volume": "65",
            "issn": "",
            "pages": "237--245",
            "other_ids": {
                "DOI": [
                    "10.1007/s00038-020-01362-x"
                ]
            }
        },
        "BIBREF1": {
            "ref_id": "b1",
            "title": "Planning for a second wave pandemic of COVID-19 and planning for winter",
            "authors": [
                {
                    "first": "J",
                    "middle": [],
                    "last": "Middleton",
                    "suffix": ""
                },
                {
                    "first": "H",
                    "middle": [],
                    "last": "Lopes",
                    "suffix": ""
                },
                {
                    "first": "K",
                    "middle": [],
                    "last": "Michelson",
                    "suffix": ""
                },
                {
                    "first": "Reid",
                    "middle": [],
                    "last": "",
                    "suffix": ""
                },
                {
                    "first": "J",
                    "middle": [],
                    "last": "",
                    "suffix": ""
                }
            ],
            "year": 2020,
            "venue": "Int J Public Health",
            "volume": "65",
            "issn": "",
            "pages": "1525--1532",
            "other_ids": {
                "DOI": [
                    "10.1007/s00038-020-01455-7"
                ]
            }
        },
        "BIBREF2": {
            "ref_id": "b2",
            "title": "First statement of the ASPHER COVID-19 taskforce group on health inequalities and vulnerable populations. ASPHER",
            "authors": [],
            "year": 2020,
            "venue": "",
            "volume": "",
            "issn": "",
            "pages": "",
            "other_ids": {}
        },
        "BIBREF3": {
            "ref_id": "b3",
            "title": "Vaccines for covid-19: reasons for hope, but first for concern",
            "authors": [
                {
                    "first": "J",
                    "middle": [
                        "M"
                    ],
                    "last": "Martin-Moreno",
                    "suffix": ""
                },
                {
                    "first": "S",
                    "middle": [],
                    "last": "Laham",
                    "suffix": ""
                },
                {
                    "first": "R",
                    "middle": [],
                    "last": "Dhnokal",
                    "suffix": ""
                },
                {
                    "first": "M",
                    "middle": [
                        "S"
                    ],
                    "last": "Green",
                    "suffix": ""
                },
                {
                    "first": "J",
                    "middle": [],
                    "last": "Middleton",
                    "suffix": ""
                }
            ],
            "year": 2020,
            "venue": "BMJ Opin",
            "volume": "",
            "issn": "",
            "pages": "",
            "other_ids": {}
        },
        "BIBREF4": {
            "ref_id": "b4",
            "title": "We need an equitable and coordinated global approach to Covid-19 vaccination",
            "authors": [
                {
                    "first": "J",
                    "middle": [],
                    "last": "Middleton",
                    "suffix": ""
                },
                {
                    "first": "",
                    "middle": [],
                    "last": "Wong",
                    "suffix": ""
                },
                {
                    "first": "",
                    "middle": [],
                    "last": "Blh",
                    "suffix": ""
                },
                {
                    "first": "",
                    "middle": [],
                    "last": "Green",
                    "suffix": ""
                },
                {
                    "first": "",
                    "middle": [],
                    "last": "Ms",
                    "suffix": ""
                },
                {
                    "first": "J",
                    "middle": [],
                    "last": "Reid",
                    "suffix": ""
                },
                {
                    "first": "J",
                    "middle": [
                        "M"
                    ],
                    "last": "Martin-Moreno",
                    "suffix": ""
                }
            ],
            "year": 2020,
            "venue": "BMJ Opin",
            "volume": "",
            "issn": "",
            "pages": "",
            "other_ids": {}
        },
        "BIBREF5": {
            "ref_id": "b5",
            "title": "Challenges in ensuring global access to COVID-19 vaccines: production, affordability, allocation, and deployment",
            "authors": [
                {
                    "first": "O",
                    "middle": [
                        "J"
                    ],
                    "last": "Wouters",
                    "suffix": ""
                },
                {
                    "first": "K",
                    "middle": [
                        "C"
                    ],
                    "last": "Shadlen",
                    "suffix": ""
                },
                {
                    "first": "M",
                    "middle": [],
                    "last": "Salcher-Konrad",
                    "suffix": ""
                },
                {
                    "first": "A",
                    "middle": [
                        "J"
                    ],
                    "last": "Pollard",
                    "suffix": ""
                },
                {
                    "first": "",
                    "middle": [],
                    "last": "Larson",
                    "suffix": ""
                },
                {
                    "first": "",
                    "middle": [],
                    "last": "Hj",
                    "suffix": ""
                },
                {
                    "first": "Y",
                    "middle": [],
                    "last": "Teerawattananon",
                    "suffix": ""
                }
            ],
            "year": 2021,
            "venue": "Lancet",
            "volume": "",
            "issn": "",
            "pages": "",
            "other_ids": {
                "DOI": [
                    "10.1016/S0140-6736(21)00306-8/"
                ]
            }
        },
        "BIBREF6": {
            "ref_id": "b6",
            "title": "The Economic Case for Global Vaccinations",
            "authors": [],
            "year": null,
            "venue": "",
            "volume": "",
            "issn": "",
            "pages": "",
            "other_ids": {}
        },
        "BIBREF7": {
            "ref_id": "b7",
            "title": "ICC -international chamber of commerce",
            "authors": [],
            "year": 2019,
            "venue": "",
            "volume": "",
            "issn": "",
            "pages": "",
            "other_ids": {}
        },
        "BIBREF8": {
            "ref_id": "b8",
            "title": "Covid-19 vaccines: where are the data?",
            "authors": [
                {
                    "first": "J",
                    "middle": [
                        "M"
                    ],
                    "last": "Martin-Moreno",
                    "suffix": ""
                },
                {
                    "first": "J",
                    "middle": [],
                    "last": "Middleton",
                    "suffix": ""
                },
                {
                    "first": "M",
                    "middle": [],
                    "last": "Sheek-Hussein",
                    "suffix": ""
                },
                {
                    "first": "M",
                    "middle": [
                        "S"
                    ],
                    "last": "Green",
                    "suffix": ""
                }
            ],
            "year": 2020,
            "venue": "BMJ Opin",
            "volume": "",
            "issn": "",
            "pages": "",
            "other_ids": {}
        },
        "BIBREF9": {
            "ref_id": "b9",
            "title": "COVID-19 and the cost of vaccine nationalism",
            "authors": [
                {
                    "first": "M",
                    "middle": [],
                    "last": "Hafner",
                    "suffix": ""
                },
                {
                    "first": "E",
                    "middle": [],
                    "last": "Yerushalmi",
                    "suffix": ""
                },
                {
                    "first": "C",
                    "middle": [],
                    "last": "Fays",
                    "suffix": ""
                },
                {
                    "first": "E",
                    "middle": [],
                    "last": "Dufresne",
                    "suffix": ""
                },
                {
                    "first": "C",
                    "middle": [],
                    "last": "Van Stolk",
                    "suffix": ""
                }
            ],
            "year": 2020,
            "venue": "",
            "volume": "",
            "issn": "",
            "pages": "",
            "other_ids": {}
        },
        "BIBREF10": {
            "ref_id": "b10",
            "title": "EU vaccine contract is 'not a commitment'. POLITICO (2021)",
            "authors": [
                {
                    "first": "Ceo",
                    "middle": [],
                    "last": "Astrazeneca",
                    "suffix": ""
                }
            ],
            "year": null,
            "venue": "",
            "volume": "",
            "issn": "",
            "pages": "",
            "other_ids": {}
        },
        "BIBREF11": {
            "ref_id": "b11",
            "title": "This is an open-access article distributed under the terms of the Creative Commons Attribution License (CC BY). The use, distribution or reproduction in other forums is permitted, provided the original author(s) and the copyright owner(s) are credited and that the original publication in this journal is cited",
            "authors": [
                {
                    "first": "",
                    "middle": [],
                    "last": "Wong",
                    "suffix": ""
                },
                {
                    "first": "",
                    "middle": [],
                    "last": "Green",
                    "suffix": ""
                },
                {
                    "first": "",
                    "middle": [],
                    "last": "Reid",
                    "suffix": ""
                },
                {
                    "first": "",
                    "middle": [],
                    "last": "Martin-Moreno",
                    "suffix": ""
                },
                {
                    "first": "",
                    "middle": [],
                    "last": "Davidovitch",
                    "suffix": ""
                },
                {
                    "first": "",
                    "middle": [],
                    "last": "Chambaud",
                    "suffix": ""
                },
                {
                    "first": "",
                    "middle": [],
                    "last": "Leighton",
                    "suffix": ""
                },
                {
                    "first": "",
                    "middle": [],
                    "last": "Sheek-Hussein",
                    "suffix": ""
                },
                {
                    "first": "",
                    "middle": [],
                    "last": "Dhonkal",
                    "suffix": ""
                },
                {
                    "first": "Middleton",
                    "middle": [],
                    "last": "Otok",
                    "suffix": ""
                }
            ],
            "year": null,
            "venue": "Copyright © 2021",
            "volume": "",
            "issn": "",
            "pages": "",
            "other_ids": {}
        }
    },
    "ref_entries": {},
    "back_matter": []
}