{
    "paper_id": "00dce81917a78b3c4857241d64e2f342a3c73de6",
    "metadata": {
        "title": "An Avatar-Led Digital Smoking Cessation Program for Sexual and Gender Minority Young Adults: Intervention Development and Results of a Single-Arm Pilot Trial",
        "authors": [
            {
                "first": "Jaimee",
                "middle": [
                    "L"
                ],
                "last": "Heffner",
                "suffix": "",
                "affiliation": {
                    "laboratory": "",
                    "institution": "Fred Hutchinson Cancer Research Center",
                    "location": {
                        "settlement": "Seattle",
                        "region": "WA",
                        "country": "United States"
                    }
                },
                "email": ""
            },
            {
                "first": "Noreen",
                "middle": [
                    "L"
                ],
                "last": "Watson",
                "suffix": "",
                "affiliation": {
                    "laboratory": "",
                    "institution": "Fred Hutchinson Cancer Research Center",
                    "location": {
                        "settlement": "Seattle",
                        "region": "WA",
                        "country": "United States"
                    }
                },
                "email": ""
            },
            {
                "first": ";",
                "middle": [
                    "Edit"
                ],
                "last": "Serfozo",
                "suffix": "",
                "affiliation": {
                    "laboratory": "",
                    "institution": "Fred Hutchinson Cancer Research Center",
                    "location": {
                        "settlement": "Seattle",
                        "region": "WA",
                        "country": "United States"
                    }
                },
                "email": ""
            },
            {
                "first": "Megan",
                "middle": [
                    "M"
                ],
                "last": "Kelly",
                "suffix": "",
                "affiliation": {
                    "laboratory": "",
                    "institution": "Veterans Affairs Bedford Healthcare System",
                    "location": {
                        "settlement": "Bedford",
                        "region": "MA",
                        "country": "United States"
                    }
                },
                "email": ""
            },
            {
                "first": "Erin",
                "middle": [
                    "D"
                ],
                "last": "Reilly",
                "suffix": "",
                "affiliation": {
                    "laboratory": "",
                    "institution": "Veterans Affairs Bedford Healthcare System",
                    "location": {
                        "settlement": "Bedford",
                        "region": "MA",
                        "country": "United States"
                    }
                },
                "email": ""
            },
            {
                "first": "Daniella",
                "middle": [],
                "last": "Kim",
                "suffix": "",
                "affiliation": {
                    "laboratory": "",
                    "institution": "University of Washington",
                    "location": {
                        "settlement": "Seattle",
                        "region": "WA",
                        "country": "United States"
                    }
                },
                "email": ""
            },
            {
                "first": ";",
                "middle": [],
                "last": "Kelsey Baker",
                "suffix": "",
                "affiliation": {
                    "laboratory": "",
                    "institution": "Fred Hutchinson Cancer Research Center",
                    "location": {
                        "settlement": "Seattle",
                        "region": "WA",
                        "country": "United States"
                    }
                },
                "email": ""
            },
            {
                "first": "Maria",
                "middle": [],
                "last": "Karekla",
                "suffix": "",
                "affiliation": {
                    "laboratory": "",
                    "institution": "University of Cyprus",
                    "location": {
                        "addrLine": "1100 Fairview Ave N",
                        "postCode": "M3-B232, 98109",
                        "settlement": "Nicosia, Seattle",
                        "region": "WA",
                        "country": "Cyprus, United States"
                    }
                },
                "email": ""
            }
        ]
    },
    "abstract": [
        {
            "text": "Background: Sexual and gender minority young adults have a high prevalence of smoking and unique barriers to accessing tobacco treatment.",
            "cite_spans": [],
            "ref_spans": [],
            "section": "Abstract"
        },
        {
            "text": "Objective: To address these challenges as well as their preferences for sexual and gender minority-targeted interventions and digital programs, we developed and evaluated the acceptability, preliminary efficacy, and impact on theory-based change processes of an acceptance and commitment therapy-based digital program called Empowered, Queer, Quitting, and Living (EQQUAL).",
            "cite_spans": [],
            "ref_spans": [],
            "section": "Abstract"
        },
        {
            "text": "Methods: Participants (n=22) of a single-arm trial conducted to evaluate the program were young adults, age 18 to 30 years, who self-identified as sexual and gender minority individuals and smoked at least one cigarette per day. All participants received access to the EQQUAL program. Participants completed web-based surveys at baseline and at a follow-up 2 months after enrollment. We verified self-reported smoking abstinence with biochemical testing; missing data were counted as smoking or using tobacco.",
            "cite_spans": [],
            "ref_spans": [],
            "section": "Abstract"
        },
        {
            "text": "For young adults who logged in at least once (n=18), the mean number of log-ins was 5.5 (SD 3.6), mean number of sessions completed was 3.1 (SD 2.6), and 39% (7/18) completed all 6 sessions. Overall, 93% of participants (14/15) were satisfied with the EQQUAL program, 100% (15/15) found it easy to use, and 100% (15/15) said it helped them be clearer about how to quit. Abstinence from smoking or using tobacco was confirmed with biochemical testing for 23% of participants (5/22). Both quantitative and qualitative results suggested a positive overall response to the avatar guide, with areas for future improvement largely centered on the avatar's appearance and movements.",
            "cite_spans": [],
            "ref_spans": [],
            "section": "Abstract"
        },
        {
            "text": "Conclusions: Treatment acceptability of EQQUAL was very promising. The rate of abstinence, which was biochemically confirmed, was 3 times higher than that of the only other digital program to date that has targeted sexual and gender minority young adults and 6 to 13 times higher than those of nontargeted digital smoking interventions among sexual and gender minority young adults. Planned improvements for the next iteration of the program include making the avatar's movements more natural; offering multiple avatar guides with different on characteristics such as race, ethnicity, and gender identity from which to choose; and providing a support forum for users to connect anonymously with peers.",
            "cite_spans": [],
            "ref_spans": [],
            "section": "Abstract"
        },
        {
            "text": "(JMIR Form Res 2021;5(7):e30241)",
            "cite_spans": [],
            "ref_spans": [],
            "section": "Abstract"
        }
    ],
    "body_text": [
        {
            "text": "The prevalence of tobacco use among sexual and gender minority young adults is twice as high as that among non-sexual and gender minority young adults across all tobacco products: 29% vs 15% for cigarettes and 8% vs 4% for both electronic nicotine delivery systems and noncigarette tobacco, respectively [1] . Compounding their risk for tobacco-related diseases, sexual and gender minority young adults also encounter unique barriers to accessing treatment. Almost half of sexual and gender minority young adults lack health insurance to pay for traditional treatments such as counseling and pharmacotherapy [2] , and there is substantial underuse of existing public health interventions such as tobacco quitlines among this group [3] . There is tremendous unrealized opportunity to reach these young tobacco users via digital means, because they are high adopters of technology [4] and would benefit from the availability of a high-reach, no-cost intervention due to the multiple barriers they face in accessing traditional forms of treatment. However, only one study [5] , published recently, tested a targeted digital intervention-a professionally moderated intervention delivered via Facebook-that was specifically for sexual and gender minority young adults. Although the study showed low biochemically confirmed quit rates overall, it demonstrated the potential efficacy of sexual and gender minority-targeted content, with quit rates for the targeted social media intervention (7%) almost double that of the nontargeted social media intervention (4%) [5] .",
            "cite_spans": [
                {
                    "start": 304,
                    "end": 307,
                    "text": "[1]",
                    "ref_id": "BIBREF0"
                },
                {
                    "start": 608,
                    "end": 611,
                    "text": "[2]",
                    "ref_id": "BIBREF1"
                },
                {
                    "start": 731,
                    "end": 734,
                    "text": "[3]",
                    "ref_id": "BIBREF2"
                },
                {
                    "start": 879,
                    "end": 882,
                    "text": "[4]",
                    "ref_id": "BIBREF3"
                },
                {
                    "start": 1069,
                    "end": 1072,
                    "text": "[5]",
                    "ref_id": "BIBREF4"
                },
                {
                    "start": 1558,
                    "end": 1561,
                    "text": "[5]",
                    "ref_id": "BIBREF4"
                }
            ],
            "ref_spans": [],
            "section": "Introduction"
        },
        {
            "text": "To address the need for an engaging, effective, and accessible treatment approach for sexual and gender minority young adult tobacco users, we engaged in a user-centered design process to develop a digital cessation program targeted for this group and subsequently conducted a single-arm pilot trial to evaluate its acceptability (primary outcome) and preliminary efficacy (secondary outcome) for motivating and supporting smoking cessation. Acceptability, as well as intervention impact on change processes and outcomes (ie, efficacy), are standard benchmarks in intervention development [6] . Together, they help provide proof-of-concept evidence that users will engage with the intervention and that it can impact theory-based change mechanisms and, ultimately, the outcome of interest. The purpose of this study was to evaluate components of the novel program requiring further refinement and to plan a future randomized clinical trial as a next step in treatment development and evaluation.",
            "cite_spans": [
                {
                    "start": 589,
                    "end": 592,
                    "text": "[6]",
                    "ref_id": "BIBREF5"
                }
            ],
            "ref_spans": [],
            "section": "Introduction"
        },
        {
            "text": "The Empowered, Queer, Quitting, and Living (EQQUAL) program is a cultural, linguistic, and sexual and gender minority-targeted adaptation of Flexiquit, a web-based acceptance and commitment therapy (ACT) program designed for young adults at all stages of readiness to quit tobacco use [7] . In addition to focusing on increasing acceptance of smoking triggers and facilitating values-guided action as cessation treatment mechanisms, ACT also teaches generalizable emotion regulation skills that can increase resilience and buffer minority stress [8] among sexual and gender minority young adults. This generalizability stems from a transdiagnostic focus on building psychological flexibility-defined as willingness to experience the full range of emotional, physical, and cognitive experiences without trying to change them and to do things that are difficult in service of one's values [9, 10] . EQQUAL also employs another exciting innovation in digital tobacco treatment: an avatar guide designed to make the program more engaging and effective. The original avatar-led Flexiquit program (not sexual and gender minority-targeted) showed great promise in motivating cessation in a pilot randomized controlled trial with young adults in Cyprus, with a 29% posttreatment quit rate for Flexiquit versus 11% for the waitlist [7] . Importantly, the majority (65%) of participants were in the precontemplation or contemplation stages of change, demonstrating the program's utility for smokers who are at lower levels of quit readiness [7] .",
            "cite_spans": [
                {
                    "start": 285,
                    "end": 288,
                    "text": "[7]",
                    "ref_id": "BIBREF6"
                },
                {
                    "start": 546,
                    "end": 549,
                    "text": "[8]",
                    "ref_id": "BIBREF7"
                },
                {
                    "start": 887,
                    "end": 890,
                    "text": "[9,",
                    "ref_id": "BIBREF9"
                },
                {
                    "start": 891,
                    "end": 894,
                    "text": "10]",
                    "ref_id": "BIBREF10"
                },
                {
                    "start": 1323,
                    "end": 1326,
                    "text": "[7]",
                    "ref_id": "BIBREF6"
                },
                {
                    "start": 1531,
                    "end": 1534,
                    "text": "[7]",
                    "ref_id": "BIBREF6"
                }
            ],
            "ref_spans": [],
            "section": "Part 1: User-Centered Design of EQQUAL"
        },
        {
            "text": "To adapt the original version of the program, which was created for the general population of young adults in Cyprus, to one for a US young adult population self-identifying as sexual and gender minority, 3 major modifications were needed: (1) translation from Greek to English, (2) adaptation of content for US culture (eg, providing examples and metaphors that are more relevant to life in the US), and (3) adaptation of content to sexual and gender minority young adults. After translation, which occurred from August to September 2018, we followed a user-centered design process to adapt the program for the US culture and to a sexual and gender minority young adult population. This included 2 rounds of preliminary user testing (n=7 participants; 2 self-identified as female, 4 self-identified as male, and 1 did not self-identify as male, female, or transgender; 3 self-identified as bisexual and 4 self-identified as gay or lesbian; 2 self-identified as non-Hispanic White, 1 self-identified as non-Hispanic Asian, 1 as self-identified as non-Hispanic Asian and White, and 3 did not provide their race and ethnicity) and a diary study in which participants used the program for 1 week and provided feedback about it via daily diary entries and a final interview (n=8; 2 self-identified as female, 1 self-identified as male; 5 self-identified as transgender or nonbinary; 1 self-identified as bisexual, 2 self-identified as gay, 2 self-identified as queer, and 2-who self-identified as gender minority-did not provide their sexual orientation; 3 self-identified as non-Hispanic White, 2 self-identified as non-Hispanic Asian, and 3 did not provide their race and ethnicity).",
            "cite_spans": [],
            "ref_spans": [],
            "section": "Part 1: User-Centered Design of EQQUAL"
        },
        {
            "text": "A major focus of the user-centered design work to create EQQUAL was updating the appearance, voice, and persona of the avatar guide. The most recent version of the avatar used in the original, nontargeted Flexiquit program was presented as a young woman ( Figure 1 ). As part of the testing, we evaluated users' reactions to this avatar as well as to several other potential program guides, including both human and nonhuman representations. Users unanimously preferred a human guide, with desired qualities being inspiring, fun, and sensitive. Users also indicated that they preferred having a visual representation of the program guide, rather than just a voice, as something concrete that they could count on consistently while they completed the program. Visually, users preferred cartoon-like over realistic-looking avatars. They also preferred avatars that appeared to be androgynous or gender ambiguous. Among the possible human representations presented to users, the previous Flexiquit avatar was not preferred. Users agreed that the avatar should have a backstory and share it and that the tone of the avatar should be conversational and informal. Participants wanted to be able to hear and read the content simultaneously. Several options for voices of the avatar were presented, and a preferred voice was selected on the basis of user testing, which was the voice of a young adult woman. Participants also expressed a desire for an avatar that could be customized or selected based on their ability to identify with it or be inspired by it. With the exception of the customizable avatar, which was cost-prohibitive for this phase of development, all of these user preferences were incorporated into the design of the EQQUAL program.",
            "cite_spans": [],
            "ref_spans": [
                {
                    "start": 256,
                    "end": 264,
                    "text": "Figure 1",
                    "ref_id": "FIGREF0"
                }
            ],
            "section": "Part 1: User-Centered Design of EQQUAL"
        },
        {
            "text": "Aside from the new appearance and backstory of the EQQUAL avatar ( Figure 2 ), user-centered design for sexual and gender minority targeting included development of user stories about sexual and gender minority young adults sharing their motivations and successes in quitting smoking. These stories were written by the research team and evaluated during user testing. During the interviews, users also noted a preference for a social component to the program that would allow users to connect anonymously, such as a quit buddy or support group, as well the ability to give and receive kudos for reaching smoking-related milestones. Similar to avatar customization, this functionality was outside of the scope for this phase but is a planned direction for future versions.",
            "cite_spans": [],
            "ref_spans": [
                {
                    "start": 67,
                    "end": 75,
                    "text": "Figure 2",
                    "ref_id": "FIGREF1"
                }
            ],
            "section": "Part 1: User-Centered Design of EQQUAL"
        },
        {
            "text": "In accordance with stated user preferences of accessing the program on a mobile device, we developed EQQUAL as a responsive mobile-optimized website designed to be used primarily on mobile and tablet devices. Programming was completed in May 2020, at which point we launched a single-arm pilot trial to evaluate its acceptability and preliminary efficacy for cessation and impact on theory-based change mechanisms. ",
            "cite_spans": [],
            "ref_spans": [],
            "section": "Part 1: User-Centered Design of EQQUAL"
        },
        {
            "text": "Eligibility criteria were individuals (1) between 18 and 30 years of age who (2) self-identified as sexual or gender minority (ie, a sexual orientation other than straight, gender that doesn't match sex assigned at birth, or both); (3) resided in the United States; (4) smoked at least 1 cigarette per day over the past 30 days; (5) had at least weekly internet access and were willing and able to stream video online during the 2-month study period; (6) used text messaging; (7) were not engaged in any other smoking cessation treatment at the time of screening, including pharmacotherapies or behavioral counseling, but excluding e-cigarettes or other vaping devices, which are not approved by the US Food and Drug Administration for smoking cessation; and (8) were comfortable reading, writing, and speaking in English.",
            "cite_spans": [
                {
                    "start": 476,
                    "end": 479,
                    "text": "(7)",
                    "ref_id": "BIBREF6"
                }
            ],
            "ref_spans": [],
            "section": "Participants"
        },
        {
            "text": "All study procedures were reviewed and approved by the Scientific Review Committee and the Institutional Review Board of the Fred Hutchinson Cancer Research Center.",
            "cite_spans": [],
            "ref_spans": [],
            "section": "Procedures"
        },
        {
            "text": "Participants were recruited online between May and June 2020 via Facebook and Craigslist advertisements and directed to a screening survey administered via REDCap (Vanderbilt University). To prevent potential fraudulent participation, study staff reviewed the responses of individuals who were potentially eligible for duplicate entries and email addresses were verified. Individuals who were eligible were sent an email indicating their eligibility that required a reply. Individuals who did not reply after 3 attempts (2 reminders were sent over a 14-day period) were no longer contacted for potential recruitment and were sent an email with alternative quit-smoking resources (eg, referrals to 1-800-QUIT-NOW to reach their state quitline and the National Cancer Institute's Smokefree web and mobile app programs).",
            "cite_spans": [],
            "ref_spans": [],
            "section": "Procedures"
        },
        {
            "text": "Individuals who responded to the email were sent another email (and up 2 reminders over a 14-day period, as needed) inviting them to complete a confidential, secure online survey to provide informed consent and complete the baseline assessment. After submitting the baseline assessment, participants received an email indicating that they were enrolled in the study that provided log-in credentials for EQQUAL and information about technical support, study payment, and the follow-up survey. Individuals who did not consent or complete the online enrollment process within 14 days were sent an email notifying them that they were not enrolled; the email provided them with the smoking cessation resources mentioned above.",
            "cite_spans": [],
            "ref_spans": [],
            "section": "Procedures"
        },
        {
            "text": "Two months after enrollment, participants were sent an email inviting them to complete a web-based follow-up survey. A text message was sent on the same day as the email survey invitation to alert participants that the survey would be arriving via email that day. To maximize data retention, participants were sent up to 2 email reminders within 9 days indicating that the follow-up survey was available. Participants who did not complete the survey were called once daily for 5 days and were given the opportunity to complete the follow-up survey by phone. A final attempt was made-a postcard with just 2 follow-up questions (ie, the primary acceptability and efficacy outcome questions) was sent out to those who had not responded by the fifth phone call. Baseline and follow-up survey data were collected and stored in a secure REDCap database.",
            "cite_spans": [],
            "ref_spans": [],
            "section": "Procedures"
        },
        {
            "text": "Participants were compensated US $25 for completing the follow-up survey. To maximize data retention, respondents received a $10 bonus if they completed the survey online within 24 hours of the initial email. Participants who self-reported smoking abstinence were asked to submit saliva cotinine test results and received an additional $25 for doing so. Thus, participants could receive up to $60 in total.",
            "cite_spans": [],
            "ref_spans": [],
            "section": "Procedures"
        },
        {
            "text": "The baseline survey collected information on demographic characteristics, use of alcohol and electronic cigarettes, and smoking history and current smoking behaviors, including the Fagerström Test for Nicotine Dependence score [11] . To assess sexual and gender minority identity, we used 3 items based on consensus recommendations [12] [13] [14] . Two gender minority items focused on sex and gender identity: \"What was your assigned sex at birth, on your original birth certificate?\" (response options: male, female); \"What is your current gender identity (check all that apply)?\" (response options: man/male, woman/female, trans male/trans man, trans female/trans woman, genderqueer/gender nonconforming, different identity, not sure).",
            "cite_spans": [
                {
                    "start": 227,
                    "end": 231,
                    "text": "[11]",
                    "ref_id": "BIBREF11"
                },
                {
                    "start": 332,
                    "end": 336,
                    "text": "[12]",
                    "ref_id": "BIBREF12"
                },
                {
                    "start": 337,
                    "end": 341,
                    "text": "[13]",
                    "ref_id": "BIBREF13"
                },
                {
                    "start": 342,
                    "end": 346,
                    "text": "[14]",
                    "ref_id": "BIBREF14"
                }
            ],
            "ref_spans": [],
            "section": "Assessments"
        },
        {
            "text": "To assess sexual minority identity, participants were asked: \"Do you think of yourself as: (check all that apply):\" (response options: straight (heterosexual), bisexual, gay, lesbian, queer, different than listed, not sure). We considered participants whose current gender identities differed from their birth sex or who answered that they were trans male/man, trans female/woman, genderqueer/gender nonconforming, different, or not sure as gender minority. We considered participants who gave any response to the sexual orientation question other than straight/heterosexual as sexual minority. Since recruitment occurred during the early period of the COVID-19 pandemic, we also included 1 question on the baseline survey (ie, \"Since learning about the coronavirus-also known as COVID-19-has your smoking decreased, increased, or stayed the same?\") and 1 question on the follow-up survey (ie, \"Since you started this study, to what extent has the coronavirus-also known as COVID-19-played a role in motivating you to reduce or quit smoking?\" Response options were \"not at all,\" \"slightly,\" \"somewhat,\" \"moderately, and \"extremely\") to assess the impact of COVID-19 on baseline smoking and motivation to quit during the treatment period.",
            "cite_spans": [],
            "ref_spans": [],
            "section": "Assessments"
        },
        {
            "text": "Primary treatment acceptability endpoints were (1) server-recorded number of log-ins and number of sessions completed during the 2-month study period, and (2) treatment satisfaction, which was assessed using 12 study-specific items on the follow-up survey (eg, \"Overall, how satisfied were you with EQQUAL?\"). Secondary endpoints were (1) biochemically confirmed 7-day point prevalence smoking abstinence at 2 months, and (2) changes in readiness to quit smoking from baseline to follow-up 2 months later assessed via the 11-point Contemplation Ladder [15] , which ranges from 0 (\"No thought about quitting\") to 10 (\"Taking action to quit (eg, cutting down, enrolling in a program)\". Self-reported 7-day point prevalence abstinence (PPA) from smoking was assessed via the question: \"When was the last time you smoked, or even tried, a cigarette?\" Responses of \"8-30 days ago\" and \"over 30 days ago\" were classified as 7-day PPA. All participants who self-reported 7-day PPA at follow-up and no other nicotine use in the past 7 days were sent Alere iScreen saliva kits via overnight mail to verify their smoking status. The iScreen offers qualitative detection of cotinine in saliva at a cut-off level of 30 ng/mL. Participants were sent instructions to complete the test at home and submit test results via a photo of the completed test uploaded in a REDCap form.",
            "cite_spans": [
                {
                    "start": 552,
                    "end": 556,
                    "text": "[15]",
                    "ref_id": "BIBREF15"
                }
            ],
            "ref_spans": [],
            "section": "Assessments"
        },
        {
            "text": "Changes in psychological flexibility, as the theory-based mechanisms of change, from baseline to 2 months were exploratory endpoints. This included (1) changes in acceptance of smoking triggers (emotional and physical subscales of the adapted Avoidance and Inflexibility Scale [16, 17] , 18 items), (2) overall psychological flexibility (24-item short version of the Multidimensional Psychological Flexibility Inventory [18] , which has 2 composite scores representing psychological flexibility and psychological inflexibility), and (3) valued living (10-item Valuing Questionnaire [19] , which has 2 subscales representing values progress, 5 items, and values obstruction, 5 items).",
            "cite_spans": [
                {
                    "start": 277,
                    "end": 281,
                    "text": "[16,",
                    "ref_id": "BIBREF16"
                },
                {
                    "start": 282,
                    "end": 285,
                    "text": "17]",
                    "ref_id": "BIBREF17"
                },
                {
                    "start": 420,
                    "end": 424,
                    "text": "[18]",
                    "ref_id": "BIBREF18"
                },
                {
                    "start": 582,
                    "end": 586,
                    "text": "[19]",
                    "ref_id": "BIBREF19"
                }
            ],
            "ref_spans": [],
            "section": "Assessments"
        },
        {
            "text": "We also explored acceptability of the EQQUAL avatar, called Jen, at follow-up 2 months after enrollment using the Agent Persona Inventory [20] , which contains 25 items rated on a 1 (strongly disagree) to 5 (strongly agree) scale, with 4 subscales: facilitating learning (10 items; eg, \"Jen kept my attention\"), credible (5 items; eg, \"Jen was knowledgeable\"), human-like (5 items; eg, \"Jen showed emotion\"), and engaging (5 items; eg, \"Jen was expressive\"). We also included a set of items assessing the avatar's attributes, drawing in part from items on the Robotic Social Attributes Scale [21] . On these items, the avatar's attributes were rated on a 1 (definitely does not describe Jen) to 9 (definitely describes Jen) scale and included the following: pleasant, likable, agreeable, trustworthy, sincere, supportive, relatable, credible, scary, strange, awkward, and judgmental. We also included 4 open-ended, study-specific questions to assess acceptability of the avatar: (1) ",
            "cite_spans": [
                {
                    "start": 138,
                    "end": 142,
                    "text": "[20]",
                    "ref_id": "BIBREF20"
                },
                {
                    "start": 592,
                    "end": 596,
                    "text": "[21]",
                    "ref_id": "BIBREF22"
                }
            ],
            "ref_spans": [],
            "section": "Assessments"
        },
        {
            "text": "Consistent with the original, nontargeted program, EQQUAL contained 6 sessions designed to be completed in order, with a minimum of 3 days between sessions and automated pacing and prompting from the program. Sessions took approximately 10 to 30 minutes to complete. A single text message reminder was used to prompt availability of the next session. Session 1 PDF handouts were emailed to participants 2 days after enrollment, along with instructions for requesting technical support. At the end of the program, participants were sent an email with session handouts.",
            "cite_spans": [],
            "ref_spans": [],
            "section": "EQQUAL intervention"
        },
        {
            "text": "Content followed the ACT treatment model [9, 22] . Session 1 introduced the avatar guide Jen who provided an overview of the program and shared their own story of quitting. Users completed an interactive game to identify personal values guiding quitting and reviewed stories from other sexual and gender minority young adults who quit smoking. Session 2 focused on trigger awareness through interactive questions, graphs, pictures, and experiential exercises and metaphors, and it introduced the ACT concept of creative hopelessness-recognizing that efforts to control thoughts, feelings, or sensations related to smoking can be counterproductive. Session 3 completed the topic of creative hopelessness and introduced cognitive defusion-psychological distancing from thoughts-as an alternative to thought control as a means of achieving goals and living a valued life. Session 4 completed the topic of cognitive defusion, encouraged setting a quit date in the subsequent week, and prompted users to practice defusing from thoughts (eg, \"I won't be able to quit\") as part of quit planning. Session 5 started with a reflection on the past week's successes and difficulties, introduced acceptance and willingness to have unwanted thoughts and emotions as a means of handling smoking triggers, and covered relapse prevention via self-compassion and recommitment to quitting. Session 6 also started with a reflection on the past week's successes and difficulties, reviewed content from previous sessions, and ended with a video emphasizing the importance of letting go of the need to control internal experiences such as feelings, sensations, and thoughts as a means to achieve goals. EQQUAL also included information about US Food and Drug Administration-approved smoking cessation medications and encouraged users to consider using a medication to support quitting. EQQUAL was accompanied by daily text messages that provided (1) motivational messages, (2) new session availability prompts, and (3) reminders of information discussed in the program.",
            "cite_spans": [
                {
                    "start": 41,
                    "end": 44,
                    "text": "[9,",
                    "ref_id": "BIBREF9"
                },
                {
                    "start": 45,
                    "end": 48,
                    "text": "22]",
                    "ref_id": "BIBREF23"
                }
            ],
            "ref_spans": [],
            "section": "EQQUAL intervention"
        },
        {
            "text": "The sexual and gender minority-targeted treatment content in EQQUAL focused on (1) unique motivations for quitting among sexual and gender minority individuals, such as the desire for freedom to live one's life openly (eg, not having to hide smoking from family, as sexual and gender identity may have been hidden); (2) tools for coping with minority stress and its mental health sequelae (eg, evidence-based ACT skills for depression and anxiety); (3) self-compassion exercises focused on managing internalized shame, which can serve as a trigger for tobacco use; and (4) targeted videos and infographics describing the impact of tobacco use on the LGBTQ+ community. The appearance and backstory of the EQQUAL avatar guide was also designed to suggest that the avatar identified as a sexual and gender minority young adult ( Figure 2 ). Figure 3 shows the program home screen (desktop view), along with examples of the sexual and gender minority-targeted quit stories ( Figure 4 ) and interactive games to promote engagement with the program ( Figure 5 ). ",
            "cite_spans": [],
            "ref_spans": [
                {
                    "start": 826,
                    "end": 834,
                    "text": "Figure 2",
                    "ref_id": "FIGREF1"
                },
                {
                    "start": 838,
                    "end": 846,
                    "text": "Figure 3",
                    "ref_id": "FIGREF3"
                },
                {
                    "start": 971,
                    "end": 979,
                    "text": "Figure 4",
                    "ref_id": "FIGREF4"
                },
                {
                    "start": 1045,
                    "end": 1053,
                    "text": "Figure 5",
                    "ref_id": "FIGREF5"
                }
            ],
            "section": "EQQUAL intervention"
        },
        {
            "text": "Because pilot trials differ from efficacy trials in their aims and scope, techniques that are employed for sample size determination in an efficacy trial (ie, power analysis) are not appropriate for a Stage 1 pilot trial [23] . The stage model of behavioral treatment development suggests that pilot treatment development trials should include approximately 15 to 30 participants per arm to test feasibility [23] . A sample size of 25 was chosen on the basis of this recommendation. Because this is a single-arm pilot trial, this study is not designed for power to detect statistically significant changes in response to treatment. However, we planned to preliminarily and descriptively assess the outcomes of the intervention to inform further refinements of EQQUAL and obtain the information necessary to optimize the study design in preparation for a subsequent Stage 2 efficacy trial.",
            "cite_spans": [
                {
                    "start": 221,
                    "end": 225,
                    "text": "[23]",
                    "ref_id": "BIBREF24"
                },
                {
                    "start": 408,
                    "end": 412,
                    "text": "[23]",
                    "ref_id": "BIBREF24"
                }
            ],
            "ref_spans": [],
            "section": "Sample Size"
        },
        {
            "text": "Given the pilot nature of the study, all statistical analyses are descriptive. Frequencies (for categorical variables) or means and standard deviations (for continuous variables) are reported for all endpoints, including change scores. Categorical ratings for treatment satisfaction questions were dichotomized as useful (\"somewhat,\" \"mostly,\" or \"very\") versus lower ratings based on a priori analysis plans (clinicaltrials.gov, NCT04194918). For smoking abstinence outcomes, we report results (1) including only participants who provided data on smoking abstinence at follow-up (complete-case) and (2) including all participants and imputing missing smoking data as nonabstinence.",
            "cite_spans": [],
            "ref_spans": [],
            "section": "Statistical Analysis Plan"
        },
        {
            "text": "As planned, we enrolled 25 participants, but we excluded 3 participants postenrollment due to suspected fraudulent behavior (eg, providing different dates of birth at baseline and follow-up), leaving a final sample of 22 (Multimedia Appendix 1). Of these 22 participants, all identified as sexual minority (n=22, of whom 13 self-identified as bisexual, 3 self-identified as gay, and 6 self-identified as lesbian; 5 selected \"queer\" in addition to one of the other options) and a portion also self-identified as gender minority (n=7, of whom 3 self-identified as a trans man, 3 self-identified as genderqueer, and 1 self-identified as not sure). Over half (12/22; 55%) reported vaping as well as smoking.",
            "cite_spans": [],
            "ref_spans": [],
            "section": "General"
        },
        {
            "text": "Ages ranged from 18 to 30, with a mean of 23.5 (SD 3.9). Over one-quarter (6/22; 27%) self-identified as racial minorities (n=1 self-identified as American Indian/Alaska Native, n=3 self-identified as Asian, n=2 self-identified as more than one race). The majority were employed (16/22; 73%) ",
            "cite_spans": [
                {
                    "start": 279,
                    "end": 291,
                    "text": "(16/22; 73%)",
                    "ref_id": null
                }
            ],
            "ref_spans": [],
            "section": "General"
        },
        {
            "text": "We screened 118 individuals over a 1-month period to enroll 22 participants. Recruitment occurred via Facebook (61% of those screened) and Craigslist advertisements (39%). Seventeen participants completed the follow-up survey (77% data retention). All 17 completed the survey online; 8 participants completed the survey within 24 hours of receiving the link, 3 participants completed the survey after 1 or 2 email reminders, and 6 participants completed the survey after 2 email reminders and 1 or more phone call reminders. Six participants who self-reported 7-day PPA from smoking and indicated using no other sources of nicotine during those 7 days were sent a cotinine kit, and all 6 (100% adherence) submitted a photo of the completed test as requested. One participant reported abstinence from cigarettes but use of other nicotine-containing products and was not sent a cotinine test kit.",
            "cite_spans": [],
            "ref_spans": [],
            "section": "Design Feasibility"
        },
        {
            "text": "Among those with at least 1 log-in (n=18), the mean number of log-ins was 5.5 (SD 3.6), mean sessions completed was 3.1 (SD 2.6), and 39% of participants (7/18) completed all 6 sessions. Among follow-up respondents who provided satisfaction ratings (n=15), 93% (14/15) rated EQQUAL as useful, 93% (14/15) reported being satisfied with the program, and 87% (13/15) said they would recommend it to a friend. Considering specific program components, 71% (10/14) felt that text messages were useful and 93% (14/15) reported that PDF handouts (eg, health benefits of quitting, smoking and the LGBTQ+ community) were useful. All but 1 participant (93%; 14/15) said they felt as though the program was made for them. All participants (15/15; 100%) said the program was easy to navigate, 100% (15/15) reported that they felt more clear about how they might quit as a result of using the program, and 93% (14/15) said it gave them new ways of looking at quitting.",
            "cite_spans": [],
            "ref_spans": [],
            "section": "Primary Endpoint"
        },
        {
            "text": "Biochemically confirmed 7-day PPA was 22.7% (5/22) with missing data imputed as continued smoking (missing=smoking), and 31.3% (5/16) using the complete-case method. Self-reported 7-day PPA was 31.8% (7/22) in the missing=smoking analysis and 41% (7/17) in complete-case analyses. Participants also showed an overall increase in readiness to quit, averaging a 2.1-point increase (SD 3.0) on the 11-point Contemplation Ladder from baseline to 2 months.",
            "cite_spans": [
                {
                    "start": 200,
                    "end": 206,
                    "text": "(7/22)",
                    "ref_id": null
                }
            ],
            "ref_spans": [],
            "section": "Secondary Endpoints"
        },
        {
            "text": "To understand the relationship between smoking abstinence and \"dosage\" received of the EQQUAL program, we descriptively examined, as a post hoc analysis, differences in program usage between those participants who achieved biochemically confirmed, missing=smoking 7-day PPA (n=5) to those who didn't (n=17). Smoking abstainers had numerically higher program usage metrics than nonabstainers, including number of log-ins (mean 7.2, SD 3.9 for abstainers; mean 3.7, SD 3.6 for nonabstainers), number of sessions completed (mean 4.8, SD 2.7 for abstainers; mean 1.8, SD 2.3 or nonabstainers), and completion of all 6 sessions (80% of abstainers; 18% of nonabstainers).",
            "cite_spans": [],
            "ref_spans": [],
            "section": "Secondary Endpoints"
        },
        {
            "text": "Exploration of changes in values-based action on the Valuing Questionnaire [19] ) showed a modest increase in Values Progress (mean +2.9, SD 4.4) and decrease in Values Obstruction (mean -3.3, SD 7.3). Acceptance of smoking triggers on the Avoidance and Inflexibility Scale [16] showed minimal average change from baseline to follow-up (mean +0. . On items where participants rated the avatar's attributes on a 1 to 9 scale from \"definitely does not describe Jen\" to \"definitely describes Jen,\" all of the positive attributes were rated highly: pleasant (mean 7.4, SD 2), likable (mean 7.5, SD 2), agreeable (mean 7.5, SD 2), trustworthy (mean 7.3, SD 2.1), sincere (mean 7.7, SD 2), supportive (mean 7.7, SD 2), relatable (mean 7, SD 2.3), and credible (mean 7, SD 2). Negative attributes all had lower scores: scary (mean 1. ",
            "cite_spans": [
                {
                    "start": 75,
                    "end": 79,
                    "text": "[19]",
                    "ref_id": "BIBREF19"
                },
                {
                    "start": 274,
                    "end": 278,
                    "text": "[16]",
                    "ref_id": "BIBREF16"
                }
            ],
            "ref_spans": [],
            "section": "Exploratory Endpoints"
        },
        {
            "text": "The aim of this work was to develop and evaluate the acceptability and preliminary efficacy of an avatar-led digital smoking cessation program targeted for sexual and gender minority young adults. The product of our user-centered design work, the EQQUAL program, demonstrated strong acceptability and efficacy in a single-arm pilot trial with 22 sexual and gender minority young adults. For example, 93% of participants (14/15) were satisfied with the EQQUAL program, 100% (15/15) found it easy to use, and 100% (15/15) said it helped them be clearer about how to quit. Both quantitative and qualitative results suggested a positive overall response to the avatar, with areas for future improvement largely centered on the avatar's appearance and movements. Regarding treatment utilization, including only those who logged in at least once (n=18), participants logged in an average of 6 times and completed an average of 3 sessions, with 39% completing all 6 sessions. This suggests that there is room for improvement in keeping users engaged with the program as a means of enhancing outcomes [24] . Indeed, our post hoc analysis suggested that there may be a relationship between engagement and outcomes given that 80% (4/5) of the participants who quit smoking completed all 6 sessions compared with only 18% (3/17) of the participants who did not quit. In addition to avatar improvements (eg, making the avatar's body movements more natural) and customization options (eg, offering choice of avatars with varying gender expression, race, ethnicity, etc), in future iterations of the program, we also plan to implement a social feature that was suggested by users in the initial user-centered design work but was out of scope for the present work. Social connectedness has been demonstrated to increase engagement in other digital programs [25] and was associated with better engagement and abstinence outcomes in an online tobacco treatment program [26, 27] . In addition, to prompt continued program use, we plan to include multiple session availability reminders rather than relying on a single reminder when a new session becomes available.",
            "cite_spans": [
                {
                    "start": 420,
                    "end": 427,
                    "text": "(14/15)",
                    "ref_id": null
                },
                {
                    "start": 1093,
                    "end": 1097,
                    "text": "[24]",
                    "ref_id": "BIBREF25"
                },
                {
                    "start": 1842,
                    "end": 1846,
                    "text": "[25]",
                    "ref_id": "BIBREF26"
                },
                {
                    "start": 1952,
                    "end": 1956,
                    "text": "[26,",
                    "ref_id": "BIBREF27"
                },
                {
                    "start": 1957,
                    "end": 1960,
                    "text": "27]",
                    "ref_id": "BIBREF28"
                }
            ],
            "ref_spans": [],
            "section": "Discussion"
        },
        {
            "text": "Compared to the only other targeted digital intervention for sexual and gender minority young adults-a professionally moderated Facebook intervention-the self-guided EQQUAL program's biochemically confirmed quit rate was over 3 times higher (22.7% vs 7.1%) [5] . It is also 6 to 10 times higher than biochemically confirmed quit rates for the nontargeted Facebook intervention (3.7%) and the Smokefree website (1.7%) arms in the same study [5] . It is worth noting that study participants' readiness to quit smoking at baseline spanned the full range of the Contemplation Ladder, from 0 to 10, suggesting that even sexual and gender minority young adults with very low motivation to quit may be willing to engage with, and may benefit from, an intervention that is designed for smokers at all levels of quit readiness. This was the case in the original Flexiquit trial, where a 29% quit rate was obtained even though 65% of the sample reported low readiness to quit at baseline [7] .",
            "cite_spans": [
                {
                    "start": 257,
                    "end": 260,
                    "text": "[5]",
                    "ref_id": "BIBREF4"
                },
                {
                    "start": 440,
                    "end": 443,
                    "text": "[5]",
                    "ref_id": "BIBREF4"
                },
                {
                    "start": 978,
                    "end": 981,
                    "text": "[7]",
                    "ref_id": "BIBREF6"
                }
            ],
            "ref_spans": [],
            "section": "Discussion"
        },
        {
            "text": "In order to understand the impact of the EQQUAL program on ACT's key theory-based change mechanisms, we included several measures of psychological flexibility, which generally showed modest theory-consistent improvements. The largest improvements were observed for the Values Questionnaire. Greater change on the Values Questionnaire may be due to the heavy emphasis on values in the first 2 sessions, with the treatment dosage of later acceptance-based content limited by less engagement with the latter sessions. Alternatively, it could be that the values-based action component of psychological flexibility precedes changes in other processes that take longer to develop in this new context of ACT for smokers across all stages of quit readiness, as has been observed in studies of ACT for other conditions [28] .",
            "cite_spans": [
                {
                    "start": 810,
                    "end": 814,
                    "text": "[28]",
                    "ref_id": "BIBREF29"
                }
            ],
            "ref_spans": [],
            "section": "Discussion"
        },
        {
            "text": "This study had a number of limitations that should be considered when interpreting the results. Primary limitations stem from the small sample size and that causality cannot be determined from a single-arm pilot trial; therefore, conclusions about EQQUAL's efficacy or impact on theory-based change mechanisms are tentative and require evaluation in a larger, controlled clinical trial. Due to the small sample size, representativeness and generalizability are limited. For example, although 25% of the sample identified as a racial or ethnic minority, not every race and ethnicity could be represented. Another limitation concerning the generalizability of findings is that the data were collected during the early period of the COVID-19 pandemic, which may have impacted participants' perceptions of the EQQUAL program and their willingness and ability to quit smoking. Based on the COVID-19-related questions that we included in the baseline and follow-up surveys, there were mixed findings regarding the pandemic's impact on smoking and motivation to reduce or quit, with some participants reporting little or no impact, some increasing their smoking, and some decreasing their smoking or experiencing increased motivation to reduce or quit smoking. Overall, the reported intensity of smoking at baseline (ie, averaging 7.6 cigarettes per day) is not atypical, as a majority of young adults smoke less than one-half pack (ie, less than 10 cigarettes) per day [29] . Another limitation is that it was not feasible in this pilot trial to conduct the testing that would allow us to biochemically verify smoking abstinence among participants who used other nicotine and tobacco products (eg, e-cigarettes). In future work, we plan to use a multimethod approach combining remote carbon monoxide monitoring with cotinine testing to address this limitation.",
            "cite_spans": [
                {
                    "start": 1463,
                    "end": 1467,
                    "text": "[29]",
                    "ref_id": "BIBREF30"
                }
            ],
            "ref_spans": [],
            "section": "Discussion"
        },
        {
            "text": "In spite of the study's limitations, this work is significant and innovative in 5 key respects: (1) It focuses on a tobacco-related health disparities group that has been underserved in health-related research to date and in tobacco treatment research in particular. (2) It is the first evaluation of a self-guided digital cessation treatment for sexual and gender minority young adults, maximizing scalability and addressing sexual and gender minority youths' desire for a program targeted to their unique needs and challenges. (3) It applies a novel treatment approach and advances the science of ACT for tobacco cessation by testing its effectiveness for tobacco users at all stages of readiness to quit rather than only among those who are ready to quit. (4) The self-guided, digital format makes EQQUAL readily accessible to sexual and gender minority young adults who lack health insurance and who have low engagement and quit rates with currently available public health interventions for cessation. (5) Using avatars and interactive games as engagement strategies is substantially different than existing treatments. These strengths warrant continued development and evaluation of the EQQUAL program in a randomized controlled pilot trial.",
            "cite_spans": [
                {
                    "start": 267,
                    "end": 270,
                    "text": "(2)",
                    "ref_id": "BIBREF1"
                }
            ],
            "ref_spans": [],
            "section": "Discussion"
        }
    ],
    "bib_entries": {
        "BIBREF0": {
            "ref_id": "b0",
            "title": "Tobacco harm perceptions and use among sexual and gender minorities: findings from a national sample of young adults in the United States",
            "authors": [
                {
                    "first": "O",
                    "middle": [],
                    "last": "Ganz",
                    "suffix": ""
                },
                {
                    "first": "A",
                    "middle": [
                        "L"
                    ],
                    "last": "Johnson",
                    "suffix": ""
                },
                {
                    "first": "A",
                    "middle": [
                        "M"
                    ],
                    "last": "Cohn",
                    "suffix": ""
                },
                {
                    "first": "J",
                    "middle": [],
                    "last": "Rath",
                    "suffix": ""
                },
                {
                    "first": "K",
                    "middle": [],
                    "last": "Horn",
                    "suffix": ""
                },
                {
                    "first": "D",
                    "middle": [],
                    "last": "Vallone",
                    "suffix": ""
                }
            ],
            "year": 2018,
            "venue": "Addict Behav",
            "volume": "81",
            "issn": "",
            "pages": "104--108",
            "other_ids": {
                "DOI": [
                    "10.1016/j.addbeh.2018.01.032"
                ]
            }
        },
        "BIBREF1": {
            "ref_id": "b1",
            "title": "Differences in healthcare access, use, and experiences within a community sample of racially diverse lesbian, gay, bisexual, transgender, and questioning emerging adults",
            "authors": [
                {
                    "first": "K",
                    "middle": [],
                    "last": "Macapagal",
                    "suffix": ""
                },
                {
                    "first": "R",
                    "middle": [],
                    "last": "Bhatia",
                    "suffix": ""
                },
                {
                    "first": "G",
                    "middle": [
                        "J"
                    ],
                    "last": "Greene",
                    "suffix": ""
                }
            ],
            "year": 2016,
            "venue": "LGBT Health",
            "volume": "3",
            "issn": "6",
            "pages": "434--442",
            "other_ids": {
                "DOI": [
                    "10.1089/lgbt.2015.0124"
                ]
            }
        },
        "BIBREF2": {
            "ref_id": "b2",
            "title": "Rates and reasons: disparities in low intentions to use a state smoking cessation quitline",
            "authors": [
                {
                    "first": "E",
                    "middle": [
                        "K"
                    ],
                    "last": "Burns",
                    "suffix": ""
                },
                {
                    "first": "E",
                    "middle": [
                        "A"
                    ],
                    "last": "Deaton",
                    "suffix": ""
                },
                {
                    "first": "A",
                    "middle": [
                        "H"
                    ],
                    "last": "Levinson",
                    "suffix": ""
                }
            ],
            "year": 2011,
            "venue": "Am J Health Promot",
            "volume": "25",
            "issn": "5",
            "pages": "59--65",
            "other_ids": {
                "DOI": [
                    "10.4278/ajhp.100611-QUAN-183"
                ]
            }
        },
        "BIBREF3": {
            "ref_id": "b3",
            "title": "Smartphone ownership among US adult cigarette smokers: 2014 Health Information National Trends Survey (HINTS) data",
            "authors": [
                {
                    "first": "J",
                    "middle": [
                        "L"
                    ],
                    "last": "Heffner",
                    "suffix": ""
                },
                {
                    "first": "K",
                    "middle": [
                        "E"
                    ],
                    "last": "Mull",
                    "suffix": ""
                }
            ],
            "year": 2017,
            "venue": "J Med Internet Res",
            "volume": "19",
            "issn": "8",
            "pages": "",
            "other_ids": {
                "DOI": [
                    "10.2196/jmir.7953"
                ]
            }
        },
        "BIBREF4": {
            "ref_id": "b4",
            "title": "The Put It Out Project (POP) Facebook intervention for young sexual and gender minority smokers: outcomes of a pilot, randomized, controlled trial",
            "authors": [
                {
                    "first": "E",
                    "middle": [
                        "A"
                    ],
                    "last": "Vogel",
                    "suffix": ""
                },
                {
                    "first": "D",
                    "middle": [
                        "E"
                    ],
                    "last": "Ramo",
                    "suffix": ""
                },
                {
                    "first": "M",
                    "middle": [
                        "C"
                    ],
                    "last": "Meacham",
                    "suffix": ""
                },
                {
                    "first": "J",
                    "middle": [
                        "J"
                    ],
                    "last": "Prochaska",
                    "suffix": ""
                },
                {
                    "first": "K",
                    "middle": [
                        "L"
                    ],
                    "last": "Delucchi",
                    "suffix": ""
                },
                {
                    "first": "G",
                    "middle": [
                        "L"
                    ],
                    "last": "Humfleet",
                    "suffix": ""
                }
            ],
            "year": 2020,
            "venue": "Nicotine Tob Res",
            "volume": "22",
            "issn": "9",
            "pages": "1614--1621",
            "other_ids": {
                "DOI": [
                    "10.1093/ntr/ntz184"
                ]
            }
        },
        "BIBREF5": {
            "ref_id": "b5",
            "title": "Exploratory studies to decide whether and how to proceed with full-scale evaluations of public health interventions: a systematic review of guidance",
            "authors": [
                {
                    "first": "B",
                    "middle": [],
                    "last": "Hallingberg",
                    "suffix": ""
                },
                {
                    "first": "R",
                    "middle": [],
                    "last": "Turley",
                    "suffix": ""
                },
                {
                    "first": "J",
                    "middle": [],
                    "last": "Segrott",
                    "suffix": ""
                },
                {
                    "first": "D",
                    "middle": [],
                    "last": "Wight",
                    "suffix": ""
                },
                {
                    "first": "P",
                    "middle": [],
                    "last": "Craig",
                    "suffix": ""
                },
                {
                    "first": "L",
                    "middle": [],
                    "last": "Moore",
                    "suffix": ""
                }
            ],
            "year": 2018,
            "venue": "Pilot Feasibility Stud",
            "volume": "4",
            "issn": "",
            "pages": "",
            "other_ids": {
                "DOI": [
                    "10.1186/s40814-018-0290-8"
                ]
            }
        },
        "BIBREF6": {
            "ref_id": "b6",
            "title": "An avatar-led intervention promotes smoking cessation in young adults: a pilot randomized clinical trial",
            "authors": [
                {
                    "first": "M",
                    "middle": [],
                    "last": "Karekla",
                    "suffix": ""
                },
                {
                    "first": "S",
                    "middle": [
                        "N"
                    ],
                    "last": "Savvides",
                    "suffix": ""
                },
                {
                    "first": "A",
                    "middle": [],
                    "last": "Gloster",
                    "suffix": ""
                }
            ],
            "year": 2020,
            "venue": "Ann Behav Med",
            "volume": "54",
            "issn": "10",
            "pages": "747--760",
            "other_ids": {
                "DOI": [
                    "10.1093/abm/kaaa013"
                ]
            }
        },
        "BIBREF7": {
            "ref_id": "b7",
            "title": "The impact of work stress on sexual minority employees: could psychological flexibility be a helpful solution? Stress Health",
            "authors": [
                {
                    "first": "R",
                    "middle": [
                        "S"
                    ],
                    "last": "Singh",
                    "suffix": ""
                },
                {
                    "first": "W",
                    "middle": [
                        "H"
                    ],
                    "last": "O&apos;brien",
                    "suffix": ""
                }
            ],
            "year": 2020,
            "venue": "",
            "volume": "36",
            "issn": "",
            "pages": "59--74",
            "other_ids": {
                "DOI": [
                    "10.1002/smi.2913"
                ]
            }
        },
        "BIBREF8": {
            "ref_id": "b8",
            "title": "| iss. 7 | e30241 | p",
            "authors": [],
            "year": null,
            "venue": "",
            "volume": "5",
            "issn": "",
            "pages": "",
            "other_ids": {}
        },
        "BIBREF9": {
            "ref_id": "b9",
            "title": "Acceptance and commitment therapy: model, processes and outcomes",
            "authors": [
                {
                    "first": "S",
                    "middle": [
                        "C"
                    ],
                    "last": "Hayes",
                    "suffix": ""
                },
                {
                    "first": "J",
                    "middle": [
                        "B"
                    ],
                    "last": "Luoma",
                    "suffix": ""
                },
                {
                    "first": "F",
                    "middle": [
                        "W"
                    ],
                    "last": "Bond",
                    "suffix": ""
                },
                {
                    "first": "A",
                    "middle": [],
                    "last": "Masuda",
                    "suffix": ""
                },
                {
                    "first": "J",
                    "middle": [],
                    "last": "Lillis",
                    "suffix": ""
                }
            ],
            "year": 2006,
            "venue": "Behav Res Ther",
            "volume": "44",
            "issn": "1",
            "pages": "1--25",
            "other_ids": {
                "DOI": [
                    "10.1016/j.brat.2005.06.006"
                ]
            }
        },
        "BIBREF10": {
            "ref_id": "b10",
            "title": "Acceptance and commitment therapy, relational frame theory, and the third wave of behavioral and cognitive therapies -republished article",
            "authors": [
                {
                    "first": "S",
                    "middle": [
                        "C"
                    ],
                    "last": "Hayes",
                    "suffix": ""
                }
            ],
            "year": 2016,
            "venue": "Behav Ther",
            "volume": "47",
            "issn": "6",
            "pages": "869--885",
            "other_ids": {
                "DOI": [
                    "10.1016/j.beth.2016.11.006"
                ]
            }
        },
        "BIBREF11": {
            "ref_id": "b11",
            "title": "The Fagerström Test for Nicotine Dependence: a revision of the Fagerström Tolerance Questionnaire",
            "authors": [
                {
                    "first": "T",
                    "middle": [
                        "F"
                    ],
                    "last": "Heatherton",
                    "suffix": ""
                },
                {
                    "first": "L",
                    "middle": [
                        "T"
                    ],
                    "last": "Kozlowski",
                    "suffix": ""
                },
                {
                    "first": "R",
                    "middle": [
                        "C"
                    ],
                    "last": "Frecker",
                    "suffix": ""
                },
                {
                    "first": "K",
                    "middle": [
                        "O"
                    ],
                    "last": "Fagerström",
                    "suffix": ""
                }
            ],
            "year": 1991,
            "venue": "Br J Addict",
            "volume": "86",
            "issn": "9",
            "pages": "1119--1127",
            "other_ids": {}
        },
        "BIBREF12": {
            "ref_id": "b12",
            "title": "We are in This Together: promoting health equity, diversity, and inclusion in tobacco research for sexual and gender minority populations",
            "authors": [
                {
                    "first": "S",
                    "middle": [
                        "S"
                    ],
                    "last": "Dermody",
                    "suffix": ""
                },
                {
                    "first": "J",
                    "middle": [
                        "L"
                    ],
                    "last": "Heffner",
                    "suffix": ""
                },
                {
                    "first": "J",
                    "middle": [
                        "T"
                    ],
                    "last": "Hinds",
                    "suffix": ""
                },
                {
                    "first": "J",
                    "middle": [],
                    "last": "Mcquoid",
                    "suffix": ""
                },
                {
                    "first": "A",
                    "middle": [
                        "J"
                    ],
                    "last": "Quisenberry",
                    "suffix": ""
                },
                {
                    "first": "Asl",
                    "middle": [],
                    "last": "Tan",
                    "suffix": ""
                }
            ],
            "year": 2020,
            "venue": "Nicotine Tob Res",
            "volume": "22",
            "issn": "12",
            "pages": "2276--2279",
            "other_ids": {
                "DOI": [
                    "10.1093/ntr/ntaa070"
                ]
            }
        },
        "BIBREF13": {
            "ref_id": "b13",
            "title": "Best practices for asking questions to identify transgender and other gender minority respondents on population-based surveys. The Williams Institute",
            "authors": [],
            "year": 2014,
            "venue": "Survey-Measures-Trans-GenIUSS",
            "volume": "",
            "issn": "",
            "pages": "",
            "other_ids": {}
        },
        "BIBREF14": {
            "ref_id": "b14",
            "title": "Best practices for asking questions about sexual orientation on surveys",
            "authors": [],
            "year": 2009,
            "venue": "",
            "volume": "",
            "issn": "",
            "pages": "",
            "other_ids": {}
        },
        "BIBREF15": {
            "ref_id": "b15",
            "title": "The Contemplation Ladder: validation of a measure of readiness to consider smoking cessation",
            "authors": [
                {
                    "first": "L",
                    "middle": [],
                    "last": "Biener",
                    "suffix": ""
                },
                {
                    "first": "D",
                    "middle": [
                        "B"
                    ],
                    "last": "Abrams",
                    "suffix": ""
                }
            ],
            "year": 1991,
            "venue": "Health Psychol",
            "volume": "10",
            "issn": "5",
            "pages": "360--365",
            "other_ids": {}
        },
        "BIBREF16": {
            "ref_id": "b16",
            "title": "Acceptance-based treatment for smoking cessation",
            "authors": [
                {
                    "first": "E",
                    "middle": [
                        "V"
                    ],
                    "last": "Gifford",
                    "suffix": ""
                },
                {
                    "first": "B",
                    "middle": [
                        "S"
                    ],
                    "last": "Kohlenberg",
                    "suffix": ""
                },
                {
                    "first": "S",
                    "middle": [
                        "C"
                    ],
                    "last": "Hayes",
                    "suffix": ""
                },
                {
                    "first": "D",
                    "middle": [
                        "O"
                    ],
                    "last": "Antonuccio",
                    "suffix": ""
                },
                {
                    "first": "M",
                    "middle": [
                        "M"
                    ],
                    "last": "Piasecki",
                    "suffix": ""
                },
                {
                    "first": "M",
                    "middle": [
                        "L"
                    ],
                    "last": "Rasmussen-Hall",
                    "suffix": ""
                }
            ],
            "year": 2004,
            "venue": "Behavior Therapy",
            "volume": "35",
            "issn": "4",
            "pages": "689--705",
            "other_ids": {
                "DOI": [
                    "10.1016/S0005-7894(04)80015-7"
                ]
            }
        },
        "BIBREF17": {
            "ref_id": "b17",
            "title": "Pilot randomized controlled trial of web-based acceptance and commitment therapy for smoking cessation",
            "authors": [
                {
                    "first": "J",
                    "middle": [],
                    "last": "Bricker",
                    "suffix": ""
                },
                {
                    "first": "C",
                    "middle": [],
                    "last": "Wyszynski",
                    "suffix": ""
                },
                {
                    "first": "B",
                    "middle": [],
                    "last": "Comstock",
                    "suffix": ""
                },
                {
                    "first": "J",
                    "middle": [
                        "L"
                    ],
                    "last": "Heffner",
                    "suffix": ""
                }
            ],
            "year": 2013,
            "venue": "Nicotine Tob Res",
            "volume": "15",
            "issn": "10",
            "pages": "1756--1764",
            "other_ids": {
                "DOI": [
                    "10.1093/ntr/ntt056"
                ]
            }
        },
        "BIBREF18": {
            "ref_id": "b18",
            "title": "Disentangling components of flexibility via the hexaflex model: development and validation of the Multidimensional Psychological Flexibility Inventory (MPFI)",
            "authors": [
                {
                    "first": "J",
                    "middle": [
                        "L"
                    ],
                    "last": "Rolffs",
                    "suffix": ""
                },
                {
                    "first": "R",
                    "middle": [
                        "D"
                    ],
                    "last": "Rogge",
                    "suffix": ""
                },
                {
                    "first": "K",
                    "middle": [
                        "G"
                    ],
                    "last": "Wilson",
                    "suffix": ""
                }
            ],
            "year": 2018,
            "venue": "Assessment",
            "volume": "25",
            "issn": "4",
            "pages": "458--482",
            "other_ids": {
                "DOI": [
                    "10.1177/1073191116645905"
                ]
            }
        },
        "BIBREF19": {
            "ref_id": "b19",
            "title": "Development of the Valuing Questionnaire (VQ)",
            "authors": [
                {
                    "first": "M",
                    "middle": [],
                    "last": "Smout",
                    "suffix": ""
                },
                {
                    "first": "M",
                    "middle": [],
                    "last": "Davies",
                    "suffix": ""
                },
                {
                    "first": "N",
                    "middle": [],
                    "last": "Burns",
                    "suffix": ""
                },
                {
                    "first": "A",
                    "middle": [],
                    "last": "Christie",
                    "suffix": ""
                }
            ],
            "year": 2014,
            "venue": "J Contextual Behav Sci",
            "volume": "3",
            "issn": "3",
            "pages": "164--172",
            "other_ids": {
                "DOI": [
                    "10.1016/j.jcbs.2014.06.001"
                ]
            }
        },
        "BIBREF20": {
            "ref_id": "b20",
            "title": "The API (Agent Persona Instrument) for assessing pedagogical agent persona",
            "authors": [
                {
                    "first": "A",
                    "middle": [],
                    "last": "Baylor",
                    "suffix": ""
                },
                {
                    "first": "J",
                    "middle": [],
                    "last": "Ryu",
                    "suffix": ""
                }
            ],
            "year": 2003,
            "venue": "Proceedings of the Association for the Advancement of Computing in Education",
            "volume": "",
            "issn": "",
            "pages": "",
            "other_ids": {}
        },
        "BIBREF22": {
            "ref_id": "b22",
            "title": "The Robotic Social Attributes Scale (RoSAS): development and validation",
            "authors": [
                {
                    "first": "C",
                    "middle": [],
                    "last": "Carpinella",
                    "suffix": ""
                },
                {
                    "first": "A",
                    "middle": [],
                    "last": "Wyman",
                    "suffix": ""
                },
                {
                    "first": "M",
                    "middle": [],
                    "last": "Perez",
                    "suffix": ""
                },
                {
                    "first": "S",
                    "middle": [],
                    "last": "Stroessner",
                    "suffix": ""
                }
            ],
            "year": 2009,
            "venue": "ACM/IEEE International Conference on Human-Robot Interaction",
            "volume": "",
            "issn": "",
            "pages": "",
            "other_ids": {
                "DOI": [
                    "10.1145/2909824.3020208"
                ]
            }
        },
        "BIBREF23": {
            "ref_id": "b23",
            "title": "Acceptance and Commitment Therapy: An Experimental Approach to Behavior Change",
            "authors": [
                {
                    "first": "S",
                    "middle": [
                        "C"
                    ],
                    "last": "Hayes",
                    "suffix": ""
                },
                {
                    "first": "K",
                    "middle": [
                        "D"
                    ],
                    "last": "Strosahl",
                    "suffix": ""
                },
                {
                    "first": "K",
                    "middle": [
                        "G"
                    ],
                    "last": "Wilson",
                    "suffix": ""
                }
            ],
            "year": 1999,
            "venue": "",
            "volume": "",
            "issn": "",
            "pages": "",
            "other_ids": {}
        },
        "BIBREF24": {
            "ref_id": "b24",
            "title": "A stage model of behavioral therapies research: Getting started and moving on from stage I",
            "authors": [
                {
                    "first": "B",
                    "middle": [
                        "J"
                    ],
                    "last": "Rounsaville",
                    "suffix": ""
                },
                {
                    "first": "K",
                    "middle": [
                        "M"
                    ],
                    "last": "Carroll",
                    "suffix": ""
                },
                {
                    "first": "L",
                    "middle": [
                        "S"
                    ],
                    "last": "Onken",
                    "suffix": ""
                }
            ],
            "year": 2001,
            "venue": "Clinical Psychology: Science and Practice",
            "volume": "8",
            "issn": "2",
            "pages": "133--142",
            "other_ids": {
                "DOI": [
                    "10.1093/clipsy.8.2.133"
                ]
            }
        },
        "BIBREF25": {
            "ref_id": "b25",
            "title": "Engagement promotes abstinence in a web-based cessation intervention: cohort study",
            "authors": [
                {
                    "first": "A",
                    "middle": [],
                    "last": "Richardson",
                    "suffix": ""
                },
                {
                    "first": "A",
                    "middle": [
                        "L"
                    ],
                    "last": "Graham",
                    "suffix": ""
                },
                {
                    "first": "N",
                    "middle": [],
                    "last": "Cobb",
                    "suffix": ""
                },
                {
                    "first": "H",
                    "middle": [],
                    "last": "Xiao",
                    "suffix": ""
                },
                {
                    "first": "A",
                    "middle": [],
                    "last": "Mushro",
                    "suffix": ""
                },
                {
                    "first": "D",
                    "middle": [],
                    "last": "Abrams",
                    "suffix": ""
                }
            ],
            "year": 2013,
            "venue": "J Med Internet Res",
            "volume": "15",
            "issn": "1",
            "pages": "",
            "other_ids": {
                "DOI": [
                    "10.2196/jmir.2277"
                ]
            }
        },
        "BIBREF26": {
            "ref_id": "b26",
            "title": "Barriers to and facilitators of user engagement with digital mental health interventions: systematic review",
            "authors": [
                {
                    "first": "J",
                    "middle": [],
                    "last": "Borghouts",
                    "suffix": ""
                },
                {
                    "first": "E",
                    "middle": [],
                    "last": "Eikey",
                    "suffix": ""
                },
                {
                    "first": "G",
                    "middle": [],
                    "last": "Mark",
                    "suffix": ""
                },
                {
                    "first": "De",
                    "middle": [],
                    "last": "Leon",
                    "suffix": ""
                },
                {
                    "first": "C",
                    "middle": [],
                    "last": "Schueller",
                    "suffix": ""
                },
                {
                    "first": "S",
                    "middle": [
                        "M"
                    ],
                    "last": "Schneider",
                    "suffix": ""
                },
                {
                    "first": "M",
                    "middle": [],
                    "last": "",
                    "suffix": ""
                }
            ],
            "year": 2021,
            "venue": "J Med Internet Res",
            "volume": "23",
            "issn": "3",
            "pages": "",
            "other_ids": {
                "DOI": [
                    "10.2196/24387"
                ]
            }
        },
        "BIBREF27": {
            "ref_id": "b27",
            "title": "A prospective examination of online social network dynamics and smoking cessation",
            "authors": [
                {
                    "first": "A",
                    "middle": [
                        "L"
                    ],
                    "last": "Graham",
                    "suffix": ""
                },
                {
                    "first": "K",
                    "middle": [],
                    "last": "Zhao",
                    "suffix": ""
                },
                {
                    "first": "G",
                    "middle": [
                        "D"
                    ],
                    "last": "Papandonatos",
                    "suffix": ""
                },
                {
                    "first": "B",
                    "middle": [],
                    "last": "Erar",
                    "suffix": ""
                },
                {
                    "first": "X",
                    "middle": [],
                    "last": "Wang",
                    "suffix": ""
                },
                {
                    "first": "M",
                    "middle": [
                        "S"
                    ],
                    "last": "Amato",
                    "suffix": ""
                }
            ],
            "year": 2017,
            "venue": "PLoS One",
            "volume": "12",
            "issn": "8",
            "pages": "",
            "other_ids": {
                "DOI": [
                    "10.1371/journal.pone.0183655"
                ]
            }
        },
        "BIBREF28": {
            "ref_id": "b28",
            "title": "Connectedness based on shared engagement predicts remote biochemically verified quit status within smoking cessation treatment groups on Facebook",
            "authors": [
                {
                    "first": "M",
                    "middle": [
                        "C"
                    ],
                    "last": "Meacham",
                    "suffix": ""
                },
                {
                    "first": "O",
                    "middle": [
                        "S"
                    ],
                    "last": "Liang",
                    "suffix": ""
                },
                {
                    "first": "M",
                    "middle": [],
                    "last": "Zhao",
                    "suffix": ""
                },
                {
                    "first": "C",
                    "middle": [
                        "C"
                    ],
                    "last": "Yang",
                    "suffix": ""
                },
                {
                    "first": "J",
                    "middle": [],
                    "last": "Thrul",
                    "suffix": ""
                },
                {
                    "first": "D",
                    "middle": [
                        "E"
                    ],
                    "last": "Ramo",
                    "suffix": ""
                }
            ],
            "year": 2021,
            "venue": "Nicotine Tob Res",
            "volume": "23",
            "issn": "1",
            "pages": "71--76",
            "other_ids": {
                "DOI": [
                    "10.1093/ntr/ntz193"
                ]
            }
        },
        "BIBREF29": {
            "ref_id": "b29",
            "title": "Increasing valued behaviors precedes reduction in suffering: findings from a randomized controlled trial using ACT",
            "authors": [
                {
                    "first": "A",
                    "middle": [
                        "T"
                    ],
                    "last": "Gloster",
                    "suffix": ""
                },
                {
                    "first": "J",
                    "middle": [],
                    "last": "Klotsche",
                    "suffix": ""
                },
                {
                    "first": "J",
                    "middle": [],
                    "last": "Ciarrochi",
                    "suffix": ""
                },
                {
                    "first": "G",
                    "middle": [],
                    "last": "Eifert",
                    "suffix": ""
                },
                {
                    "first": "R",
                    "middle": [],
                    "last": "Sonntag",
                    "suffix": ""
                },
                {
                    "first": "H",
                    "middle": [
                        "U"
                    ],
                    "last": "Wittchen",
                    "suffix": ""
                }
            ],
            "year": 2017,
            "venue": "Behav Res Ther",
            "volume": "91",
            "issn": "3",
            "pages": "64--71",
            "other_ids": {
                "DOI": [
                    "10.1016/j.brat.2017.01.013"
                ]
            }
        },
        "BIBREF30": {
            "ref_id": "b30",
            "title": "Committee on the Public Health Implications of Raising the Minimum Age for Purchasing Tobacco Products, Board on Population Health and Public Health Practice, Institute of Medicine. Patterns of tobacco use by adolescents and young adults",
            "authors": [],
            "year": 2015,
            "venue": "",
            "volume": "",
            "issn": "",
            "pages": "",
            "other_ids": {}
        }
    },
    "ref_entries": {
        "FIGREF0": {
            "text": "Avatar from original, nontargeted Flexiquit.",
            "latex": null,
            "type": "figure"
        },
        "FIGREF1": {
            "text": "New sexual and gender minority-targeted Empowered, Queer, Quitting, and Living (EQQUAL) program avatar. JMIR Form Res 2021 | vol. 5 | iss. 7 | e30241 | p. 3 https://formative.jmir.org/2021/7/e30241 (page number not for citation purposes)",
            "latex": null,
            "type": "figure"
        },
        "FIGREF2": {
            "text": "\"Based on your experiences, what were the least important or least useful parts of Jen?\" (2) \"Based on your experiences, what were the most important or most useful parts of Jen?\" (3) \"What, if anything, would you change about Jen? Why?\" (4) \"What additional feedback would you like to provide us about the avatar in the program?\"",
            "latex": null,
            "type": "figure"
        },
        "FIGREF3": {
            "text": "Home page screenshot. JMIR Form Res 2021 | vol. 5 | iss. 7 | e30241 | p. 6 https://formative.jmir.org/2021/7/e30241 (page number not for citation purposes)",
            "latex": null,
            "type": "figure"
        },
        "FIGREF4": {
            "text": "Sexual and gender minority-targeted quit story.",
            "latex": null,
            "type": "figure"
        },
        "FIGREF5": {
            "text": "Interactive exercise screenshot.",
            "latex": null,
            "type": "figure"
        },
        "FIGREF6": {
            "text": "2, SD 0.8 for the emotions subscale score, mean -0.03, SD 0.9 on the physical sensations scale). On the Multidimensional Psychological Flexibility Inventory, the change in the psychological flexibility composite score from baseline to follow-up was + 0.3 (SD 0.8), and the change in the psychological inflexibility composite score was -0.3 (SD 1.2). In sum, the mean changes in the ACT-based measures of psychological flexibility were almost all in the hypothesized direction (ie, representing increased psychological flexibility and decreased inflexibility), albeit with low overall magnitude.On the Agent Persona Inventory, all subscale scores suggested positive overall impressions of the avatar: facilitating learning (mean 41.9, SD 9.8, on a scale of 10-50), credible (mean 20.7, SD 5.2, on a scale of 5-25), human-like (mean 19.7, SD 5.",
            "latex": null,
            "type": "figure"
        }
    },
    "back_matter": [
        {
            "text": "The authors wish to thank Artemis Theofanous, Masters Candidate, at the University of Cyprus, for translating the Flexiquit program into English; Claudia Rice, BA, for assisting with treatment development; and Melissa Gasser, MS, for providing input into the program design and evaluation. The project also benefitted from the design and development work completed by Cyprus-based Silversky3D Virtual Reality Ltd, as well as Seattle-based Moby Inc. We also thank AsapSCIENCE for permitting us to use their whiteboard video, called What Happens When You Stop Smoking, in the EQQUAL intervention. Finally, we wish to thank the study participants who gave feedback in both the user-centered design and clinical trial phases of the project.",
            "cite_spans": [],
            "ref_spans": [],
            "section": "Acknowledgments"
        },
        {
            "text": "JLH has received research support from Pfizer.",
            "cite_spans": [],
            "ref_spans": [],
            "section": "Conflicts of Interest"
        },
        {
            "text": "This is an open-access article distributed under the terms of the Creative Commons Attribution License (https://creativecommons.org/licenses/by/4.0/), which permits unrestricted use, distribution, and reproduction in any medium, provided the original work, first published in JMIR Formative Research, is properly cited. The complete bibliographic information, a link to the original publication on https://formative.jmir.org, as well as this copyright and license information must be included.",
            "cite_spans": [],
            "ref_spans": [],
            "section": "annex"
        }
    ]
}