{
    "paper_id": "00ec9f92371d86c94eb594a92a12cf52f3f7463e",
    "metadata": {
        "title": "Statins as anti-pyroptotic agents",
        "authors": [
            {
                "first": "Amirhossein",
                "middle": [],
                "last": "Sahebkar",
                "suffix": "",
                "affiliation": {
                    "laboratory": "",
                    "institution": "Mashhad University of Medical Sciences",
                    "location": {
                        "settlement": "Mashhad",
                        "country": "Iran"
                    }
                },
                "email": "sahebkara@mums.ac.ir"
            },
            {
                "first": "Masoomeh",
                "middle": [],
                "last": "Khalifeh",
                "suffix": "",
                "affiliation": {
                    "laboratory": "",
                    "institution": "Mashhad University of Medical Sciences",
                    "location": {
                        "settlement": "Mashhad",
                        "country": "Iran"
                    }
                },
                "email": ""
            },
            {
                "first": "Peter",
                "middle": [
                    "E"
                ],
                "last": "Penson",
                "suffix": "",
                "affiliation": {
                    "laboratory": "",
                    "institution": "Liverpool John Moores University",
                    "location": {
                        "settlement": "Liverpool",
                        "country": "UK"
                    }
                },
                "email": ""
            },
            {
                "first": "Maciej",
                "middle": [],
                "last": "Banach",
                "suffix": "",
                "affiliation": {
                    "laboratory": "",
                    "institution": "Medical University of Lodz",
                    "location": {
                        "settlement": "Lodz",
                        "country": "Poland"
                    }
                },
                "email": ""
            }
        ]
    },
    "abstract": [
        {
            "text": "Introduction: Pyroptosis is a regulated form of cell death, which is often a consequence of the activation of inflammatory caspases. Methods: Appropriate inflammatory responses and the induction of pyroptosis enhance the clearance of pathogens and increase innate immunity. Results: However, excessive pyroptosis contributes to a hyperinflammatory response and aggravates tissue damage, thereby causing inflammatory diseases. There have been recent reports on the modulation of pyroptosis by statins, which may explain part of the pleiotropic actions of these drugs in inflammatory diseases and cancer. Conclusions: Herein, the extant evidence for the potential value of statins in targeting pyroptosis in various diseases is reviewed.",
            "cite_spans": [],
            "ref_spans": [],
            "section": "Abstract"
        }
    ],
    "body_text": [
        {
            "text": "Multiple forms of cell death may occur in response to various environmental stresses, particularly oxidative stress. Loss of control of cell death (in various forms) causes many human diseases such as cancer, autoimmune diseases, neurodegeneration, and infectious diseases [1] . Classically, cell death is categorized into regulated cell death (RCD), known as apoptosis, and premature cell death, which is known as necrosis. In recent studies, a growing number of non-apoptotic modes of RCD have been discovered. These include pyroptosis, autophagy, NETosis, and ferroptosis. According to the recommendations of the Nomenclature Committee on Cell Death (NCCD) 2018, pyroptosis is a regulated form of cell death characterized by the generation of membrane pores mediated by the gasdermin (GSDM) protein family, often but not always as a consequence of the activation of inflammatory caspases [2] . It seems that pyroptosis shares morphological properties with both apoptotic and necrotic cell death. The plasma membranes of pyroptotic cells swell and rupture, and DNA fragmentation occurs (as demonstrated by positive TUNEL staining), similarly to apoptosis. However, mitochondrial integrity is preserved, and cytochrome c is not released [3] . Pyroptosis can be distinguished from apoptotic pathways of cell death by several features including the release of inflammatory cytokines such as interleukins IL-1β and IL-18. Pyroptosis can be induced by caspase-1 and caspase-4/-5 in humans, whereas classical apoptotic caspases are not involved. Despite the occurrence of nuclear fragmentation in pyroptosis, this is not as prominent as that detected in apoptosis [4] .",
            "cite_spans": [
                {
                    "start": 273,
                    "end": 276,
                    "text": "[1]",
                    "ref_id": null
                },
                {
                    "start": 891,
                    "end": 894,
                    "text": "[2]",
                    "ref_id": "BIBREF0"
                },
                {
                    "start": 1238,
                    "end": 1241,
                    "text": "[3]",
                    "ref_id": "BIBREF1"
                },
                {
                    "start": 1660,
                    "end": 1663,
                    "text": "[4]",
                    "ref_id": "BIBREF2"
                }
            ],
            "ref_spans": [],
            "section": ""
        },
        {
            "text": "Caspases are essential for initiating apoptosis and pyroptosis. Caspase-1 is one of several inflammatory caspases that play important roles in the innate immune response. There are 2 distinct pathways for pyroptosis. These are triggered by different caspases. Caspase-1 is activated by the canonical inflammasomes, and caspase-11 (human caspase-4/-5) is activated by non-canonical inflammasomes [3] . In both pathways, inflammasomes are primed and the expression of pro-IL1β and pro-IL18 levels is enhanced via activation of pattern-recognition receptors (PRR) [4] . Inflammasomes are cytoplasmic protein complexes, which form families of PRRs (such as the subfamily of NOD-like receptors (NLRs)), inflammatory caspases, and in some cases an adaptor protein. They can be activated by endogenous and exogenous stimuli acting as a molecular signal platform for enzymatic activation of caspases and the subsequent inflammatory response [2] . The subsequent mechanisms differ between the 2 pathways. In the canonical pathway, activated caspase-1 catalyses the maturation of cytokines pro-IL-1β and pro-IL-18 into their active forms, which results in pyroptosis. However, activated caspase-11 triggers pyroptosis directly in the noncanonical pathway. Activated caspase-1 is indirectly required for the production of IL-1β and IL-18 in the noncanonical pathway [4] . It has been demonstrated that cell rupture and the release of proinflammatory mediators in the extracellular space amplifies the inflammatory response and exacerbates the injury caused by initiation of the cascade. Activation of caspases occurs in response to a variety of stimuli, which are identified by distinct inflammasomes. The key factors contributing to the activation of the NLRP3 (NLR family pyrin domain containing 3) inflammasome (the most extensively studied inflammasome) include reactive oxygen species, lysosomal membrane disruption, and ion efflux (including Ca 2+ mobilization and K + efflux). In addition, microRNAs (miRNAs) have recently been shown as a key regulator of the NLRP3 inflammasome [2] .",
            "cite_spans": [
                {
                    "start": 395,
                    "end": 398,
                    "text": "[3]",
                    "ref_id": "BIBREF1"
                },
                {
                    "start": 561,
                    "end": 564,
                    "text": "[4]",
                    "ref_id": "BIBREF2"
                },
                {
                    "start": 933,
                    "end": 936,
                    "text": "[2]",
                    "ref_id": "BIBREF0"
                },
                {
                    "start": 1355,
                    "end": 1358,
                    "text": "[4]",
                    "ref_id": "BIBREF2"
                },
                {
                    "start": 2075,
                    "end": 2078,
                    "text": "[2]",
                    "ref_id": "BIBREF0"
                }
            ],
            "ref_spans": [],
            "section": ""
        },
        {
            "text": "Appropriate inflammatory responses and the induction of pyroptosis enhance the clearance of pathogens and increase innate immunity. How-ever, excessive pyroptosis contributes to a hyperinflammatory response and aggravates tissue damage, thereby causing inflammatory diseases.",
            "cite_spans": [],
            "ref_spans": [],
            "section": ""
        },
        {
            "text": "A great deal of evidence shows that some drugs or compounds that inhibit pyroptosis may be effective for the treatment of various inflammatory diseases. In this regard, it is tempting to speculate that statins could be good candidates. The efficacy of statins is well established in the prevention of cardiovascular diseases. They reduce circulating concentrations of cholesterol by inhibiting 3-hydroxy-3-methylglutaryl-CoA (HMG-CoA) reductase, the rate-limiting enzyme of the mevalonate pathway of cholesterol synthesis. In addition to their well-documented lipid-lowering effects, there is a widely held view that statins exert many pleiotropic effects including anti-inflammatory, anticoagulant, and immune-modulatory effects [5] [6] [7] [8] [9] . Moreover, many studies have demonstrated the anticarcinogenic effect of statins in several models, including carcinoma of the prostate, colon and rectum, liver, lung, breast, and skin. There is evidence that statins are associated with cell death and apoptosis [4, 10] . However, the mechanisms that mediate these effects remain poorly understood but may involve reductions of downstream products of the mevalonate pathway including dolichols, isoprenoid intermediates, heme A, and coenzyme Q10 [11] .",
            "cite_spans": [
                {
                    "start": 730,
                    "end": 733,
                    "text": "[5]",
                    "ref_id": "BIBREF3"
                },
                {
                    "start": 734,
                    "end": 737,
                    "text": "[6]",
                    "ref_id": "BIBREF4"
                },
                {
                    "start": 738,
                    "end": 741,
                    "text": "[7]",
                    "ref_id": "BIBREF5"
                },
                {
                    "start": 742,
                    "end": 745,
                    "text": "[8]",
                    "ref_id": "BIBREF6"
                },
                {
                    "start": 746,
                    "end": 749,
                    "text": "[9]",
                    "ref_id": "BIBREF7"
                },
                {
                    "start": 1013,
                    "end": 1016,
                    "text": "[4,",
                    "ref_id": "BIBREF2"
                },
                {
                    "start": 1017,
                    "end": 1020,
                    "text": "10]",
                    "ref_id": "BIBREF8"
                },
                {
                    "start": 1247,
                    "end": 1251,
                    "text": "[11]",
                    "ref_id": "BIBREF9"
                }
            ],
            "ref_spans": [],
            "section": ""
        },
        {
            "text": "Recent studies provide evidence for the potential value of statins in targeting pyroptosis in various diseases. For example, activation of the NLRP3 inflammasome and myocardial pyroptosis induced cardiac injury following coronary microembolization (CME). Chen et al. revealed an anti-pyroptotic role of rosuvastatin in CME-induced cardiac dysfunction mediated via reduction of mitochondrial damage and ROS production. Rosuvastatin exerted an inhibitory effect on the NLRP3 inflammasome pathway and suppressed the expression of cleaved-caspase-1, IL-1β, and GSDMD-N [12] . It was found that targeting of the inflammasome was a promising approach for the management of ulcerative colitis. Rosuvastatin treatment effectively reduced Ox-LDL-induced TXNIP (thioredoxin interacting protein) and thus attenuated the inflammatory response via NLRP3 inflammasome inhibition [13] . Wang et al. reported that atorvastatin inhibited pyroptosis in vascular endothelial cells (ECs) by upregulation of the long noncoding RNA (lncRNA) NEXN-AS1 and its neighbouring gene NEXN. Expression of NEXN-AS1 has been shown to be reduced in human atherosclerotic plaques. Both mRNA and protein expression levels of canonical inflammasome pathway biomarkers including caspase-1, IL-1β, IL-18, and NLRP3 were decreased by atorvastatin, which then decreased inflammation and the progression of atherosclerosis [10] . Metastasis-related lung adenocarcinoma tran- script 1 (MALAT1) is another lncRNA that has been shown to be associated with pyroptosis. Upregulation of MALAT1 evidently attenuated H 2 O 2 -induced pyroptosis in human umbilical vein endothelial cells, causing NRF2 (nuclear factor-erythroid factor 2-related factor 2) stabilization and activation. Atorvastatin was found to decrease renal oxidative stress and podocyte pyroptosis under conditions of high glucose. This occurred via the MALAT1/miR-200c/ NRF2 axis [14] . Atorvastatin has also been reported to improve early brain injury (EBI) after subarachnoid haemorrhage (SAH) by inhibition of neural pyroptosis and neuroinflammation through the ASC/AIM2 inflammatory pathway [15] . In addition to the beneficial effects of statins on cardiovascular health, their anticancer properties have recently received increasing interest. There is some evidence that using statins improved survival in patients with lung cancer whether used before or after diagnosis. It was demonstrated that simvastatin induced pyroptosis in a xenograft mouse model and in non-small cell lung cancer (NSCLC) cell lines. Thus, simvastatin treatment attenuated the viability and migration of tumour cells without causing toxicity to normal lung cells [4] . In conclusion, pharmacological activation of pyroptosis in cancer is beneficial, whereas inhibition of pyroptosis in inflammatory conditions can ameliorate disease. The most recent literature describes putative roles for statins in the regulation of pyroptosis. As shown in Figure 1 , statins can contribute to inhibition of pyroptosis via the canonical inflammasome pathway. In addition, it seems that interference with oxidative stress is the prominent mechanism of the regulation of pyroptosis by statins. These findings have important implications for the development of new treatment strategies in a range of diseases. ",
            "cite_spans": [
                {
                    "start": 565,
                    "end": 569,
                    "text": "[12]",
                    "ref_id": "BIBREF10"
                },
                {
                    "start": 865,
                    "end": 869,
                    "text": "[13]",
                    "ref_id": "BIBREF11"
                },
                {
                    "start": 872,
                    "end": 883,
                    "text": "Wang et al.",
                    "ref_id": null
                },
                {
                    "start": 1381,
                    "end": 1385,
                    "text": "[10]",
                    "ref_id": "BIBREF8"
                },
                {
                    "start": 1899,
                    "end": 1903,
                    "text": "[14]",
                    "ref_id": "BIBREF12"
                },
                {
                    "start": 2114,
                    "end": 2118,
                    "text": "[15]",
                    "ref_id": "BIBREF13"
                },
                {
                    "start": 2663,
                    "end": 2666,
                    "text": "[4]",
                    "ref_id": "BIBREF2"
                }
            ],
            "ref_spans": [
                {
                    "start": 2943,
                    "end": 2951,
                    "text": "Figure 1",
                    "ref_id": "FIGREF0"
                }
            ],
            "section": ""
        }
    ],
    "bib_entries": {
        "BIBREF0": {
            "ref_id": "b0",
            "title": "Pyroptosis: a pro-inflammatory type of cell death in cardiovascular disease",
            "authors": [
                {
                    "first": "Q",
                    "middle": [],
                    "last": "Wang",
                    "suffix": ""
                },
                {
                    "first": "J",
                    "middle": [],
                    "last": "Wu",
                    "suffix": ""
                },
                {
                    "first": "Y",
                    "middle": [],
                    "last": "Zeng",
                    "suffix": ""
                }
            ],
            "year": 2020,
            "venue": "Clin Chim Acta",
            "volume": "510",
            "issn": "",
            "pages": "62--72",
            "other_ids": {}
        },
        "BIBREF1": {
            "ref_id": "b1",
            "title": "Pyroptosis and its relationship to atherosclerosis",
            "authors": [
                {
                    "first": "Y",
                    "middle": [
                        "J"
                    ],
                    "last": "Xu",
                    "suffix": ""
                },
                {
                    "first": "L",
                    "middle": [],
                    "last": "Zheng",
                    "suffix": ""
                },
                {
                    "first": "Y",
                    "middle": [
                        "W"
                    ],
                    "last": "Hu",
                    "suffix": ""
                },
                {
                    "first": "Q",
                    "middle": [],
                    "last": "Wang",
                    "suffix": ""
                }
            ],
            "year": 2018,
            "venue": "Clin Chim Acta",
            "volume": "476",
            "issn": "",
            "pages": "28--37",
            "other_ids": {}
        },
        "BIBREF2": {
            "ref_id": "b2",
            "title": "Simvastatin suppresses proliferation and migration in non-small cell lung cancer via pyroptosis",
            "authors": [
                {
                    "first": "F",
                    "middle": [],
                    "last": "Wang",
                    "suffix": ""
                },
                {
                    "first": "W",
                    "middle": [],
                    "last": "Liu",
                    "suffix": ""
                },
                {
                    "first": "J",
                    "middle": [],
                    "last": "Ning",
                    "suffix": ""
                }
            ],
            "year": 2018,
            "venue": "Int J Biol Sci",
            "volume": "14",
            "issn": "",
            "pages": "406--423",
            "other_ids": {}
        },
        "BIBREF3": {
            "ref_id": "b3",
            "title": "Pleiotropic effects of statins: untapped potential for statin pharmacotherapy",
            "authors": [
                {
                    "first": "S",
                    "middle": [],
                    "last": "Mohammad",
                    "suffix": ""
                },
                {
                    "first": "H",
                    "middle": [],
                    "last": "Nguyen",
                    "suffix": ""
                },
                {
                    "first": "M",
                    "middle": [],
                    "last": "Nguyen",
                    "suffix": ""
                }
            ],
            "year": 2019,
            "venue": "Curr Vasc Pharmacol",
            "volume": "17",
            "issn": "",
            "pages": "239--61",
            "other_ids": {}
        },
        "BIBREF4": {
            "ref_id": "b4",
            "title": "Effect of statins on toll-like receptors: a new insight to pleiotropic effects",
            "authors": [
                {
                    "first": "A",
                    "middle": [],
                    "last": "Bahrami",
                    "suffix": ""
                },
                {
                    "first": "N",
                    "middle": [],
                    "last": "Parsamanesh",
                    "suffix": ""
                },
                {
                    "first": "S",
                    "middle": [
                        "L"
                    ],
                    "last": "Atkin",
                    "suffix": ""
                },
                {
                    "first": "M",
                    "middle": [],
                    "last": "Banach",
                    "suffix": ""
                },
                {
                    "first": "A",
                    "middle": [],
                    "last": "Sahebkar",
                    "suffix": ""
                }
            ],
            "year": 2018,
            "venue": "Pharmacol Res",
            "volume": "135",
            "issn": "",
            "pages": "230--238",
            "other_ids": {}
        },
        "BIBREF5": {
            "ref_id": "b5",
            "title": "Effect of statin therapy on paraoxonase-1 status: a systematic review and meta-analysis of 25 clinical trials",
            "authors": [
                {
                    "first": "G",
                    "middle": [],
                    "last": "Ferretti",
                    "suffix": ""
                },
                {
                    "first": "T",
                    "middle": [],
                    "last": "Bacchetti",
                    "suffix": ""
                },
                {
                    "first": "A",
                    "middle": [],
                    "last": "Sahebkar",
                    "suffix": ""
                }
            ],
            "year": 2015,
            "venue": "Progress Lipid Res",
            "volume": "60",
            "issn": "",
            "pages": "50--73",
            "other_ids": {}
        },
        "BIBREF6": {
            "ref_id": "b6",
            "title": "Statins and the Covid-19 main protease: in silico evidence on direct interaction",
            "authors": [
                {
                    "first": "Ž",
                    "middle": [],
                    "last": "Reiner",
                    "suffix": ""
                },
                {
                    "first": "M",
                    "middle": [],
                    "last": "Hatamipour",
                    "suffix": ""
                },
                {
                    "first": "M",
                    "middle": [],
                    "last": "Banach",
                    "suffix": ""
                }
            ],
            "year": 2020,
            "venue": "Arch Med Sci",
            "volume": "16",
            "issn": "",
            "pages": "490--496",
            "other_ids": {}
        },
        "BIBREF7": {
            "ref_id": "b7",
            "title": "The impact of statin therapy on plasma levels of von Willebrand factor antigen: systematic review and meta-analysis of Randomised placebo-controlled trials",
            "authors": [
                {
                    "first": "A",
                    "middle": [],
                    "last": "Sahebkar",
                    "suffix": ""
                },
                {
                    "first": "C",
                    "middle": [],
                    "last": "Serban",
                    "suffix": ""
                },
                {
                    "first": "S",
                    "middle": [],
                    "last": "Ursoniu",
                    "suffix": ""
                }
            ],
            "year": 2016,
            "venue": "Thromb Haemostasis",
            "volume": "115",
            "issn": "",
            "pages": "520--552",
            "other_ids": {}
        },
        "BIBREF8": {
            "ref_id": "b8",
            "title": "Atorvastatin inhibits pyroptosis through the lncRNA NEXN-AS1/NEXN pathway in human vascular endothelial cells",
            "authors": [
                {
                    "first": "L",
                    "middle": [
                        "M"
                    ],
                    "last": "Wu",
                    "suffix": ""
                },
                {
                    "first": "S",
                    "middle": [
                        "G"
                    ],
                    "last": "Wu",
                    "suffix": ""
                },
                {
                    "first": "F",
                    "middle": [],
                    "last": "Chen",
                    "suffix": ""
                }
            ],
            "year": 2020,
            "venue": "Atherosclerosis",
            "volume": "293",
            "issn": "",
            "pages": "26--34",
            "other_ids": {}
        },
        "BIBREF9": {
            "ref_id": "b9",
            "title": "Statin-related myotoxicity: a comprehensive review of pharmacokinetic, pharmacogenomic and muscle components",
            "authors": [
                {
                    "first": "R",
                    "middle": [
                        "M"
                    ],
                    "last": "Turner",
                    "suffix": ""
                },
                {
                    "first": "M",
                    "middle": [],
                    "last": "Pirmohamed",
                    "suffix": ""
                }
            ],
            "year": 2020,
            "venue": "J Clin Med",
            "volume": "9",
            "issn": "",
            "pages": "",
            "other_ids": {}
        },
        "BIBREF10": {
            "ref_id": "b10",
            "title": "Rosuvastatin protects against coronary microembolization-induced cardiac injury via inhibiting NLRP3 inflammasome activation",
            "authors": [
                {
                    "first": "A",
                    "middle": [],
                    "last": "Chen",
                    "suffix": ""
                },
                {
                    "first": "Z",
                    "middle": [],
                    "last": "Chen",
                    "suffix": ""
                },
                {
                    "first": "Y",
                    "middle": [],
                    "last": "Zhou",
                    "suffix": ""
                }
            ],
            "year": 2021,
            "venue": "Cell Death Dis",
            "volume": "12",
            "issn": "",
            "pages": "",
            "other_ids": {}
        },
        "BIBREF11": {
            "ref_id": "b11",
            "title": "A novel combination therapy using rosuvastatin and lactobacillus combats dextran sodium sulfate-induced colitis in highfat diet-fed rats by targeting the TXNIP/NLRP3 interaction and influencing gut microbiome composition",
            "authors": [
                {
                    "first": "S",
                    "middle": [],
                    "last": "Saber",
                    "suffix": ""
                },
                {
                    "first": "Abd",
                    "middle": [],
                    "last": "El-Fattah",
                    "suffix": ""
                },
                {
                    "first": "E",
                    "middle": [
                        "E"
                    ],
                    "last": "Yahya",
                    "suffix": ""
                },
                {
                    "first": "G",
                    "middle": [],
                    "last": "",
                    "suffix": ""
                }
            ],
            "year": 2021,
            "venue": "Pharmaceuticals",
            "volume": "14",
            "issn": "",
            "pages": "",
            "other_ids": {}
        },
        "BIBREF12": {
            "ref_id": "b12",
            "title": "Atorvastatin regulates malat1/ mir-200c/nrf2 activity to protect against podocyte pyroptosis induced by high glucose",
            "authors": [
                {
                    "first": "Y",
                    "middle": [],
                    "last": "Zuo",
                    "suffix": ""
                },
                {
                    "first": "L",
                    "middle": [],
                    "last": "Chen",
                    "suffix": ""
                },
                {
                    "first": "X",
                    "middle": [],
                    "last": "He",
                    "suffix": ""
                }
            ],
            "year": 2021,
            "venue": "Diabetes Metab Syndr Obes",
            "volume": "14",
            "issn": "",
            "pages": "1631--1676",
            "other_ids": {}
        },
        "BIBREF13": {
            "ref_id": "b13",
            "title": "Atorvastatin ameliorates early brain injury after subarachnoid hemorrhage via inhibition of pyroptosis and neuroinflammation",
            "authors": [
                {
                    "first": "J",
                    "middle": [],
                    "last": "Chen",
                    "suffix": ""
                },
                {
                    "first": "C",
                    "middle": [],
                    "last": "Zhang",
                    "suffix": ""
                },
                {
                    "first": "T",
                    "middle": [],
                    "last": "Yan",
                    "suffix": ""
                }
            ],
            "year": 2021,
            "venue": "J Cell Physiol",
            "volume": "",
            "issn": "",
            "pages": "",
            "other_ids": {
                "DOI": [
                    "10.1002/jcp.30351"
                ]
            }
        }
    },
    "ref_entries": {
        "FIGREF0": {
            "text": "Molecular mechanism underpinning therapeutic regulation of pyroptosis by statins NLRP3 -NLR family pyrin domain containing 3, ASC -apoptosis-associated speck-like protein containing a caspase recruitment domain, AIM2 -absent in melanoma 2, TXNIP -thioredoxin interacting protein, NRF2 -nuclear factor-erythroid factor 2-related factor 2, NEXN -nexilin F-actin binding protein, IL-1β -interleukin-1β, IL-18 -interleukin-18.",
            "latex": null,
            "type": "figure"
        },
        "TABREF0": {
            "text": "Peter E. Penson owns 4 shares in AstraZeneca PLC and has received honoraria and/or travel reimbursement for events sponsored by AKCEA, Amgen, AMRYT, Link Medical, Mylan, Napp, Sanofi; G.B. Maciej Banach: speakers bureau: Amgen, Herbapol, Kogen, KRKA, Polpharma, Mylan/ Viatris, Novartis, Novo-Nordisk, Sanofi-Aventis, Teva, Zentiva; consultant to Abbott Vascular, Amgen, Daichii Sankyo, Esperion, FreiaPharmaceuticals, Novartis, Polfarmex, Sanofi-Aventis; Grants from Amgen, Mylan/Viatris, Sanofi, and Valeant; all other authors have no conflict of interest. R e f e r e n c e s 1. Tang D, Kang R, Berghe TV, Vandenabeele P, Kroemer G. The molecular machinery of regulated cell death. Cell Res 2019; 29: 347-64.",
            "latex": null,
            "type": "table"
        }
    },
    "back_matter": []
}