{
    "paper_id": "00f48faf056f8a63662af1629cb882a38ed3795e",
    "metadata": {
        "title": "Quantifier Number of object types shown",
        "authors": [
            {
                "first": "Maria",
                "middle": [],
                "last": "Spychalska",
                "suffix": "",
                "affiliation": {},
                "email": ""
            },
            {
                "first": "Ludmila",
                "middle": [],
                "last": "Reimer",
                "suffix": "",
                "affiliation": {},
                "email": ""
            },
            {
                "first": "Petra",
                "middle": [
                    "B"
                ],
                "last": "Schumacher",
                "suffix": "",
                "affiliation": {},
                "email": ""
            },
            {
                "first": "Markus",
                "middle": [],
                "last": "Werning",
                "suffix": "",
                "affiliation": {},
                "email": ""
            }
        ]
    },
    "abstract": [],
    "body_text": [
        {
            "text": "game 1 Löffel  spoons  13  Kugeln  balls  12  Tische  tables  12  Löwen  lions  10  Kleider  dresses  12  Pfannen  pans  15  Sägen  saws  15  Kreuze  crosses  13  Nägel  nails  13  Ketten  chains  13  Tiger  tigers  11  Rosen  roses  12  Tüten  bags  13  Spinnen  spiders  13  Schwerter  swords  13  Kirschen  cherries  14  Räder  bikes  11  Kronen  crowns  11  Pferde  horses  11  Röcke  skirts  14  Käse  loaves of cheese  11  Augen  eyes  8  Schuhe  shoes  10  Herzen  hearts  9  Wolken  clouds  11  Reifen  tires  11  Pfeile  arrows  14  Kreuze  crosses  13  Zebras  zebras  14  Esel  donkeys  12  Zwiebeln  onions  13  Federn  feathers  12  Anker  anchors  13  Würfel  dice  13  Schlangen  snakes  12  Kämme  combs  17  Pflaumen  plums  15  Teddys  teddy Igel  hedgehogs  13  Gänse  geese  14  Hosen  pants  12  Kreisel  spinning tops  12  Blätter  leaves  11  Fäden  threads  12  Sterne  stars  12  Wolken  clouds  11  Babys  babies  11  Tüten  bags  13  Beine   legs  10  Teller  dishes  11  Netze  nets  12  Helme  helmets  14  Sonnen  suns  15  Blusen  blouses  15  Kreuze  crosses  13  Schafe  sheep  12  Leitern  ladders  14  Töpfe  pots  14  Schränke  cupboards  14  Zirkel  compasses  14  Ketten  chains  13  Bögen  bows  14  Helme  helmets  14  Katzen  cats  11  Jacken  jackets  13  Nasen  noses  14  Pizzen  pizzas  15  Tische  tables  12  Ziegel  bricks  14  Schaufeln  shovels  14  Pfannen  pans  15  Kiwis  kiwis  15  Pflaumen  plums  15  Nägel  nails  13  Würste  sausages  14  Gläser  glasses  12  Rosen  roses  12  Bögen  bows  14  Tannen  christmas Teppiche  rugs  Schneemänner  snowmen  Fotos  photos  blank  Trichter  funnels  Teppiche  rugs  Laptops  laptops  blank  Ballons  balloons  Trichter  funnels  Kakteen  cacti  blank  Trompeten  trumpets  Ballons  balloons  Handtücher  towels  blank  Tastaturen  keyboards  Trompeten  trumpets  Kutschen  carriages  blank  Ameisen  ants  Tastaturen  keyboards  Gitarren  guitars  blank  Steine  rocks  Ameisen  ants  Rechen  rakes  blank  Locher  hole punches  Locher  hole punches  blank  blank  Pullover  pullover  Pullover  pullover  blank  blank  Drucker  printers  Drucker  printers  blank  blank  Mikrofone  microphones  Mikrofone  microphones  blank  blank  Strohhalme  straws  Strohhalme  straws  blank  blank  Klaviere  pianos  Klaviere  pianos  blank  blank  Vorhänge  curtains  Tomaten  tomatoes  blank  blank  Rucksäcke  backpacks  Vorhänge  curtains  blank  blank  Laternen  lanterns  Rucksäcke  backpacks  blank  blank  Orangen  oranges  Laternen  lanterns  blank  blank  Helikopter  helicopters  Orangen  oranges  blank  blank  Elefanten  elephants  Helikopter  helicopters  blank  blank  Pinguine  penguins  Elefanten  elephants  blank  blank  Raketen  rockets  Pinguine  penguins  blank  blank  Krawatten  ties  Raketen  rockets  blank  blank  Tomaten  tomatoes  Krawatten  ties  blank  blank  Krokodile  crocodiles  Krokodile  crocodiles  Rasenmäher  lawn mowers  Schildkröten  turtles  Bananen  bananas  Bananen  bananas  Särge  coffins  Tacker  staplers  Delphine  dolphins  Delphine  dolphins  Gespenster  ghosts  Lupen  rulers  Regale  shelves  Regale  shelves  Flugzeuge  planes  Lineale  lanterns  Pakete  parcels  Pakete  parcels  Schlafsäcke  sleeping bags  Hufeisen  horseshoes  Wippen  seesaws  Wippen  seesaws  Computer  computers  Schlösser  castles  Traktoren  tractors  Traktoren  tractors  Burgen  castles  Kräne  cranes  Schmetterlinge  butterflies  Schmetterlinge  butterflies  Waschmaschinen  washing Table 6 : Experiment 1: The mean accuracy (with standard deviation) per filler category (known vs. unknown truth-value) and per group. For the sake of ease of exposition, the logical responses are throughout counted as \"accurate\" for some and for bare numerals (based on the at least reading). For the quantifier some the filler trials are further divided into those whose truth-value is known and unambiguous (i.e. not dependent on the reading), unknown and unambiguous, known but ambiguous (i.e. cases where the speaker has a full access but the stronger alternative is true; here \"inaccurate\" response indicates a weak pragmatic interpretation), unknown and ambiguous (the speaker has a partial access and the stronger alternative is true in the visible cards; here \"inaccurate\" response indicates a strong pragmatic interpretation). Im Anschluss an eine Spielrunde erscheinen die Wörter 'JA' und 'NEIN' jeweils rechts und links, allerdings auf wechselnden Seiten. Sie zeigen dir an, auf welche Taste du drücken sollst, um zu antworten.",
            "cite_spans": [],
            "ref_spans": [
                {
                    "start": 7,
                    "end": 759,
                    "text": "Löffel  spoons  13  Kugeln  balls  12  Tische  tables  12  Löwen  lions  10  Kleider  dresses  12  Pfannen  pans  15  Sägen  saws  15  Kreuze  crosses  13  Nägel  nails  13  Ketten  chains  13  Tiger  tigers  11  Rosen  roses  12  Tüten  bags  13  Spinnen  spiders  13  Schwerter  swords  13  Kirschen  cherries  14  Räder  bikes  11  Kronen  crowns  11  Pferde  horses  11  Röcke  skirts  14  Käse  loaves of cheese  11  Augen  eyes  8  Schuhe  shoes  10  Herzen  hearts  9  Wolken  clouds  11  Reifen  tires  11  Pfeile  arrows  14  Kreuze  crosses  13  Zebras  zebras  14  Esel  donkeys  12  Zwiebeln  onions  13  Federn  feathers  12  Anker  anchors  13  Würfel  dice  13  Schlangen  snakes  12  Kämme  combs  17  Pflaumen  plums  15  Teddys  teddy",
                    "ref_id": "TABREF2"
                },
                {
                    "start": 760,
                    "end": 1571,
                    "text": "Igel  hedgehogs  13  Gänse  geese  14  Hosen  pants  12  Kreisel  spinning tops  12  Blätter  leaves  11  Fäden  threads  12  Sterne  stars  12  Wolken  clouds  11  Babys  babies  11  Tüten  bags  13  Beine   legs  10  Teller  dishes  11  Netze  nets  12  Helme  helmets  14  Sonnen  suns  15  Blusen  blouses  15  Kreuze  crosses  13  Schafe  sheep  12  Leitern  ladders  14  Töpfe  pots  14  Schränke  cupboards  14  Zirkel  compasses  14  Ketten  chains  13  Bögen  bows  14  Helme  helmets  14  Katzen  cats  11  Jacken  jackets  13  Nasen  noses  14  Pizzen  pizzas  15  Tische  tables  12  Ziegel  bricks  14  Schaufeln  shovels  14  Pfannen  pans  15  Kiwis  kiwis  15  Pflaumen  plums  15  Nägel  nails  13  Würste  sausages  14  Gläser  glasses  12  Rosen  roses  12  Bögen  bows  14  Tannen  christmas",
                    "ref_id": "TABREF2"
                },
                {
                    "start": 1572,
                    "end": 3506,
                    "text": "Teppiche  rugs  Schneemänner  snowmen  Fotos  photos  blank  Trichter  funnels  Teppiche  rugs  Laptops  laptops  blank  Ballons  balloons  Trichter  funnels  Kakteen  cacti  blank  Trompeten  trumpets  Ballons  balloons  Handtücher  towels  blank  Tastaturen  keyboards  Trompeten  trumpets  Kutschen  carriages  blank  Ameisen  ants  Tastaturen  keyboards  Gitarren  guitars  blank  Steine  rocks  Ameisen  ants  Rechen  rakes  blank  Locher  hole punches  Locher  hole punches  blank  blank  Pullover  pullover  Pullover  pullover  blank  blank  Drucker  printers  Drucker  printers  blank  blank  Mikrofone  microphones  Mikrofone  microphones  blank  blank  Strohhalme  straws  Strohhalme  straws  blank  blank  Klaviere  pianos  Klaviere  pianos  blank  blank  Vorhänge  curtains  Tomaten  tomatoes  blank  blank  Rucksäcke  backpacks  Vorhänge  curtains  blank  blank  Laternen  lanterns  Rucksäcke  backpacks  blank  blank  Orangen  oranges  Laternen  lanterns  blank  blank  Helikopter  helicopters  Orangen  oranges  blank  blank  Elefanten  elephants  Helikopter  helicopters  blank  blank  Pinguine  penguins  Elefanten  elephants  blank  blank  Raketen  rockets  Pinguine  penguins  blank  blank  Krawatten  ties  Raketen  rockets  blank  blank  Tomaten  tomatoes  Krawatten  ties  blank  blank  Krokodile  crocodiles  Krokodile  crocodiles  Rasenmäher  lawn mowers  Schildkröten  turtles  Bananen  bananas  Bananen  bananas  Särge  coffins  Tacker  staplers  Delphine  dolphins  Delphine  dolphins  Gespenster  ghosts  Lupen  rulers  Regale  shelves  Regale  shelves  Flugzeuge  planes  Lineale  lanterns  Pakete  parcels  Pakete  parcels  Schlafsäcke  sleeping bags  Hufeisen  horseshoes  Wippen  seesaws  Wippen  seesaws  Computer  computers  Schlösser  castles  Traktoren  tractors  Traktoren  tractors  Burgen  castles  Kräne  cranes  Schmetterlinge  butterflies  Schmetterlinge  butterflies  Waschmaschinen  washing",
                    "ref_id": null
                },
                {
                    "start": 3507,
                    "end": 3514,
                    "text": "Table 6",
                    "ref_id": null
                }
            ],
            "section": ""
        },
        {
            "text": "Deine Aufgabe ist es zu bewerten, welche der Aussagen angemessen und welche unangemessen sind.",
            "cite_spans": [],
            "ref_spans": [],
            "section": ""
        },
        {
            "text": "Wenn du keine Fragen hast, kannst du mit einem Tastendruck fortfahren.",
            "cite_spans": [],
            "ref_spans": [],
            "section": ""
        },
        {
            "text": "Du spielst deine Runden mit Lena.",
            "cite_spans": [],
            "ref_spans": [],
            "section": "Main Instruction -Screen 2"
        },
        {
            "text": "Zunächst gibt es eine kurzeÜbung, um dich an die Aufgabe zu gewöhnen. Drücke bitte eine Taste, sobald du bereit bist.",
            "cite_spans": [],
            "ref_spans": [],
            "section": "Main Instruction -Screen 3"
        },
        {
            "text": "Du hast richtig geantwortet.",
            "cite_spans": [],
            "ref_spans": [],
            "section": "Feedback Response For Correct Responses"
        },
        {
            "text": "Du hast nicht richtig geantwortet.",
            "cite_spans": [],
            "ref_spans": [],
            "section": "Feedback Response For False Responses"
        },
        {
            "text": "Bitte beantworte die nächste Frage! 2 Translated Instructions",
            "cite_spans": [],
            "ref_spans": [],
            "section": "Feedback Response For Missed Responses"
        },
        {
            "text": "In this experiment we text your understanding of spoken sentences and your attention while observing pictures.",
            "cite_spans": [],
            "ref_spans": [],
            "section": "Main Instruction -Screen 1"
        },
        {
            "text": "In every round, you will see a game scenario, within which you and another player will be able to see cards on a table and outside of the table.",
            "cite_spans": [],
            "ref_spans": [],
            "section": "Main Instruction -Screen 1"
        },
        {
            "text": "All cards seen, the ones on the table as well the ones outside of it, are part of the game. The cards on the table are always dealt with their face side up, the cards outside the table can be dealt with their face side up or with their backside up. The pictures on the cards with their backside up are unknown to both of you.",
            "cite_spans": [],
            "ref_spans": [],
            "section": "Main Instruction -Screen 1"
        },
        {
            "text": "Every card shows a maximum of two objects. The cards in every round show up to three different types of pictures. Please keep in mind, that it is possible for cards to be blank.",
            "cite_spans": [],
            "ref_spans": [],
            "section": "Main Instruction -Screen 1"
        },
        {
            "text": "Every round is accompanied by a spoken sentence of your co-player that was recorded during a previous experiment. There are statements that are describing the situation appropriately and statements that are inappropriate. In the case of inappropriate statements your co-player might have made a mistake, but sometimes he or she deliberately chose an inappropriate statement.",
            "cite_spans": [],
            "ref_spans": [],
            "section": "Main Instruction -Screen 1"
        },
        {
            "text": "After every round, you will see the words 'YES' and 'NO' on the right and left side and their location will be assigned randomly after each round. They indicate the button you need to press to give your answer.",
            "cite_spans": [],
            "ref_spans": [],
            "section": "Main Instruction -Screen 1"
        },
        {
            "text": "Now press the corresponding button to answer the question if your co-player described the scenario in an appropriate manner.",
            "cite_spans": [],
            "ref_spans": [],
            "section": "Main Instruction -Screen 1"
        },
        {
            "text": "If you have no further questions, you may proceed by pressing a button.",
            "cite_spans": [],
            "ref_spans": [],
            "section": "Main Instruction -Screen 1"
        },
        {
            "text": "You are playing your rounds with Lena.",
            "cite_spans": [],
            "ref_spans": [],
            "section": "Main Instruction -Screen 2"
        },
        {
            "text": "First, there will be a short exercise to get you used to the task. Please press a button if you are ready.",
            "cite_spans": [],
            "ref_spans": [],
            "section": "Main Instruction -Screen 3"
        },
        {
            "text": "Your answer is correct.",
            "cite_spans": [],
            "ref_spans": [],
            "section": "Feedback Response For Correct Responses"
        },
        {
            "text": "Your answer is not correct.",
            "cite_spans": [],
            "ref_spans": [],
            "section": "Feedback Response For False Responses"
        },
        {
            "text": "Please give an answer to the next question!",
            "cite_spans": [],
            "ref_spans": [],
            "section": "Feedback Response For Missed Responses"
        }
    ],
    "bib_entries": {
        "BIBREF0": {
            "ref_id": "b0",
            "title": "Alle Karten auf dem Tisch enthalten Kästchen",
            "authors": [],
            "year": null,
            "venue": "",
            "volume": "",
            "issn": "",
            "pages": "",
            "other_ids": {}
        },
        "BIBREF1": {
            "ref_id": "b1",
            "title": "Du hast richtig geantwortet. / Du hast nicht richtig geantwortet. / Bitte beantworte die nächste Frage!",
            "authors": [],
            "year": null,
            "venue": "",
            "volume": "",
            "issn": "",
            "pages": "",
            "other_ids": {}
        },
        "BIBREF2": {
            "ref_id": "b2",
            "title": "Alle Karten auf dem Tisch, die von Lena gesehen werden können, enthalten Kästchen",
            "authors": [],
            "year": null,
            "venue": "",
            "volume": "",
            "issn": "",
            "pages": "",
            "other_ids": {}
        },
        "BIBREF3": {
            "ref_id": "b3",
            "title": "Alle Karten im Spiel enthalten Marienkäfer",
            "authors": [],
            "year": null,
            "venue": "",
            "volume": "",
            "issn": "",
            "pages": "",
            "other_ids": {}
        },
        "BIBREF4": {
            "ref_id": "b4",
            "title": "/ Bitte beantworte die nächste Frage! Lena kann nicht wissen, ob alle Karten im Spiel Marienkäfer enthalten, weil die zwei zusätzlichen Karten neben dem Tisch verdeckt sind. Damit ist es für Lena nicht angemessen, diesen Satz zuäußern, denn eine Aussage kann nur dann angemessen sein, wenn man weiß",
            "authors": [],
            "year": null,
            "venue": "Du hast richtig geantwortet. / Du hast nicht richtig geantwortet",
            "volume": "",
            "issn": "",
            "pages": "",
            "other_ids": {}
        },
        "BIBREF5": {
            "ref_id": "b5",
            "title": "Keine Karten im Spiel enthalten Roller",
            "authors": [],
            "year": null,
            "venue": "",
            "volume": "",
            "issn": "",
            "pages": "",
            "other_ids": {}
        },
        "BIBREF6": {
            "ref_id": "b6",
            "title": "/ Bitte beantworte die nächste Frage! Es ist nicht wahr, dass keine Karte im Spiel Roller enthält. Lena kann sehen, dass auf mindestens einer Karte ein Roller ist. Damit ist es für Lena nicht angemessen, diesen Satz zuäußern",
            "authors": [],
            "year": null,
            "venue": "Du hast richtig geantwortet. / Du hast nicht richtig geantwortet",
            "volume": "",
            "issn": "",
            "pages": "",
            "other_ids": {}
        },
        "BIBREF7": {
            "ref_id": "b7",
            "title": "Weniger als zwei Karten im Spiel enthalten Ratten",
            "authors": [],
            "year": null,
            "venue": "",
            "volume": "",
            "issn": "",
            "pages": "",
            "other_ids": {}
        },
        "BIBREF8": {
            "ref_id": "b8",
            "title": "/ Bitte beantworte die nächste Frage! Lena kann sehen, dass mindestens eine Karte im Spiel eine Ratte enthält, aber sie kann nicht sehen, ob es auf den verdeckten Karten mehr Ratten gibt. Also kann sie nicht wissen, ob weniger als zwei Karten im Spiel Ratten enthalten",
            "authors": [],
            "year": null,
            "venue": "Du hast richtig geantwortet. / Du hast nicht richtig geantwortet",
            "volume": "",
            "issn": "",
            "pages": "",
            "other_ids": {}
        },
        "BIBREF9": {
            "ref_id": "b9",
            "title": "Die nächstenÜbungen werden keine Erklärungen mehr enthalten. Tauchen während derÜbung Unklarheiten auf, kannst du vor dem Hauptexperiment die Versuchsleitung fragen. Wenn dir das klar ist",
            "authors": [],
            "year": null,
            "venue": "",
            "volume": "",
            "issn": "",
            "pages": "",
            "other_ids": {}
        },
        "BIBREF10": {
            "ref_id": "b10",
            "title": "Mehr als zwei Karten auf dem Tisch enthalten Teiche",
            "authors": [],
            "year": null,
            "venue": "",
            "volume": "",
            "issn": "",
            "pages": "",
            "other_ids": {}
        },
        "BIBREF11": {
            "ref_id": "b11",
            "title": "Du hast richtig geantwortet. / Du hast nicht richtig geantwortet. / Bitte beantworte die nächste Frage!",
            "authors": [],
            "year": null,
            "venue": "",
            "volume": "",
            "issn": "",
            "pages": "",
            "other_ids": {}
        },
        "BIBREF12": {
            "ref_id": "b12",
            "title": "Keine Karten auf dem Tisch enthalten Kürbisse",
            "authors": [],
            "year": null,
            "venue": "",
            "volume": "",
            "issn": "",
            "pages": "",
            "other_ids": {}
        },
        "BIBREF13": {
            "ref_id": "b13",
            "title": "Du hast richtig geantwortet. / Du hast nicht richtig geantwortet. / Bitte beantworte die nächste Frage!",
            "authors": [],
            "year": null,
            "venue": "",
            "volume": "",
            "issn": "",
            "pages": "",
            "other_ids": {}
        },
        "BIBREF14": {
            "ref_id": "b14",
            "title": "Mehr als drei Karten im Spiel enthalten Teiche",
            "authors": [],
            "year": null,
            "venue": "",
            "volume": "",
            "issn": "",
            "pages": "",
            "other_ids": {}
        },
        "BIBREF15": {
            "ref_id": "b15",
            "title": "Du hast richtig geantwortet. / Du hast nicht richtig geantwortet. / Bitte beantworte die nächste Frage!",
            "authors": [],
            "year": null,
            "venue": "",
            "volume": "",
            "issn": "",
            "pages": "",
            "other_ids": {}
        },
        "BIBREF16": {
            "ref_id": "b16",
            "title": "Weniger als drei Karten auf dem Tisch enthalten Marienkäfer",
            "authors": [],
            "year": null,
            "venue": "",
            "volume": "",
            "issn": "",
            "pages": "",
            "other_ids": {}
        },
        "BIBREF17": {
            "ref_id": "b17",
            "title": "Du hast richtig geantwortet. / Du hast nicht richtig geantwortet. / Bitte beantworte die nächste Frage!",
            "authors": [],
            "year": null,
            "venue": "",
            "volume": "",
            "issn": "",
            "pages": "",
            "other_ids": {}
        },
        "BIBREF18": {
            "ref_id": "b18",
            "title": "Wenn du keine weiteren Fragen hast, geht das Hauptexperiment mit einem Tastendruck los",
            "authors": [
                {
                    "first": "Dieübung",
                    "middle": [],
                    "last": "Das War",
                    "suffix": ""
                }
            ],
            "year": null,
            "venue": "Bitte beachte, dass du während des Experimentes kein Feedback bekommen wirst",
            "volume": "",
            "issn": "",
            "pages": "",
            "other_ids": {}
        },
        "BIBREF20": {
            "ref_id": "b20",
            "title": "All cards on the table contain boxes",
            "authors": [],
            "year": null,
            "venue": "",
            "volume": "",
            "issn": "",
            "pages": "",
            "other_ids": {}
        },
        "BIBREF21": {
            "ref_id": "b21",
            "title": "Please give an answer to the next question! All cards on the table can be seen by Lena and contain boxes. Thus it is appropriate for Lena to utter this sentence",
            "authors": [],
            "year": null,
            "venue": "",
            "volume": "",
            "issn": "",
            "pages": "",
            "other_ids": {}
        },
        "BIBREF22": {
            "ref_id": "b22",
            "title": "All cards in the game contain ladybugs",
            "authors": [],
            "year": null,
            "venue": "",
            "volume": "",
            "issn": "",
            "pages": "",
            "other_ids": {}
        },
        "BIBREF23": {
            "ref_id": "b23",
            "title": "Please give an answer to the next question! Lena cannot know whether all cards in the game contain ladybugs or not because the two additional cards next to the table are turned over. Thus, it is not appropriate for Lena to utter this sentence, since a statement can only be appropriate if one knows that it is true",
            "authors": [],
            "year": null,
            "venue": "",
            "volume": "",
            "issn": "",
            "pages": "",
            "other_ids": {}
        },
        "BIBREF24": {
            "ref_id": "b24",
            "title": "No cards in the game contain scooters",
            "authors": [],
            "year": null,
            "venue": "",
            "volume": "",
            "issn": "",
            "pages": "",
            "other_ids": {}
        },
        "BIBREF25": {
            "ref_id": "b25",
            "title": "Please give an answer to the next question! It is not true that no card in the game contains a scooter. Lena can see that at least one card contains a scooter. Thus, it is not appropriate for Lena to utter this sentence because the sentence is false",
            "authors": [],
            "year": null,
            "venue": "",
            "volume": "",
            "issn": "",
            "pages": "",
            "other_ids": {}
        },
        "BIBREF26": {
            "ref_id": "b26",
            "title": "Less than two cards in the game contain rats",
            "authors": [],
            "year": null,
            "venue": "",
            "volume": "",
            "issn": "",
            "pages": "",
            "other_ids": {}
        },
        "BIBREF27": {
            "ref_id": "b27",
            "title": "Please give an answer to the next question! Lena can see that at least one card in the game contains a rat but she cannot see if there are more rats on the cards that are face down. So, she cannot know whether less than two cards in the game contain rats or not. Thus, it is not appropriate for Lena to utter this sentence",
            "authors": [],
            "year": null,
            "venue": "",
            "volume": "",
            "issn": "",
            "pages": "",
            "other_ids": {}
        },
        "BIBREF28": {
            "ref_id": "b28",
            "title": "The next exercises will not have explanations anymore. If questions arise during the exercises, you can ask experimenters to clarify them before the start of the main experiments",
            "authors": [],
            "year": null,
            "venue": "",
            "volume": "",
            "issn": "",
            "pages": "",
            "other_ids": {}
        },
        "BIBREF29": {
            "ref_id": "b29",
            "title": "More than two cards on the table contain ponds",
            "authors": [],
            "year": null,
            "venue": "",
            "volume": "",
            "issn": "",
            "pages": "",
            "other_ids": {}
        },
        "BIBREF30": {
            "ref_id": "b30",
            "title": "Your answer is correct. / Your answer is not correct. / Please give an answer to the next question!",
            "authors": [],
            "year": null,
            "venue": "",
            "volume": "",
            "issn": "",
            "pages": "",
            "other_ids": {}
        },
        "BIBREF31": {
            "ref_id": "b31",
            "title": "No cards on the table contain pumpkins",
            "authors": [],
            "year": null,
            "venue": "",
            "volume": "",
            "issn": "",
            "pages": "",
            "other_ids": {}
        },
        "BIBREF32": {
            "ref_id": "b32",
            "title": "Your answer is correct. / Your answer is not correct. / Please give an answer to the next question!",
            "authors": [],
            "year": null,
            "venue": "",
            "volume": "",
            "issn": "",
            "pages": "",
            "other_ids": {}
        },
        "BIBREF33": {
            "ref_id": "b33",
            "title": "More than three cards in the game contain ponds",
            "authors": [],
            "year": null,
            "venue": "",
            "volume": "",
            "issn": "",
            "pages": "",
            "other_ids": {}
        },
        "BIBREF34": {
            "ref_id": "b34",
            "title": "Your answer is correct. / Your answer is not correct. / Please give an answer to the next question!",
            "authors": [],
            "year": null,
            "venue": "",
            "volume": "",
            "issn": "",
            "pages": "",
            "other_ids": {}
        },
        "BIBREF35": {
            "ref_id": "b35",
            "title": "Less than three cards on the table contain ladybugs",
            "authors": [],
            "year": null,
            "venue": "",
            "volume": "",
            "issn": "",
            "pages": "",
            "other_ids": {}
        },
        "BIBREF36": {
            "ref_id": "b36",
            "title": "Please give an answer to the next question! 2.4 End of Exercises This were the exercises. If you do not have any questions, the main experiment will start after pressing a button. Please note that you will not receive any feedback during the main experiment. This part has 7 sections",
            "authors": [],
            "year": null,
            "venue": "",
            "volume": "",
            "issn": "",
            "pages": "",
            "other_ids": {}
        }
    },
    "ref_entries": {
        "TABREF2": {
            "text": "The overview of fillers: the table provides a sum of different categories of filler trials. Note: for each category, the sum of examples equals 180.",
            "latex": null,
            "type": "table"
        },
        "TABREF3": {
            "text": "Exhaustive list of the exercise trials",
            "latex": null,
            "type": "table"
        },
        "TABREF4": {
            "text": "The list of word combinations, with frequencies and English translations, used for the target trials. Note that the set of words in each column (word1, word2, word3) is the same, but the words are combined each time differently.",
            "latex": null,
            "type": "table"
        },
        "TABREF7": {
            "text": "List of word/pictures combinations used for the filler trials",
            "latex": null,
            "type": "table"
        },
        "TABREF9": {
            "text": "In diesem Experiment testen wir dein Verständnis von gesprochenen Sätzen und deine Aufmerksamkeit beim Betrachten von Bildern.In jedem Durchgang siehst du eine Spielsituation, bei der du und ein weiterer Spieler oder eine weitere Spielerin Karten auf dem Tisch und außerhalb des Tisches sehen können.Alle sichtbaren Karten, sowohl die auf dem Tisch als auch außerhalb von diesem, befinden sich im Spiel. Die Karten auf dem Tisch sind immer offen, die Karten außerhalb des Tisches können verdeckt oder offen sein. Bilder auf verdeckten Karten sind euch beiden nicht bekannt.Auf einer Karte befinden sich maximal zwei Objekte. Die Karten in einer Runde zeigen bis zu drei verschiedene Typen von Objekten. Bitte beachte, dass es auch leere Karten geben kann.Jede Spielrunde wird von einem gesprochenen Satz deines Mitspielers oder deiner Mitspielerin begleitet, welchen er oder sie in einem vorherigen Versuch aufgenommen hat. Dabei gibt es Aussagen, welche die Spielsituation angemessen beschreiben, und welche, die unangemessen sind. Bei manchen der unangemessen Sätze macht er oder sie einen Fehler, manchmal ist es aber auch so, dass er oder sie bewusst einen unangemessenen Satzäußert.",
            "latex": null,
            "type": "table"
        }
    },
    "back_matter": []
}