{
    "paper_id": "0a0cfac7d75dad7fd282c38ab95213f36f1a0255",
    "metadata": {
        "title": "Travelers' attitude towards carpooling in Islamabad",
        "authors": [
            {
                "first": "Altaf",
                "middle": [],
                "last": "Ayaz",
                "suffix": "",
                "affiliation": {
                    "laboratory": "",
                    "institution": "National University of Sciences and Technology",
                    "location": {
                        "postCode": "44000",
                        "settlement": "Islamabad",
                        "country": "Pakistan"
                    }
                },
                "email": ""
            },
            {
                "first": "Abdul",
                "middle": [],
                "last": "Waheed",
                "suffix": "",
                "affiliation": {
                    "laboratory": "",
                    "institution": "National University of Sciences and Technology",
                    "location": {
                        "postCode": "44000",
                        "settlement": "Islamabad",
                        "country": "Pakistan"
                    }
                },
                "email": ""
            },
            {
                "first": "Hamza",
                "middle": [],
                "last": "Saleem",
                "suffix": "",
                "affiliation": {
                    "laboratory": "",
                    "institution": "National University of Sciences and Technology",
                    "location": {
                        "postCode": "44000",
                        "settlement": "Islamabad",
                        "country": "Pakistan"
                    }
                },
                "email": ""
            },
            {
                "first": "Malik",
                "middle": [
                    "Muneeb"
                ],
                "last": "Abid",
                "suffix": "",
                "affiliation": {
                    "laboratory": "",
                    "institution": "National University of Sciences and Technology",
                    "location": {
                        "postCode": "44000",
                        "settlement": "Islamabad",
                        "country": "Pakistan"
                    }
                },
                "email": ""
            }
        ]
    },
    "abstract": [
        {
            "text": "Islamabad, being the capital of Pakistan, is attracting every business. Thus, the city is growing towards traffic congestion as the city's car ownership rate is rapidly growing. In such a situation, for successful implementation, the policymakers need to understand the public acceptance of carpooling services based on its key motives and constraints. This research explores the key motives and constraints to the introduction scenarios of carpooling service in Islamabad. A stated preference questionnaire survey was conducted via Google Form comprising several parts relating to carpooling. Exploratory and confirmatory factor analyses were processed, and a structural model was developed. Females (both single and married) were less orientated to carpool with males and married males with females. Unknown carpooling partners negatively influenced the factor of intention to shift to carpooling service. Our study provides policymakers and transport planners with an appropriate forecasting model of significant factors. In addition, it provides suggestions to transport planners to design promotional tools to enhance the tendency of carpooling among private car users in favor of reducing traffic congestion and increased car ownership rate in the city.",
            "cite_spans": [],
            "ref_spans": [],
            "section": "Abstract"
        }
    ],
    "body_text": [
        {
            "text": "The term carpooling is widely used since the 1970s in response to the oil crises at that time. However, its history is still connecting to more back dates of time. In the early days of World War I when the USA met the economic declines, car owners started offering seats in their cars [1, 2] . This step got much success for short times, and the car manufacturers were affected very badly. So, they promoted their policies to a new and advanced level, which ultimately showed an almost 90% decline in carpools [3] .",
            "cite_spans": [
                {
                    "start": 285,
                    "end": 288,
                    "text": "[1,",
                    "ref_id": "BIBREF0"
                },
                {
                    "start": 289,
                    "end": 291,
                    "text": "2]",
                    "ref_id": "BIBREF1"
                },
                {
                    "start": 510,
                    "end": 513,
                    "text": "[3]",
                    "ref_id": "BIBREF2"
                }
            ],
            "ref_spans": [],
            "section": "Brief history"
        },
        {
            "text": "In today's time, mobile applications operating through Internet connections promote carpooling [4] . Companies like Uber, Careem, Swvl, BlaBlaCar, Lyftshare, and Zimride are saturating the market day to day. Through these mobile applications, one can request a ride while sitting at his workplace. It provides the riders quiet ease in booking a ride, which makes it attractive once again. While dealing with these setups, the specific platform-based organizations are accelerating its rapid market spread, so meeting a massive range of clients to create their matches is conceivable [5] .",
            "cite_spans": [
                {
                    "start": 95,
                    "end": 98,
                    "text": "[4]",
                    "ref_id": "BIBREF3"
                },
                {
                    "start": 583,
                    "end": 586,
                    "text": "[5]",
                    "ref_id": "BIBREF4"
                }
            ],
            "ref_spans": [],
            "section": "Brief history"
        },
        {
            "text": "Different authors have defined the term \"carpool\" differently. However, still, we can find agreements and correlations in their definitions. Let us discuss some of them.",
            "cite_spans": [],
            "ref_spans": [],
            "section": "Different technical terms"
        },
        {
            "text": "\"A setup in which more than one individuals share the use of a personally owned vehicle for a trip and the travelers pay to the driver's trip-related costs\" [6] With the simplest approach, the carpool term is just a traveling method that needs at least one driver and one passenger who shares their rides from the same origin to the same destination. However, this situation becomes difficult to handle if the passenger needs to drop at some different locations. Another most complex form of this setup persists when the driver has to pick the passenger from some defined location and then again in the same trip needs to be dropped off at the originated location again. Such a situation leads the trips to indirect routes, longer distances, and increased travel time [7] . Therefore, the most indirect route trips are assumed to be made for far-away places to minimize the lost time. Some usual trip purposes of carpool are shopping, time-out activities, school, picking up children, and work. But the longest trips via carpool are generally found to be work-based [6] .",
            "cite_spans": [
                {
                    "start": 157,
                    "end": 160,
                    "text": "[6]",
                    "ref_id": "BIBREF5"
                },
                {
                    "start": 768,
                    "end": 771,
                    "text": "[7]",
                    "ref_id": "BIBREF6"
                },
                {
                    "start": 1066,
                    "end": 1069,
                    "text": "[6]",
                    "ref_id": "BIBREF5"
                }
            ],
            "ref_spans": [],
            "section": "Different technical terms"
        },
        {
            "text": "In our everyday life, we use two terms \"carpooling\" and \"carsharing\" as in the same context, but they must be distinguished from each other As per the definition of Millard-Ball et al. [8] \"carsharing is hiring a vehicle for some time (in hours).\" While comparing both modes, carsharing does not refer to the ownership of the car. In carsharing, the vehicle belongs to a company, and the users make the trips all alone in the hired car [9] . The fundamental carsharing goal is to reduce privately owned vehicles' load for the infrastructure built without disturbing the accessibility factor of vehicles.",
            "cite_spans": [
                {
                    "start": 185,
                    "end": 188,
                    "text": "[8]",
                    "ref_id": "BIBREF7"
                },
                {
                    "start": 436,
                    "end": 439,
                    "text": "[9]",
                    "ref_id": "BIBREF8"
                }
            ],
            "ref_spans": [],
            "section": "Different technical terms"
        },
        {
            "text": "Another variation needs to be clarified between \"on-demand\" and \"sharing\" systems Private systems like Uber, Careem, and Lyft deal in taxi-like facilities. However, the trip needs to be made by customers' order via their online android and IOS applications. That is why such trips are mostly called ride-hailing rather than considering them as ridesharing [10] . So, one must be taking care of all of these terminologies while conducting any study.",
            "cite_spans": [
                {
                    "start": 356,
                    "end": 360,
                    "text": "[10]",
                    "ref_id": "BIBREF9"
                }
            ],
            "ref_spans": [],
            "section": "Different technical terms"
        },
        {
            "text": "Two more such terms \"slugging\" and \"hitchhiking\" refer to a person sitting at the roadside and waiting for a car to come and get him picked up to his destination location",
            "cite_spans": [],
            "ref_spans": [],
            "section": "Different technical terms"
        },
        {
            "text": "The difference among them is that in carpooling, the passengers have to split the cost while slugging and hitchhiking do not involve splitting the costs. Another difference is that the term \"slugging\" is commonly used in US research while \"hitchhiking\" is commonly used in European papers. Both of these terms should not be used synonymously with carpooling even though both forms of traveling fits in the informal carpooling category [11] .",
            "cite_spans": [
                {
                    "start": 435,
                    "end": 439,
                    "text": "[11]",
                    "ref_id": "BIBREF10"
                }
            ],
            "ref_spans": [],
            "section": "Different technical terms"
        },
        {
            "text": "Apart from the terminologies described above, \"liftsharing,\" \"ridesharing,\" and \"motorpooling\" can be taken as the substitutes for the context of carpooling But as per the literature and searches through Google Scholar, the common use of the term \"carpooling\" or \"carpool\" worldwide is followed by \"carsharing.\" Besides these searches, a literature also predicts the technicality of the term ridesharing that covers the models for traffic assignments, dynamic ridesharing algorithms, and optimization of ridesharing systems [12, 13] . Commonly, a mobile phone application is specified by ridesharing systems. The literature always addresses this type of carpooling as dynamic carpooling [11] . At the same time, the titles like liftsharing and motor sharing are rarely seen in the literature. The same system of vanpooling has also been introduced but just with a little difference in the larger vehicle size. Any company specially organizes vanpooling for their employees [14] .",
            "cite_spans": [
                {
                    "start": 524,
                    "end": 528,
                    "text": "[12,",
                    "ref_id": "BIBREF11"
                },
                {
                    "start": 529,
                    "end": 532,
                    "text": "13]",
                    "ref_id": "BIBREF12"
                },
                {
                    "start": 687,
                    "end": 691,
                    "text": "[11]",
                    "ref_id": "BIBREF10"
                },
                {
                    "start": 973,
                    "end": 977,
                    "text": "[14]",
                    "ref_id": "BIBREF13"
                }
            ],
            "ref_spans": [],
            "section": "Different technical terms"
        },
        {
            "text": "Ridesharing for more clarifications can further be studied from Roukouni and de Almeida",
            "cite_spans": [],
            "ref_spans": [],
            "section": "Different technical terms"
        },
        {
            "text": "Correia [15] and Chen and Shaheen studies [1] Aiming at past studies or normal descriptions of all of the ridesharing terms discussed above, \"an arrangement between two or more than two persons commuting together in the same vehicle having their destination locations on the same route and dividing the travel costs\" is called carpooling. Traffic congestion due to the inclination in the car ownership rate has become a serious problem in today's world [16] . Central business districts mostly meet the rise in vehicle ownerships because it attracts people due to the various facilities. Islamabad is also one of the same cases. Currently, traffic congestion is not a severely noticeable problem in Islamabad. However, the city will meet this issue in the future as the city's population is rapidly growing every year with a growth rate of 3.05% [17] (Fig. 1 ) and so the auto ownership rate. Therefore, policymakers and transport planners need to consider strategic planning and transport studies for Islamabad in advance. Carpooling can reduce the auto ownership rate that can be proved as the most economical and feasible solution.",
            "cite_spans": [
                {
                    "start": 8,
                    "end": 12,
                    "text": "[15]",
                    "ref_id": "BIBREF14"
                },
                {
                    "start": 42,
                    "end": 45,
                    "text": "[1]",
                    "ref_id": "BIBREF0"
                },
                {
                    "start": 453,
                    "end": 457,
                    "text": "[16]",
                    "ref_id": "BIBREF15"
                },
                {
                    "start": 846,
                    "end": 850,
                    "text": "[17]",
                    "ref_id": "BIBREF16"
                }
            ],
            "ref_spans": [
                {
                    "start": 851,
                    "end": 858,
                    "text": "(Fig. 1",
                    "ref_id": "FIGREF1"
                }
            ],
            "section": "Different technical terms"
        },
        {
            "text": "This study aims at the following objectives:",
            "cite_spans": [],
            "ref_spans": [],
            "section": "Objectives"
        },
        {
            "text": "To analyze the factors of traveler's attitudes towards different carpooling scenarios Presenting key motives and constraints for the introduction scenarios of carpooling service within the city To develop a structural model for significant factors affecting travelers' attitudes towards carpooling in Islamabad",
            "cite_spans": [],
            "ref_spans": [],
            "section": "Objectives"
        },
        {
            "text": "In the current scenario of the transportation sector, some challenges like noise pollution and congestion are wasting our limited resources [18] . Mode shift towards public transports is not always found the best solution to such issues. Let us take an example of public transport; if the occupancy is low, the public transport will still not be sustainable [19] . So, to eliminate such problems, transportation planners and policymakers usually introduce a substitutional transport mode that can be \"carpooling\" to better the transportation operations [20] .",
            "cite_spans": [
                {
                    "start": 140,
                    "end": 144,
                    "text": "[18]",
                    "ref_id": "BIBREF17"
                },
                {
                    "start": 358,
                    "end": 362,
                    "text": "[19]",
                    "ref_id": "BIBREF18"
                },
                {
                    "start": 553,
                    "end": 557,
                    "text": "[20]",
                    "ref_id": "BIBREF19"
                }
            ],
            "ref_spans": [],
            "section": "Literature review"
        },
        {
            "text": "Carpooling is a term used to specify the scenario of traveling in a single car by more than one person. Carpooling helps in reducing the number of vehicles of single occupancy [7] . It also allows travelers to get flexibility and low-cost trips. This traveling system is quite friendly to the environment, reducing emissions that keep society safe and natural [21] . As per the report of the US Environmental Protection Agency in 2005, travelers, especially the employees, can cash these benefits of carpooling, i.e., time-saving, lower costs. In carpooling, time utilization becomes greater than usual, i.e., time value for sleeping or reading purposes while traveling (because the rider does not drive). However, in the case of employers, parking lot demands reduce. Carpooling can use existing infrastructure, so public investments are also not required to construct separate traffic lanes [22] .",
            "cite_spans": [
                {
                    "start": 176,
                    "end": 179,
                    "text": "[7]",
                    "ref_id": "BIBREF6"
                },
                {
                    "start": 360,
                    "end": 364,
                    "text": "[21]",
                    "ref_id": "BIBREF20"
                },
                {
                    "start": 893,
                    "end": 897,
                    "text": "[22]",
                    "ref_id": "BIBREF21"
                }
            ],
            "ref_spans": [],
            "section": "Literature review"
        },
        {
            "text": "The choice of carpooling of the trip makers depends on attitudes, demographic characters, and socioeconomic factors. A major study was conducted by Neoh et al. [7] in 2017, analyzing studies published till 2014, to find those factors that can influence the traveler's decision of choosing carpooling as their trip mode. Their offered policies, rules, regulations, and facilities were also being analyzed to improve carpool involvement. This research categorized the key factors affecting carpooling into two main groups, i.e., \"internal\" and \"external\" factors. Internal factors include demographics and judgmental aspects while external factors include interventions and on spot situational aspects. As per the current situations, new technologies and modernizations are introduced into our society so the \"sharing economy\" idea is on the top priority [4] . Policies also need to be amended as per the current situations to meet the society demands and trends.",
            "cite_spans": [
                {
                    "start": 160,
                    "end": 163,
                    "text": "[7]",
                    "ref_id": "BIBREF6"
                },
                {
                    "start": 853,
                    "end": 856,
                    "text": "[4]",
                    "ref_id": "BIBREF3"
                }
            ],
            "ref_spans": [],
            "section": "Literature review"
        },
        {
            "text": "Seyedabrishami et al. [23] support the likely rise in the number of carpoolers using suitable strategies which indirectly will benefit the fuel consumption rate. Ridesharing in Canada and the USA represents almost 8 to 11% of the transport mode share. Also, there is a need to evaluate its association with traffic congestion, structure development, emissions, and energy consumption [1] . In a similar context, Manzini and Pareschi [24] support carpooling as an effective approach for the reduction of travel demands and costs. The accompanying issues such as travel demand management action acceptability by the people and its usefulness in varying travel attitudes need to be assessed. Carpooling policies for such aspects may be influenced by various factors: lifestyle, sociodemographics, and travelers' intentions. Many researchers support the likely impact of individuals' lifestyle and behavior upon travel-associated strategies [25] [26] [27] . Some other studies have also been contributed to the significant influence of various attitudes towards individuals' travel behavior and travel demand management policies [28] [29] [30] . More specifically, a particular travel demand management policy is mainly succeeding due to the restrictions on personal vehicles and travel incentives [25] . Less cost, comfortable trip, and provision of well-kept facilities are found the main motives for a successful carpooling service as per the study of Sheldon and Heywood [31] . More travelers will carpool if the carpooling service was aided with high-occupancy vehicle lanes [32] . Seyedabrishami et al. [23] consider that high-occupancy vehicle lanes may not significantly affect travelers' carpooling tendency, though it reduces the travel time for ridesharing. Agreeing to Li et al. [32] , the main causes of carpooling are timesaving, liking excursions with others, and aiding the environment and culture. However, the program for matching the trip-mate, preferred parking at work, and owners' carpooling incentives are the least significant aspects of carpooling for trips [32] .",
            "cite_spans": [
                {
                    "start": 22,
                    "end": 26,
                    "text": "[23]",
                    "ref_id": "BIBREF23"
                },
                {
                    "start": 384,
                    "end": 387,
                    "text": "[1]",
                    "ref_id": "BIBREF0"
                },
                {
                    "start": 433,
                    "end": 437,
                    "text": "[24]",
                    "ref_id": "BIBREF24"
                },
                {
                    "start": 937,
                    "end": 941,
                    "text": "[25]",
                    "ref_id": "BIBREF25"
                },
                {
                    "start": 942,
                    "end": 946,
                    "text": "[26]",
                    "ref_id": "BIBREF26"
                },
                {
                    "start": 947,
                    "end": 951,
                    "text": "[27]",
                    "ref_id": "BIBREF27"
                },
                {
                    "start": 1125,
                    "end": 1129,
                    "text": "[28]",
                    "ref_id": "BIBREF28"
                },
                {
                    "start": 1130,
                    "end": 1134,
                    "text": "[29]",
                    "ref_id": "BIBREF29"
                },
                {
                    "start": 1135,
                    "end": 1139,
                    "text": "[30]",
                    "ref_id": "BIBREF30"
                },
                {
                    "start": 1294,
                    "end": 1298,
                    "text": "[25]",
                    "ref_id": "BIBREF25"
                },
                {
                    "start": 1471,
                    "end": 1475,
                    "text": "[31]",
                    "ref_id": "BIBREF31"
                },
                {
                    "start": 1576,
                    "end": 1580,
                    "text": "[32]",
                    "ref_id": "BIBREF32"
                },
                {
                    "start": 1605,
                    "end": 1609,
                    "text": "[23]",
                    "ref_id": "BIBREF23"
                },
                {
                    "start": 1787,
                    "end": 1791,
                    "text": "[32]",
                    "ref_id": "BIBREF32"
                },
                {
                    "start": 2079,
                    "end": 2083,
                    "text": "[32]",
                    "ref_id": "BIBREF32"
                }
            ],
            "ref_spans": [],
            "section": "Literature review"
        },
        {
            "text": "A study by Minett [33] concluded that a sufficient portion of bike and car drivers look for an alternative mode to commute, which offers equal comfort and less cost, as they feel too tired while driving alone. Some researchers believe that money saving is the key motive for carpooling, and thus, it is a mode of travel for low-income people (Correia and Viegas [34] ). A recommendation of a proper setup for individuals' trust and interaction with other travelers was also provided in their study. According to Ciari [35] , safety, alone driving, guaranteed service for back home trips, and particular traveler's group are the key motives for choosing carpooling. Moreover, travelers' attitude, incentives on carpooling like money-saving, time and safety, purpose of the trip, trip regularity, age, and disincentives on personal vehicles may also be included [36, 37] .",
            "cite_spans": [
                {
                    "start": 18,
                    "end": 22,
                    "text": "[33]",
                    "ref_id": "BIBREF33"
                },
                {
                    "start": 362,
                    "end": 366,
                    "text": "[34]",
                    "ref_id": "BIBREF34"
                },
                {
                    "start": 518,
                    "end": 522,
                    "text": "[35]",
                    "ref_id": "BIBREF35"
                },
                {
                    "start": 860,
                    "end": 864,
                    "text": "[36,",
                    "ref_id": "BIBREF36"
                },
                {
                    "start": 865,
                    "end": 868,
                    "text": "37]",
                    "ref_id": "BIBREF37"
                }
            ],
            "ref_spans": [],
            "section": "Literature review"
        },
        {
            "text": "Malodia and Singla [38] indicated additional travel time, walk and waiting time on pickup location, and cost saving as the influencing factors regarding carpooling utility for Indian cities. Travelers' tendency for carpooling is significantly affected by the distance to the meeting site, parking cost, partner matching, and flexibility of services as per the result of a created probit model [39] . To encourage carpooling, an online survey was conducted at Michigan State University, and the same issue of finding carpool partners was identified [40] . Ostrovsky [41] also reported the socially optimal matching of the riders as the main outcome while studying the economical interactions among autonomous transport, carpooling, and road pricing. Srivastava [42] provided various factors like incentives, low cost, mixed approach, and incentives to drivers to improve such shared services use. Important factors found for carpooling are gender, nearness to car regions, encouragement to save time, and present transit services use (Soltys [43] ).",
            "cite_spans": [
                {
                    "start": 19,
                    "end": 23,
                    "text": "[38]",
                    "ref_id": "BIBREF38"
                },
                {
                    "start": 393,
                    "end": 397,
                    "text": "[39]",
                    "ref_id": "BIBREF39"
                },
                {
                    "start": 548,
                    "end": 552,
                    "text": "[40]",
                    "ref_id": "BIBREF40"
                },
                {
                    "start": 565,
                    "end": 569,
                    "text": "[41]",
                    "ref_id": "BIBREF41"
                },
                {
                    "start": 760,
                    "end": 764,
                    "text": "[42]",
                    "ref_id": "BIBREF42"
                },
                {
                    "start": 1041,
                    "end": 1045,
                    "text": "[43]",
                    "ref_id": "BIBREF43"
                }
            ],
            "ref_spans": [],
            "section": "Literature review"
        },
        {
            "text": "Watts [44] indicated many constraints to carpooling such as household size, car ownership's rate, variations in travel conduct, and attitudes. This study also supports the increment of vehicle occupancy rate for work purposes trips because of carpooling.",
            "cite_spans": [
                {
                    "start": 6,
                    "end": 10,
                    "text": "[44]",
                    "ref_id": "BIBREF44"
                }
            ],
            "ref_spans": [],
            "section": "Literature review"
        },
        {
            "text": "Unlikely Asian countries, Delhomme and Gheorghiu [9] found women and people with children as more probable to be a carpooler. It was also found that the travelers with a positive approach towards public transport and aware of the environmental concerns are also more likely to be a carpooler [9] .",
            "cite_spans": [
                {
                    "start": 49,
                    "end": 52,
                    "text": "[9]",
                    "ref_id": "BIBREF8"
                },
                {
                    "start": 292,
                    "end": 295,
                    "text": "[9]",
                    "ref_id": "BIBREF8"
                }
            ],
            "ref_spans": [],
            "section": "Literature review"
        },
        {
            "text": "Chen et al. [45] studied the important contributors to carpool by collecting data from three different cities of the USA with varying attributes and identified that promotion of carpool was significantly affected by the incentives for individual level; however, statistically significant differences were observed in carpool users for each city. Moreover, household lifestyle, parking finding time at work, gender, and age were marked as positively effecting factors for carpooling [45] .",
            "cite_spans": [
                {
                    "start": 12,
                    "end": 16,
                    "text": "[45]",
                    "ref_id": "BIBREF45"
                },
                {
                    "start": 482,
                    "end": 486,
                    "text": "[45]",
                    "ref_id": "BIBREF45"
                }
            ],
            "ref_spans": [],
            "section": "Literature review"
        },
        {
            "text": "Data from the transportation survey in \"The Ohio State University\" was used to analyze the factors affecting carpooling preference and identified the positive association of travel distance, marital status, current mode of transportation, and attitudes towards carpooling [20] . The study also resulted in the variation of the motives and constraints for carpooling by role (present carpool users, expected carpool users, and not involved travelers). Mou et al. [46] conducted an online survey in Jinan, China, to examine the effect of carpooling on car purchasers' buying intention and tested the proposed hypothesis using the structural equation modeling technique. They found about 22% of car purchasers delayed buying a car while 12% of them even changed their decision of purchasing a car [46] .",
            "cite_spans": [
                {
                    "start": 272,
                    "end": 276,
                    "text": "[20]",
                    "ref_id": "BIBREF19"
                },
                {
                    "start": 462,
                    "end": 466,
                    "text": "[46]",
                    "ref_id": "BIBREF46"
                },
                {
                    "start": 794,
                    "end": 798,
                    "text": "[46]",
                    "ref_id": "BIBREF46"
                }
            ],
            "ref_spans": [],
            "section": "Literature review"
        },
        {
            "text": "Ordinary least squares approach was used to analyze the behavior of carpoolers in traveling and resulted in a non-habitual aspect of carpooling for workers [47] . Sociodemographic characteristics like household composition, age, gender, and being native were indicated in a constant correlation with carpooling partaking [47] . Moreover, it is stated that the approach towards carpooling may get declined due to the current COVID-19 pandemic [47] . An attempt to map commuters' attitude (cognitive complexity and empowerment perceptions) towards carpooling services has been made. A scenario-based survey was conducted from the carpooling experienced persons. MANOVA analysis has been used which showed the significant influence of both the attitudes on the motivational constructs [48] .",
            "cite_spans": [
                {
                    "start": 156,
                    "end": 160,
                    "text": "[47]",
                    "ref_id": "BIBREF47"
                },
                {
                    "start": 321,
                    "end": 325,
                    "text": "[47]",
                    "ref_id": "BIBREF47"
                },
                {
                    "start": 442,
                    "end": 446,
                    "text": "[47]",
                    "ref_id": "BIBREF47"
                },
                {
                    "start": 782,
                    "end": 786,
                    "text": "[48]",
                    "ref_id": "BIBREF48"
                }
            ],
            "ref_spans": [],
            "section": "Literature review"
        },
        {
            "text": "The worldwide studied literature delivers many of the factors that positively contribute to the carpooling policies. However, there are certain variables that negatively influence this service. Still it is essential to classify the possibility of such travel demand management strategies in the local socioeconomic perspective of Islamabad. This is very much important to study because the characteristics of the travelers change with respect to the city or a country. People of each city have their own unique lifestyles with socioeconomic characteristics regarding culture, population growth, transportation problems and its infrastructure, and land use pattern. In such situation, the imposition of procedures established on the judgments for other cities may poorly affect the whole transportation system of the policy-implementing city and which may cause the poor acceptability of the public towards it. Thus, it should be considered as a foremost priority for a vital study of the local factors of the targeted city Islamabad to introduce some new transportation policies.",
            "cite_spans": [],
            "ref_spans": [],
            "section": "Literature review"
        },
        {
            "text": "A complete framework of the adopted methodology for this study is shown in Fig. 2 . The stepwise description of which is discussed below. ",
            "cite_spans": [],
            "ref_spans": [
                {
                    "start": 75,
                    "end": 81,
                    "text": "Fig. 2",
                    "ref_id": "FIGREF2"
                }
            ],
            "section": "Methods"
        },
        {
            "text": "Islamabad being the capital of Pakistan is attracting every business hence becoming a private car-dominating city and thus chosen for this study. The exact location of the city shown in Fig. 3 can be accessed with the coordinates 33.7205°N, 73.0405°E on Google Map.",
            "cite_spans": [],
            "ref_spans": [
                {
                    "start": 186,
                    "end": 192,
                    "text": "Fig. 3",
                    "ref_id": null
                }
            ],
            "section": "Study area"
        },
        {
            "text": "Following the research trends of the literature related to the context of carpooling, our study also depends upon some theoretical assumptions. Five latent variables are taken from the literature for this study (see Fig. 4 ). Ashraf et al. [49] and Sheldon and Heywood [31] concluded the significant impact of socioeconomic and environmental benefits of carpooling service on user's tendency for using this service. Further, Ashraf et al. [49] reported motives for carpooling services such as cost reduction, free parking, and preference of traveling in high-occupancy vehicle lanes as positive factors for carpooling services. Similarly, constraints in preferring carpooling service such as privacy concerns, unknown passenger fellow, and sharing contact details were found in negative relation to carpooling service. de Almeida Correia et al. [28] found the problem of \"stranger partner\" variable in inverse relation to carpooling service and difficult to overcome. On the other hand, partners' acquaintanceship factor for carpooling service is reported as positively affecting users' intention to use carpooling service. Relying on the literature of these researches, all of these variables are considered for our study as well. The overall theoretical framework of the assumed hypothesis for this study is as defined as follows:",
            "cite_spans": [
                {
                    "start": 240,
                    "end": 244,
                    "text": "[49]",
                    "ref_id": "BIBREF49"
                },
                {
                    "start": 269,
                    "end": 273,
                    "text": "[31]",
                    "ref_id": "BIBREF31"
                },
                {
                    "start": 439,
                    "end": 443,
                    "text": "[49]",
                    "ref_id": "BIBREF49"
                },
                {
                    "start": 845,
                    "end": 849,
                    "text": "[28]",
                    "ref_id": "BIBREF28"
                }
            ],
            "ref_spans": [
                {
                    "start": 216,
                    "end": 222,
                    "text": "Fig. 4",
                    "ref_id": null
                }
            ],
            "section": "Hypothesis"
        },
        {
            "text": "Hypothesis 1 (H1). Socioeconomic and environmental benefits of carpooling have a significant and positive effect on the intention to shift to carpooling service. Hypothesis 2 (H2). Stranger partner's factors of carpooling have a significant and negative effect on the intention to shift to carpooling service. Hypothesis 3 (H3). Constraints for carpooling have a significant and negative effect on the intention to shift to carpooling service. Hypothesis 4 (H4). Factors of motives for carpooling have a significant and positive effect on the intention to shift to carpooling service. Hypothesis 5 (H5). Partners' acquaintanceship in carpooling has a significant and positive effect on the intention to shift to carpooling service.",
            "cite_spans": [],
            "ref_spans": [],
            "section": "Hypothesis"
        },
        {
            "text": "Questionnaire designed comprised five parts: (1) respondents' personal and travel information, (2) travelers' response to presented carpooling situations, (3) benefits of carpooling, (4) probability of switch to carpooling service and favoring own vehicle over carpooling, and (5) travelers' response to carpooling with known and stranger partners. Items in the questionnaire were critically designed according to the hypothesis of the study and understanding of the respondents. The first part was used to distribute the respondents according to their social and demographic characteristics. The results of which are presented in Table 2 and Fig. 7 . All other remaining sections of the questionnaire were measured on a Likert scale from 1 to 5: 1 being strongly disagreed and 5 strongly agreed with the presented scenario of the carpooling service within the questionnaire. The questionnaire was prepared on Google Form to collect data from the respondents online. Meanwhile, interviews were also conducted in the study area. The targeted people were working or residing population of Islamabad city only, both potential and personal car users. An initial survey of 50 samples was conducted to check the accuracy of the items of the designed questionnaire. The questionnaire was improved as per outcomes of the initial survey of which the finalized version is as provided in Table 1 .",
            "cite_spans": [],
            "ref_spans": [
                {
                    "start": 631,
                    "end": 638,
                    "text": "Table 2",
                    "ref_id": "TABREF4"
                },
                {
                    "start": 643,
                    "end": 649,
                    "text": "Fig. 7",
                    "ref_id": null
                },
                {
                    "start": 1377,
                    "end": 1384,
                    "text": "Table 1",
                    "ref_id": "TABREF1"
                }
            ],
            "section": "Questionnaire design and pilot survey"
        },
        {
            "text": "After the questionnaire items were confirmed, a complete set of the calculated size of 600 samples was then collected using the Google form link. The sample size was calculated using previous studies' approach [53, 54] at 95% confidence level, 4% margin of error, 50% male population, Z-score of 1.96 and 1.2M population size [17] .",
            "cite_spans": [
                {
                    "start": 210,
                    "end": 214,
                    "text": "[53,",
                    "ref_id": "BIBREF53"
                },
                {
                    "start": 215,
                    "end": 218,
                    "text": "54]",
                    "ref_id": "BIBREF54"
                },
                {
                    "start": 326,
                    "end": 330,
                    "text": "[17]",
                    "ref_id": "BIBREF16"
                }
            ],
            "ref_spans": [],
            "section": "Sample size calculation"
        },
        {
            "text": "Data screening was implied to exclude the unengaged, outlying, and missing responses [55] . The deficiency in the sample size, due to data screening, was completed by more fresh responses. ",
            "cite_spans": [
                {
                    "start": 85,
                    "end": 89,
                    "text": "[55]",
                    "ref_id": "BIBREF55"
                }
            ],
            "ref_spans": [],
            "section": "Sample size calculation"
        },
        {
            "text": "Carpooling can reduce maintenance costs of personal cars. [52] Intentions to shift to carpooling service I will shift to carpooling service.",
            "cite_spans": [
                {
                    "start": 58,
                    "end": 62,
                    "text": "[52]",
                    "ref_id": "BIBREF52"
                }
            ],
            "ref_spans": [],
            "section": "B7"
        },
        {
            "text": "If carpooling costs are lower.",
            "cite_spans": [],
            "ref_spans": [],
            "section": "I1"
        },
        {
            "text": "Because I feel safe with another person driving. [ Partner's acquaintance Aq1",
            "cite_spans": [
                {
                    "start": 49,
                    "end": 50,
                    "text": "[",
                    "ref_id": null
                }
            ],
            "ref_spans": [],
            "section": "I2"
        },
        {
            "text": "Carpooling with one known man. [28] Aq2",
            "cite_spans": [
                {
                    "start": 31,
                    "end": 35,
                    "text": "[28]",
                    "ref_id": "BIBREF28"
                }
            ],
            "ref_spans": [],
            "section": "I2"
        },
        {
            "text": "Carpooling with one known woman. [28] Aq3",
            "cite_spans": [
                {
                    "start": 33,
                    "end": 37,
                    "text": "[28]",
                    "ref_id": "BIBREF28"
                }
            ],
            "ref_spans": [],
            "section": "I2"
        },
        {
            "text": "Carpooling with two known persons. [28] Aq4",
            "cite_spans": [
                {
                    "start": 35,
                    "end": 39,
                    "text": "[28]",
                    "ref_id": "BIBREF28"
                }
            ],
            "ref_spans": [],
            "section": "I2"
        },
        {
            "text": "Carpooling with three known persons. [28] Stranger partners S1 Carpooling with one unknown man.",
            "cite_spans": [
                {
                    "start": 37,
                    "end": 41,
                    "text": "[28]",
                    "ref_id": "BIBREF28"
                }
            ],
            "ref_spans": [],
            "section": "I2"
        },
        {
            "text": "[28]",
            "cite_spans": [],
            "ref_spans": [],
            "section": "I2"
        },
        {
            "text": "Carpooling with one unknown woman.",
            "cite_spans": [],
            "ref_spans": [],
            "section": "S2"
        },
        {
            "text": "[28]",
            "cite_spans": [],
            "ref_spans": [],
            "section": "S2"
        },
        {
            "text": "Carpooling with two unknown persons.",
            "cite_spans": [],
            "ref_spans": [],
            "section": "S3"
        },
        {
            "text": "[28]",
            "cite_spans": [],
            "ref_spans": [],
            "section": "S3"
        },
        {
            "text": "Carpooling with three unknown persons.",
            "cite_spans": [],
            "ref_spans": [],
            "section": "S4"
        },
        {
            "text": "[28]",
            "cite_spans": [],
            "ref_spans": [],
            "section": "S4"
        },
        {
            "text": "Carpooling with one known and one unknown person.",
            "cite_spans": [],
            "ref_spans": [],
            "section": "S5"
        },
        {
            "text": "[28]",
            "cite_spans": [],
            "ref_spans": [],
            "section": "S5"
        },
        {
            "text": "Carpooling with one known and two unknown persons. [28] All these parameters are measured on a Likert scale from 1 to 5, i.e., 1, strongly disagree; 2, disagree; 3, neutral; 4, agree; 5, strongly agree ",
            "cite_spans": [
                {
                    "start": 51,
                    "end": 55,
                    "text": "[28]",
                    "ref_id": "BIBREF28"
                }
            ],
            "ref_spans": [],
            "section": "S6"
        },
        {
            "text": "A total sample size of 600 responses was collected. Table 2 represents the respondents' sociodemographic information. Females (23.2%) as compared to males (76.8%) are less because of religious, social, and cultural constraints in the study area. Likewise, due to the social restrictions, very fewer responses from married people (17.9%) were received. A rich proportion of the respondents were in the age range of 19-25 years that are adults (72%), and so most of them were students (57.7%) followed by the proportion of employees (28%). Non-vehicle owners were 39%, while 24.8% car and 28.5% bike owners in the responses.",
            "cite_spans": [],
            "ref_spans": [
                {
                    "start": 52,
                    "end": 59,
                    "text": "Table 2",
                    "ref_id": "TABREF4"
                }
            ],
            "section": "Respondent's profile"
        },
        {
            "text": "For descriptive analysis of the data, Microsoft Excel 2016 and SPSS are used. SPSS is a set of programming items and associated services for statistical analysis, presented by the International Business Machines Corporation IBM [56] . Analysis of moment structures (AMOS) is also being used for CFA and SEM [57] analysis. Microsoft Excel 2016 and Stat tool package by James Gaskin [58] were utilized for data screening and validity checks, respectively. Figure 5 shows the response of the targeted population against the purposes of using carpooling in their case. Most of the surveyed respondents (52.8%) oriented towards using carpooling service for their educational (university/school) purposes followed by office/work trips (33.3%). This means that carpooling will get more attraction for people like students. This finding is similar to the past research [49] . Considering shopping or other carpooling trip purposes was found with the least response (13.8%).",
            "cite_spans": [
                {
                    "start": 228,
                    "end": 232,
                    "text": "[56]",
                    "ref_id": "BIBREF56"
                },
                {
                    "start": 307,
                    "end": 311,
                    "text": "[57]",
                    "ref_id": "BIBREF57"
                },
                {
                    "start": 381,
                    "end": 385,
                    "text": "[58]",
                    "ref_id": "BIBREF58"
                },
                {
                    "start": 861,
                    "end": 865,
                    "text": "[49]",
                    "ref_id": "BIBREF49"
                }
            ],
            "ref_spans": [
                {
                    "start": 454,
                    "end": 462,
                    "text": "Figure 5",
                    "ref_id": "FIGREF4"
                }
            ],
            "section": "Results and discussions"
        },
        {
            "text": "At the start of the scenarios presented for carpooling, the respondents were asked for their past awareness about the carpooling system, and the results are as shown in Fig. 6 , which shows 58.6% of respondents were either completely (29.7%) or slightly (28.9%) unaware of this service before this study. It is evident from Fig. 6 that the responses are positively skewed towards the origin, which clearly reports the unawareness of the people with this service before this study. To counter this issue in our study, some pictorial representations of the carpooling service were also provided with the questionnaire.",
            "cite_spans": [],
            "ref_spans": [
                {
                    "start": 169,
                    "end": 175,
                    "text": "Fig. 6",
                    "ref_id": "FIGREF5"
                },
                {
                    "start": 324,
                    "end": 330,
                    "text": "Fig. 6",
                    "ref_id": "FIGREF5"
                }
            ],
            "section": "Descriptive analysis"
        },
        {
            "text": "One of the interesting findings of our study is provided in Fig. 7 . This graph describes the attitude of the respondents towards carpooling with opposite gender partner based on their own gender and marital status. It is clearly observable that the graphs for the females, either single or married, are highly skewed positive, which indicates the nonagreeableness of females towards sharing their rides with males. Similarly, the data for married males is positively skewed which also reports their noticeable disagreeableness towards carpooling with females. These results are evident and reality predicting while considering the social and cultural influences of the people of Islamabad.",
            "cite_spans": [],
            "ref_spans": [
                {
                    "start": 60,
                    "end": 66,
                    "text": "Fig. 7",
                    "ref_id": null
                }
            ],
            "section": "Descriptive analysis"
        },
        {
            "text": "On the other hand, if we look at the graphical representation of the single males' data, their result is skewed negatively (away from the origin), which predicts that unmarried males are more oriented towards carpooling with female partners. This is acceptable because the maximum responses received for this study were from the students, i.e., adults in the age range 19 to 25 years.",
            "cite_spans": [],
            "ref_spans": [],
            "section": "Descriptive analysis"
        },
        {
            "text": "If we consider the variable M7 separately as a whole, then we find that its skewness is positive with a value of 0.417 (Appendix). Figure 8 shows the response summary for all the items taken for the study on a Likert scale. It is quite noticeable that the responses for all the items are all sequential (almost the same pattern) except for the items relating to a strangers' partner matching in carpooling (S1 to S6). This is the same as we expected in our hypothesis 2 and is in correspondence to the study of de Almeida Correia et al. [28] . Most of the travelers avoid (disagreed) traveling with stranger partners. Meanwhile, the result of the items for acquaintanceship of the carpooling partner is supportive to our hypothesis 5, i.e., greater agreeableness proportion at top of the graph.",
            "cite_spans": [
                {
                    "start": 537,
                    "end": 541,
                    "text": "[28]",
                    "ref_id": "BIBREF28"
                }
            ],
            "ref_spans": [
                {
                    "start": 131,
                    "end": 139,
                    "text": "Figure 8",
                    "ref_id": "FIGREF6"
                }
            ],
            "section": "Descriptive analysis"
        },
        {
            "text": "Furthermore, It can also be seen that the items (C1 to C5) representing constraint variables for carpooling are non-supportive to our hypothesis 3, i.e., higher ratio at the top of the graph. Finally, item I3 (I will shift to carpooling service if high occupancy vehicle lanes are provided) was summed up in a simple representation (see Fig. 9 ), which displays the merged responses of item I3, i.e., merging responses of \"strongly agree\" and \"agree\" to \"yes always,\" \"neutral\" to \"yes certainly,\" and \"strongly disagree\" and \"disagree\" to \"no.\" Figure 9 depicts that most of the travelers (61%) are willing to shift to carpooling service if high-occupancy vehicle lanes are provided. This result is similar to the study of Ashraf et al. [49] .",
            "cite_spans": [
                {
                    "start": 738,
                    "end": 742,
                    "text": "[49]",
                    "ref_id": "BIBREF49"
                }
            ],
            "ref_spans": [
                {
                    "start": 337,
                    "end": 343,
                    "text": "Fig. 9",
                    "ref_id": null
                },
                {
                    "start": 546,
                    "end": 554,
                    "text": "Figure 9",
                    "ref_id": null
                }
            ],
            "section": "Descriptive analysis"
        },
        {
            "text": "Reliability analysis indicates the way that a scale must reliably reveal the construct it is estimating [59] . Cronbach (1951) presented an approach that is normal in reliability analysis. This action, by any means, is generously identical to the separation of the data in two splits and further recording the correlation estimates respectively. Cronbach's alpha is the average of these estimates which is tested to analyze the consistency of the factors in the designed questionnaire [60] . Its value must be greater than 0.7 in order to get good and acceptable reliability [61] . Table 3 represents the reliability analysis and is all greater than the standard value of 0.70, presenting a good internal consistent reliability among the variables. Appendix represents further descriptive statistics such as the mean, median, and mode for the items of these constructs. Thirty-five items were measured on a scale of 1 to 5. Their mean values range from 2.48 to 3.97 and similarly the standard deviations from 0.94 to 1.33.",
            "cite_spans": [
                {
                    "start": 104,
                    "end": 108,
                    "text": "[59]",
                    "ref_id": "BIBREF59"
                },
                {
                    "start": 111,
                    "end": 126,
                    "text": "Cronbach (1951)",
                    "ref_id": null
                },
                {
                    "start": 485,
                    "end": 489,
                    "text": "[60]",
                    "ref_id": "BIBREF60"
                },
                {
                    "start": 575,
                    "end": 579,
                    "text": "[61]",
                    "ref_id": "BIBREF61"
                }
            ],
            "ref_spans": [
                {
                    "start": 582,
                    "end": 589,
                    "text": "Table 3",
                    "ref_id": "TABREF5"
                }
            ],
            "section": "Reliability analysis"
        },
        {
            "text": "Validity analysis is a fundamental portion of empirical study. Typically, in case of a questionnaire, content and structure validity is selected for measuring. Content validity indicates the suitability and normal consistency among the objects and the tested variables. It actually answers whether the test is fully representative of what it targets to measure [62] . This study focuses on the structure validity, rather than the content validity, as the questionnaire items used in this research are established from the literature review. Structural validation alludes to the ability of objects of estimating the variables. It refers to the ability of the test to measure the concept that it wished for [62] . EFA was conducted to test the structural validity of the variables. The convergent and discriminant validity of the variables are presented in Table 4 . The values of composite reliability for the latent variables are all greater than 0.6 (see Table 4 ), which reports the good model reliability [63] . Similarly, the values of average variance extracted for all the constructs are > 0.5, confirming the convergent validity of the model [64] . Table 3 is obtained by using the master validity sheet in stat tools package prepared by Gaskin [65] in which the diagonal values are obtained from square rooting the value of AVE in Table 4 for each construct, which are all higher than the inter-construct correlations (off-diagonal values), thereby confirming discriminant validity for the model [64] . The covariance of motives with benefits is high (0.60), but still, less than the diagonal value of 0.71 thus fulfilled the validation.",
            "cite_spans": [
                {
                    "start": 361,
                    "end": 365,
                    "text": "[62]",
                    "ref_id": "BIBREF62"
                },
                {
                    "start": 705,
                    "end": 709,
                    "text": "[62]",
                    "ref_id": "BIBREF62"
                },
                {
                    "start": 1008,
                    "end": 1012,
                    "text": "[63]",
                    "ref_id": "BIBREF63"
                },
                {
                    "start": 1149,
                    "end": 1153,
                    "text": "[64]",
                    "ref_id": "BIBREF64"
                },
                {
                    "start": 1252,
                    "end": 1256,
                    "text": "[65]",
                    "ref_id": "BIBREF65"
                },
                {
                    "start": 1504,
                    "end": 1508,
                    "text": "[64]",
                    "ref_id": "BIBREF64"
                }
            ],
            "ref_spans": [
                {
                    "start": 855,
                    "end": 862,
                    "text": "Table 4",
                    "ref_id": null
                },
                {
                    "start": 956,
                    "end": 963,
                    "text": "Table 4",
                    "ref_id": null
                },
                {
                    "start": 1156,
                    "end": 1163,
                    "text": "Table 3",
                    "ref_id": "TABREF5"
                },
                {
                    "start": 1339,
                    "end": 1346,
                    "text": "Table 4",
                    "ref_id": null
                }
            ],
            "section": "Validity analysis"
        },
        {
            "text": "The calculated and collected sample size of 600 responses was checked by KMO and Bartlett's test with KMO measure 0.837 (> 0.70) which is great [66] , and Bartlett's test is remarkable, i.e., significant at 0.000 < 0.005. These outcomes showed that the data were reliable with the requisite of EFA. Thus, further analysis was proceeded by utilizing principal component analysis in factor analysis under dimension reduction in SPSS. ",
            "cite_spans": [
                {
                    "start": 144,
                    "end": 148,
                    "text": "[66]",
                    "ref_id": "BIBREF66"
                }
            ],
            "ref_spans": [],
            "section": "KMO and Bartlett's test"
        },
        {
            "text": "Factor rotation for exploratory factor analysis (EFA) was performed, and a number of iterations were checked in IBM SPSS until a clear pattern matrix was obtained, based on which a confirmatory factor analysis (CFA) was also implied and a structural equation model (SEM) was developed using IBM SPSS AMOS. Promax oblique rotation was utilized for EFA with the options of \"sorted by size\" and \"suppress small coefficients\" under the value 0.5. PCA was performed in SPSS 23.0, and the outcomes are as shown in Table 5 , presenting the high factor loading on each item except I2 (0.524). Still, the overall loading on each construct is too good as the mean values are all greater than 0.70 [67] . Further, the communalities are all pretty higher than 0.3, so the results can be processed further with CFA. Cumulative variance explained 71.675% is quite good [67] . EFA is an iterative process that helps in assembling multiple observed variables into few latent constructs and drops off the irrelevant or insignificant variables from the study. Relying on the results of EFA, this study also dropped one latent construct of \"awareness about carpooling\" after the pilot survey, as it was not providing some reliable and significant results and the clear pattern matrix was unable to obtain in the EFA. Looking at the clean pattern matrix in Table 5 with no cross-loadings, we can conclude that the factors relating to the socioeconomic and environmental benefits of carpooling service have the greatest tendency for a traveler to use this mode as their factor loadings are comparatively quite higher and similarly the partner's acquaintanceship factor as well. Surprisingly, motives have the least loadings, which is a little contradictory to the reality, but can be improved in future researches by adding other suitable variables or subtracting any of the limited variables in our study. At the end, as expected, stranger partner variable is obtained with the lower factor loadings for the travelers to use carpooling service as their transport mode.",
            "cite_spans": [
                {
                    "start": 687,
                    "end": 691,
                    "text": "[67]",
                    "ref_id": "BIBREF67"
                },
                {
                    "start": 855,
                    "end": 859,
                    "text": "[67]",
                    "ref_id": "BIBREF67"
                }
            ],
            "ref_spans": [
                {
                    "start": 508,
                    "end": 515,
                    "text": "Table 5",
                    "ref_id": "TABREF7"
                },
                {
                    "start": 1337,
                    "end": 1344,
                    "text": "Table 5",
                    "ref_id": "TABREF7"
                }
            ],
            "section": "Exploratory factor analysis (EFA) by factors rotation"
        },
        {
            "text": "There are several goodness of fit indices for a CFA model to evaluate. The insignificant chi-square test with p > 0.05 refers to a good fit of the model. This test is too responsive to large sample sizes. Thus, to minimize the impact of sample size, an alternative normed chi-square (Σ2/df) approach is used, whose value is taken acceptable fit from 2 to 5 [68] . Some other indices like root mean square error of approximation (RMSEA) with a recommended value ≤ 0.06, comparative fit index (CFI) with a recommended value ≥ 0.95, standardized root mean square residual (SRMR) with a recommended value ≤ 0.08, and Tucker-Lewis index (TLI) with a recommended value ≥ 0.95 indicate an excellent model fit [68] .",
            "cite_spans": [
                {
                    "start": 357,
                    "end": 361,
                    "text": "[68]",
                    "ref_id": "BIBREF68"
                },
                {
                    "start": 702,
                    "end": 706,
                    "text": "[68]",
                    "ref_id": "BIBREF68"
                }
            ],
            "ref_spans": [],
            "section": "Confirmatory factor analysis (CFA)"
        },
        {
            "text": "In Table 6 , five model fit indices were checked for the measured model, only one out of which did not meet the excellent model fit levels but still good enough to be considered. The remaining four indices are pretty high and acceptable as satisfying the excellency standards, thereby as a whole indicating that the model fits the data quite well.",
            "cite_spans": [],
            "ref_spans": [
                {
                    "start": 3,
                    "end": 10,
                    "text": "Table 6",
                    "ref_id": "TABREF8"
                }
            ],
            "section": "Confirmatory factor analysis (CFA)"
        },
        {
            "text": "The loading of observed variables on latent constructs in Table 5 is all high enough to accept, as their mean values are all greater than 0.6. The covariance of \"benefits of using carpooling service\" with the \"motives to use carpooling service\"",
            "cite_spans": [],
            "ref_spans": [
                {
                    "start": 58,
                    "end": 65,
                    "text": "Table 5",
                    "ref_id": "TABREF7"
                }
            ],
            "section": "Confirmatory factor analysis (CFA)"
        },
        {
            "text": "in Table 4 was alarming with a value of 0.6. Normally, we do not want these covariances to have high values as they may raise validity concerns. In our case, it is still less than the diagonal value of motives (0.71) and benefits (0.84) in Table 4 , so it is accepted.",
            "cite_spans": [],
            "ref_spans": [
                {
                    "start": 3,
                    "end": 10,
                    "text": "Table 4",
                    "ref_id": null
                },
                {
                    "start": 240,
                    "end": 247,
                    "text": "Table 4",
                    "ref_id": null
                }
            ],
            "section": "Confirmatory factor analysis (CFA)"
        },
        {
            "text": "SEM has always been used extensively in the literature for behavioral studies [49, 68, 69] . Socioeconomic and environmental benefits of carpooling service-H1positively affected the intention to use carpooling service (β = 0.38, р < 0.05). This result is similar to that of Ashraf et al. [49] indicating that the best carpooling service would be the one providing the most possible socioeconomic and environmental benefits to the travelers. Stranger partner's factor-H2, where the partners in a pooled car do not know each other-negatively affected the intention to use carpooling service (β = − 0.16, р < 0.05). This is the same as we expected in our hypothesis and is obvious to human nature as well. de Almeida Correia et al. [28] also reported a similar result and found that this situation is not easy to overcome. Constraints for carpooling-H3-had a non-significant and positive effect on the intention to shift to carpooling service. Our analysis in the structural model did not support hypothesis 3 (β = 0.21, р > 0.05). This means that the users' intention to use carpooling services is not affected by the constraints of preferring privately owned cars (see Table 1 for the description of variables). This additionally conveys the conclusion that the car users are also willing to shift to carpooling services if found to be more attractive in the context of cost or convenience. This outcome is quite interesting and different from our expectations but favorable to the introduction of carpooling services. Motives for carpooling-H4 (β = 0.25, р < 0.05)-and partners' acquaintanceship-H5 (β = 0.32, р < 0.05)-both positively and significantly affected the factor of intention to use carpooling services. The results are similar to Ashraf et al. [49] and de Almeida Correia et al. [28] . Ashraf et al. [49] studied the motives for carpooling for a very similar study area as ours. The behavior of the people is almost the same in both areas. The similarity of the results is showing high reliability of the variables and methodology used. de Almeida Correia et al. [28] conducted a study on carpooling using the SEM technique and found that the partner acquaintanceship is highly relatable to the choice of carpooling. Different types of iterations were made, and a positive impact of acquaintance and a negative impact of stranger variables were concluded respectively.",
            "cite_spans": [
                {
                    "start": 78,
                    "end": 82,
                    "text": "[49,",
                    "ref_id": "BIBREF49"
                },
                {
                    "start": 83,
                    "end": 86,
                    "text": "68,",
                    "ref_id": "BIBREF68"
                },
                {
                    "start": 87,
                    "end": 90,
                    "text": "69]",
                    "ref_id": "BIBREF69"
                },
                {
                    "start": 288,
                    "end": 292,
                    "text": "[49]",
                    "ref_id": "BIBREF49"
                },
                {
                    "start": 729,
                    "end": 733,
                    "text": "[28]",
                    "ref_id": "BIBREF28"
                },
                {
                    "start": 1756,
                    "end": 1760,
                    "text": "[49]",
                    "ref_id": "BIBREF49"
                },
                {
                    "start": 1791,
                    "end": 1795,
                    "text": "[28]",
                    "ref_id": "BIBREF28"
                },
                {
                    "start": 1812,
                    "end": 1816,
                    "text": "[49]",
                    "ref_id": "BIBREF49"
                },
                {
                    "start": 2075,
                    "end": 2079,
                    "text": "[28]",
                    "ref_id": "BIBREF28"
                }
            ],
            "ref_spans": [
                {
                    "start": 1168,
                    "end": 1175,
                    "text": "Table 1",
                    "ref_id": "TABREF1"
                }
            ],
            "section": "Structural equation model (SEM)"
        },
        {
            "text": "Altogether, our research model explained 71.6% of the variance in intention to shift to carpooling services (see Table 5 ). The results of the standardized estimates of the path analysis are shown in Table 7 and Fig. 10 . Figure 10 reports only the significant items, while the insignificant items were excluded from the model. Similar to CFA, the structural model has also been checked for model fit with the same indices. The results of the goodness of fit indices are as follows: Σ2/df = 3.317, CFI = 0.936, TLI = 0.961, RMSEA = 0.058, and SRMR = 0.091, confirming good model fit.",
            "cite_spans": [],
            "ref_spans": [
                {
                    "start": 113,
                    "end": 120,
                    "text": "Table 5",
                    "ref_id": "TABREF7"
                },
                {
                    "start": 200,
                    "end": 207,
                    "text": "Table 7",
                    "ref_id": "TABREF10"
                },
                {
                    "start": 212,
                    "end": 219,
                    "text": "Fig. 10",
                    "ref_id": "FIGREF1"
                },
                {
                    "start": 222,
                    "end": 231,
                    "text": "Figure 10",
                    "ref_id": "FIGREF1"
                }
            ],
            "section": "Structural equation model (SEM)"
        },
        {
            "text": "In the developed model of this study, socioeconomic and environmental benefits of carpooling services have the highest probability of 38% followed by partner ",
            "cite_spans": [],
            "ref_spans": [],
            "section": "Structural equation model (SEM)"
        },
        {
            "text": "All studies report some limitations. Acknowledgment of a study's limitations is an opportunity to make suggestions for further researches. Following the same trend, our study also reports some limitations as indicated below. The collected sample size is small which may differ from the results if conducted with a greater sample size of more than 1000. Still, our findings are valid and applicable and can be used as a baseline for future studies. Furthermore, an extension ",
            "cite_spans": [],
            "ref_spans": [],
            "section": "Limitation"
        },
        {
            "text": "Regardless of the limitation discussed above, this research makes novel addition to the current pool of studies concerning carpooling. The outcomes of this study affirmed the validity of the models concerning public acceptance towards carpooling. Car users' intention to use carpooling services is not affected by the constraints of preferring privately owned car (H3-not supported). One of the interesting findings of this study is the non-agreeableness of females (both single and married) towards sharing their rides with males and similarly the case of married males with females. On the other hand, unmarried males are more oriented towards carpooling with female partners. Similar partner matching has always been an issue in carpooling systems. Meanwhile, the model in this study also supports the negative effect of an unknown partner on the intention to use carpooling service. Carpooling service can attract sufficient travelers (61%) if high-occupancy vehicle lanes are provided. Understanding people's acceptance of carpooling scenarios reveals the importance of the plan and assists us with planning methods for successfully implementing the carpooling system in the future. Many proposals can be provided to policy-makers, i.e.:",
            "cite_spans": [],
            "ref_spans": [],
            "section": "Conclusions"
        },
        {
            "text": "Considering the results of Fig. 6 , carpooling use can be encouraged by informing the travelers about carpooling benefits that are reported in this study and by many other researches, i.e., Shaheen et al. [70] Government support is required for the efficient introduction of highoccupancy vehicle lanes for carpooling service in the city as most of the travelers (61%) are willing to shift to carpooling service if high-occupancy vehicle lanes are provided. Based on the results of Fig. 7 , market promotion of carpooling should consider the gender and marital status of the travelers. Various schemes can be incorporated in carpooling services (e.g., free parking lots and prioritizing high occupancy vehicle lanes) to build the practicality of carpooling services for decreasing car ownerships. Concurrently, the local government ought to create strategies to control the increasing car ownership rate (e.g., imposing parking fees on personal car use, car use restrictions, and low emission zones). Overall, through assessing the impacts of attitudinal elements on carpooling selection in a capital city like Islamabad, this study can give directions to other large cities in developing countries. ",
            "cite_spans": [
                {
                    "start": 205,
                    "end": 209,
                    "text": "[70]",
                    "ref_id": "BIBREF70"
                }
            ],
            "ref_spans": [
                {
                    "start": 27,
                    "end": 33,
                    "text": "Fig. 6",
                    "ref_id": "FIGREF5"
                },
                {
                    "start": 482,
                    "end": 488,
                    "text": "Fig. 7",
                    "ref_id": null
                }
            ],
            "section": "Conclusions"
        }
    ],
    "bib_entries": {
        "BIBREF0": {
            "ref_id": "b0",
            "title": "Ridesharing in North America: past, present, and future",
            "authors": [
                {
                    "first": "N",
                    "middle": [
                        "D"
                    ],
                    "last": "Chan",
                    "suffix": ""
                },
                {
                    "first": "S",
                    "middle": [
                        "A"
                    ],
                    "last": "Shaheen",
                    "suffix": ""
                }
            ],
            "year": 2012,
            "venue": "Transp Rev",
            "volume": "32",
            "issn": "1",
            "pages": "93--112",
            "other_ids": {
                "DOI": [
                    "10.1080/01441647.2011.621557"
                ]
            }
        },
        "BIBREF1": {
            "ref_id": "b1",
            "title": "Why do they ride with others? Meta-analysis of factors influencing travelers to carpool",
            "authors": [
                {
                    "first": "L",
                    "middle": [
                        "E"
                    ],
                    "last": "Olsson",
                    "suffix": ""
                },
                {
                    "first": "R",
                    "middle": [],
                    "last": "Maier",
                    "suffix": ""
                },
                {
                    "first": "M",
                    "middle": [],
                    "last": "Friman",
                    "suffix": ""
                }
            ],
            "year": 2019,
            "venue": "Sustain",
            "volume": "11",
            "issn": "8",
            "pages": "",
            "other_ids": {
                "DOI": [
                    "10.3390/su11082414"
                ]
            }
        },
        "BIBREF2": {
            "ref_id": "b2",
            "title": "Ride-sharing: a potential means to increase the quality and availability of motorised trips while discouraging private motor ownership in developing cities?",
            "authors": [
                {
                    "first": "M",
                    "middle": [],
                    "last": "Vanderschuren",
                    "suffix": ""
                },
                {
                    "first": "J",
                    "middle": [],
                    "last": "Baufeldt",
                    "suffix": ""
                }
            ],
            "year": 2018,
            "venue": "Res Transp Econ",
            "volume": "69",
            "issn": "",
            "pages": "607--614",
            "other_ids": {
                "DOI": [
                    "10.1016/j.retrec.2018.03.007"
                ]
            }
        },
        "BIBREF3": {
            "ref_id": "b3",
            "title": "Why do people rideshare? An experimental study",
            "authors": [
                {
                    "first": "S",
                    "middle": [
                        "Y"
                    ],
                    "last": "Amirkiaee",
                    "suffix": ""
                },
                {
                    "first": "N",
                    "middle": [],
                    "last": "Evangelopoulos",
                    "suffix": ""
                }
            ],
            "year": 2018,
            "venue": "Transp Res Part F Traffic Psychol Behav",
            "volume": "55",
            "issn": "",
            "pages": "9--24",
            "other_ids": {
                "DOI": [
                    "10.1016/j.trf.2018.02.025"
                ]
            }
        },
        "BIBREF4": {
            "ref_id": "b4",
            "title": "Ride-sharing: the rise of innovative transportation services",
            "authors": [
                {
                    "first": "S",
                    "middle": [
                        "A Emily"
                    ],
                    "last": "Nicoll",
                    "suffix": ""
                }
            ],
            "year": 2016,
            "venue": "",
            "volume": "",
            "issn": "",
            "pages": "",
            "other_ids": {}
        },
        "BIBREF5": {
            "ref_id": "b5",
            "title": "For which types of trips do French drivers carpool? Motivations underlying carpooling for different types of trips",
            "authors": [
                {
                    "first": "A",
                    "middle": [],
                    "last": "Gheorghiu",
                    "suffix": ""
                },
                {
                    "first": "P",
                    "middle": [],
                    "last": "Delhomme",
                    "suffix": ""
                }
            ],
            "year": 2018,
            "venue": "Transp Res Part A Policy Pract",
            "volume": "113",
            "issn": "11",
            "pages": "460--475",
            "other_ids": {
                "DOI": [
                    "10.1016/j.tra.2018.05.002"
                ]
            }
        },
        "BIBREF6": {
            "ref_id": "b6",
            "title": "What encourages people to carpool? An evaluation of factors with meta-analysis",
            "authors": [
                {
                    "first": "J",
                    "middle": [
                        "G"
                    ],
                    "last": "Neoh",
                    "suffix": ""
                },
                {
                    "first": "M",
                    "middle": [],
                    "last": "Chipulu",
                    "suffix": ""
                },
                {
                    "first": "A",
                    "middle": [],
                    "last": "Marshall",
                    "suffix": ""
                }
            ],
            "year": 2017,
            "venue": "Transportation (Amst)",
            "volume": "44",
            "issn": "2",
            "pages": "423--447",
            "other_ids": {
                "DOI": [
                    "10.1007/s11116-015-9661-7"
                ]
            }
        },
        "BIBREF7": {
            "ref_id": "b7",
            "title": "Parking strategic plan: car-sharing: where and how it succeeds",
            "authors": [
                {
                    "first": "A",
                    "middle": [],
                    "last": "Millard-Ball",
                    "suffix": ""
                },
                {
                    "first": "M",
                    "middle": [],
                    "last": "Gail",
                    "suffix": ""
                },
                {
                    "first": "Ter",
                    "middle": [],
                    "last": "Schure",
                    "suffix": ""
                },
                {
                    "first": "J",
                    "middle": [],
                    "last": "",
                    "suffix": ""
                }
            ],
            "year": 2005,
            "venue": "",
            "volume": "",
            "issn": "",
            "pages": "",
            "other_ids": {}
        },
        "BIBREF8": {
            "ref_id": "b8",
            "title": "Comparing French carpoolers and non-carpoolers: which factors contribute the most to carpooling?",
            "authors": [
                {
                    "first": "P",
                    "middle": [],
                    "last": "Delhomme",
                    "suffix": ""
                },
                {
                    "first": "A",
                    "middle": [],
                    "last": "Gheorghiu",
                    "suffix": ""
                }
            ],
            "year": 2016,
            "venue": "Transp Res Part D Transp Environ",
            "volume": "42",
            "issn": "",
            "pages": "1--15",
            "other_ids": {
                "DOI": [
                    "10.1016/j.trd.2015.10.014"
                ]
            }
        },
        "BIBREF9": {
            "ref_id": "b9",
            "title": "Putting the sharing economy into perspective",
            "authors": [
                {
                    "first": "K",
                    "middle": [],
                    "last": "Frenken",
                    "suffix": ""
                },
                {
                    "first": "J",
                    "middle": [],
                    "last": "Schor",
                    "suffix": ""
                }
            ],
            "year": 2017,
            "venue": "Environ Innov Soc Transitions",
            "volume": "23",
            "issn": "",
            "pages": "3--10",
            "other_ids": {
                "DOI": [
                    "10.1016/j.eist.2017.01.003"
                ]
            }
        },
        "BIBREF10": {
            "ref_id": "b10",
            "title": "Carpooling: travelers' perceptions from a big data analysis",
            "authors": [
                {
                    "first": "M",
                    "middle": [
                        "V"
                    ],
                    "last": "Ciasullo",
                    "suffix": ""
                },
                {
                    "first": "O",
                    "middle": [],
                    "last": "Troisi",
                    "suffix": ""
                },
                {
                    "first": "F",
                    "middle": [],
                    "last": "Loia",
                    "suffix": ""
                },
                {
                    "first": "G",
                    "middle": [],
                    "last": "Maione",
                    "suffix": ""
                }
            ],
            "year": 2018,
            "venue": "TQM J",
            "volume": "30",
            "issn": "5",
            "pages": "554--571",
            "other_ids": {
                "DOI": [
                    "10.1108/TQM-11-2017-0156"
                ]
            }
        },
        "BIBREF11": {
            "ref_id": "b11",
            "title": "Minimizing the average arriving distance in carpooling",
            "authors": [
                {
                    "first": "T",
                    "middle": [],
                    "last": "Zhao",
                    "suffix": ""
                },
                {
                    "first": "Y",
                    "middle": [],
                    "last": "Yang",
                    "suffix": ""
                },
                {
                    "first": "E",
                    "middle": [],
                    "last": "Wang",
                    "suffix": ""
                }
            ],
            "year": 2020,
            "venue": "",
            "volume": "16",
            "issn": "",
            "pages": "",
            "other_ids": {
                "DOI": [
                    "10.1177/1550147719899369"
                ]
            }
        },
        "BIBREF12": {
            "ref_id": "b12",
            "title": "MaaS for the suburban market: incorporating carpooling in the mix",
            "authors": [
                {
                    "first": "S",
                    "middle": [],
                    "last": "Wright",
                    "suffix": ""
                },
                {
                    "first": "J",
                    "middle": [
                        "D"
                    ],
                    "last": "Nelson",
                    "suffix": ""
                },
                {
                    "first": "C",
                    "middle": [
                        "D"
                    ],
                    "last": "Cottrill",
                    "suffix": ""
                }
            ],
            "year": 2019,
            "venue": "",
            "volume": "131",
            "issn": "",
            "pages": "206--218",
            "other_ids": {
                "DOI": [
                    "10.1016/j.tra.2019.09.034"
                ]
            }
        },
        "BIBREF13": {
            "ref_id": "b13",
            "title": "VANPOOLING: the three major approaches",
            "authors": [],
            "year": 1979,
            "venue": "",
            "volume": "",
            "issn": "",
            "pages": "",
            "other_ids": {}
        },
        "BIBREF14": {
            "ref_id": "b14",
            "title": "Evaluation methods for the impacts of shared mobility: classification and critical review",
            "authors": [
                {
                    "first": "A",
                    "middle": [],
                    "last": "Roukouni",
                    "suffix": ""
                },
                {
                    "first": "Gha",
                    "middle": [],
                    "last": "De Correia",
                    "suffix": ""
                }
            ],
            "year": 2020,
            "venue": "Sustain",
            "volume": "12",
            "issn": "24",
            "pages": "1--22",
            "other_ids": {
                "DOI": [
                    "10.3390/su122410504"
                ]
            }
        },
        "BIBREF15": {
            "ref_id": "b15",
            "title": "Traffic congestion -the problem and how to deal with it?",
            "authors": [
                {
                    "first": "A",
                    "middle": [],
                    "last": "Bull",
                    "suffix": ""
                }
            ],
            "year": 2004,
            "venue": "",
            "volume": "",
            "issn": "",
            "pages": "",
            "other_ids": {}
        },
        "BIBREF16": {
            "ref_id": "b16",
            "title": "Islamabad population 2021",
            "authors": [],
            "year": 2021,
            "venue": "World Population Review",
            "volume": "",
            "issn": "",
            "pages": "",
            "other_ids": {}
        },
        "BIBREF17": {
            "ref_id": "b17",
            "title": "Author: Sustainable transportation: problems and solutions an introduction to sustainable transportation: policy, planning, and implementation reviewed by Andrea Broaddus",
            "authors": [
                {
                    "first": "S",
                    "middle": [
                        "T"
                    ],
                    "last": "Policy",
                    "suffix": ""
                }
            ],
            "year": 2011,
            "venue": "",
            "volume": "",
            "issn": "",
            "pages": "",
            "other_ids": {}
        },
        "BIBREF18": {
            "ref_id": "b18",
            "title": "Handbook of sustainable travel",
            "authors": [
                {
                    "first": "Tommy",
                    "middle": [],
                    "last": "Garling",
                    "suffix": ""
                },
                {
                    "first": "M",
                    "middle": [
                        "F"
                    ],
                    "last": "Ettema",
                    "suffix": ""
                },
                {
                    "first": "D",
                    "middle": [],
                    "last": "",
                    "suffix": ""
                }
            ],
            "year": 2014,
            "venue": "",
            "volume": "",
            "issn": "",
            "pages": "",
            "other_ids": {
                "DOI": [
                    "10.1007/978-94-007-7034-8"
                ]
            }
        },
        "BIBREF19": {
            "ref_id": "b19",
            "title": "Who is interested in carpooling and why: the importance of individual characteristics, role preferences and carpool markets",
            "authors": [
                {
                    "first": "Y",
                    "middle": [],
                    "last": "Park",
                    "suffix": ""
                },
                {
                    "first": "N",
                    "middle": [],
                    "last": "Chen",
                    "suffix": ""
                },
                {
                    "first": "G",
                    "middle": [],
                    "last": "Akar",
                    "suffix": ""
                }
            ],
            "year": 2018,
            "venue": "Transp Res Rec",
            "volume": "2672",
            "issn": "8",
            "pages": "708--718",
            "other_ids": {
                "DOI": [
                    "10.1177/0361198118756883"
                ]
            }
        },
        "BIBREF20": {
            "ref_id": "b20",
            "title": "Ridesharing: the state-of-the-art and future directions",
            "authors": [
                {
                    "first": "M",
                    "middle": [],
                    "last": "Furuhata",
                    "suffix": ""
                },
                {
                    "first": "M",
                    "middle": [],
                    "last": "Dessouky",
                    "suffix": ""
                },
                {
                    "first": "F",
                    "middle": [],
                    "last": "Ordóñez",
                    "suffix": ""
                },
                {
                    "first": "M",
                    "middle": [
                        "E"
                    ],
                    "last": "Brunet",
                    "suffix": ""
                },
                {
                    "first": "X",
                    "middle": [],
                    "last": "Wang",
                    "suffix": ""
                },
                {
                    "first": "S",
                    "middle": [],
                    "last": "Koenig",
                    "suffix": ""
                }
            ],
            "year": 2013,
            "venue": "Transp Res Part B Methodol",
            "volume": "57",
            "issn": "",
            "pages": "28--46",
            "other_ids": {
                "DOI": [
                    "10.1016/j.trb.2013.08.012"
                ]
            }
        },
        "BIBREF21": {
            "ref_id": "b21",
            "title": "Increasing the flexibility of legacy systems",
            "authors": [
                {
                    "first": "W",
                    "middle": [
                        "L"
                    ],
                    "last": "Garrison",
                    "suffix": ""
                },
                {
                    "first": "B",
                    "middle": [],
                    "last": "Wellar",
                    "suffix": ""
                },
                {
                    "first": "R",
                    "middle": [],
                    "last": "Mackinnon",
                    "suffix": ""
                },
                {
                    "first": "W",
                    "middle": [
                        "R"
                    ],
                    "last": "Black",
                    "suffix": ""
                },
                {
                    "first": "A",
                    "middle": [],
                    "last": "Getis",
                    "suffix": ""
                }
            ],
            "year": 2011,
            "venue": "Int J Appl Geospatial Res",
            "volume": "2",
            "issn": "2",
            "pages": "39--55",
            "other_ids": {
                "DOI": [
                    "10.4018/jagr.2011040104"
                ]
            }
        },
        "BIBREF23": {
            "ref_id": "b23",
            "title": "Impact of carpooling on fuel saving in urban transportation: case study of Tehran",
            "authors": [
                {
                    "first": "S",
                    "middle": [],
                    "last": "Seyedabrishami",
                    "suffix": ""
                },
                {
                    "first": "A",
                    "middle": [],
                    "last": "Mamdoohi",
                    "suffix": ""
                },
                {
                    "first": "A",
                    "middle": [],
                    "last": "Barzegar",
                    "suffix": ""
                },
                {
                    "first": "S",
                    "middle": [],
                    "last": "Hasanpour",
                    "suffix": ""
                }
            ],
            "year": 2012,
            "venue": "Procedia Soc Behav Sci",
            "volume": "54",
            "issn": "",
            "pages": "323--331",
            "other_ids": {
                "DOI": [
                    "10.1016/j.sbspro.2012.09.751"
                ]
            }
        },
        "BIBREF24": {
            "ref_id": "b24",
            "title": "A decision-support system for the car pooling problem",
            "authors": [
                {
                    "first": "R",
                    "middle": [],
                    "last": "Manzini",
                    "suffix": ""
                },
                {
                    "first": "A",
                    "middle": [],
                    "last": "Pareschi",
                    "suffix": ""
                }
            ],
            "year": 2012,
            "venue": "J Transp Technol",
            "volume": "02",
            "issn": "02",
            "pages": "85--101",
            "other_ids": {
                "DOI": [
                    "10.4236/jtts.2012.22011"
                ]
            }
        },
        "BIBREF25": {
            "ref_id": "b25",
            "title": "People's behavioral intentions towards public transport in Lahore: role of situational constraints, mobility restrictions and incentives",
            "authors": [
                {
                    "first": "M",
                    "middle": [
                        "A"
                    ],
                    "last": "Javid",
                    "suffix": ""
                },
                {
                    "first": "T",
                    "middle": [],
                    "last": "Okamura",
                    "suffix": ""
                },
                {
                    "first": "F",
                    "middle": [],
                    "last": "Nakamura",
                    "suffix": ""
                },
                {
                    "first": "S",
                    "middle": [],
                    "last": "Tanaka",
                    "suffix": ""
                },
                {
                    "first": "R",
                    "middle": [],
                    "last": "Wang",
                    "suffix": ""
                }
            ],
            "year": 2016,
            "venue": "KSCE J Civ Eng",
            "volume": "20",
            "issn": "1",
            "pages": "401--410",
            "other_ids": {
                "DOI": [
                    "10.1007/s12205-015-1123-4"
                ]
            }
        },
        "BIBREF26": {
            "ref_id": "b26",
            "title": "Understanding attitudes towards public transport and private car: a qualitative study",
            "authors": [
                {
                    "first": "G",
                    "middle": [],
                    "last": "Beirão",
                    "suffix": ""
                },
                {
                    "first": "Sarsfield",
                    "middle": [],
                    "last": "Cabral",
                    "suffix": ""
                },
                {
                    "first": "J",
                    "middle": [
                        "A"
                    ],
                    "last": "",
                    "suffix": ""
                }
            ],
            "year": 2007,
            "venue": "Transp Policy",
            "volume": "14",
            "issn": "6",
            "pages": "478--489",
            "other_ids": {
                "DOI": [
                    "10.1016/j.tranpol.2007.04.009"
                ]
            }
        },
        "BIBREF27": {
            "ref_id": "b27",
            "title": "Consumer lifestyle approach to US energy use and the related CO 2 emissions",
            "authors": [
                {
                    "first": "S",
                    "middle": [],
                    "last": "Bin",
                    "suffix": ""
                },
                {
                    "first": "H",
                    "middle": [],
                    "last": "Dowlatabadi",
                    "suffix": ""
                }
            ],
            "year": 2005,
            "venue": "Energy Policy",
            "volume": "33",
            "issn": "2",
            "pages": "210--216",
            "other_ids": {
                "DOI": [
                    "10.1016/S0301-4215(03)00210-6"
                ]
            }
        },
        "BIBREF28": {
            "ref_id": "b28",
            "title": "Using latent attitudinal variables estimated through a structural equations model for understanding carpooling propensity",
            "authors": [
                {
                    "first": "G",
                    "middle": [
                        "H"
                    ],
                    "last": "De Almeida Correia",
                    "suffix": ""
                },
                {
                    "first": "J",
                    "middle": [],
                    "last": "De Abreu E Silva",
                    "suffix": ""
                },
                {
                    "first": "J",
                    "middle": [
                        "M"
                    ],
                    "last": "Viegas",
                    "suffix": ""
                }
            ],
            "year": 2013,
            "venue": "Transp Plan Technol",
            "volume": "36",
            "issn": "6",
            "pages": "499--519",
            "other_ids": {
                "DOI": [
                    "10.1080/03081060.2013.830894"
                ]
            }
        },
        "BIBREF29": {
            "ref_id": "b29",
            "title": "Moving towards sustainability? Mobility styles, attitudes and individual travel behaviour",
            "authors": [
                {
                    "first": "J",
                    "middle": [],
                    "last": "Prillwitz",
                    "suffix": ""
                },
                {
                    "first": "S",
                    "middle": [],
                    "last": "Barr",
                    "suffix": ""
                }
            ],
            "year": 2011,
            "venue": "J Transp Geogr",
            "volume": "19",
            "issn": "6",
            "pages": "1590--1600",
            "other_ids": {
                "DOI": [
                    "10.1016/j.jtrangeo.2011.06.011"
                ]
            }
        },
        "BIBREF30": {
            "ref_id": "b30",
            "title": "Complacent car addicts'; or 'aspiring environmentalists'? Identifying travel behaviour segments using attitude theory",
            "authors": [
                {
                    "first": "J",
                    "middle": [],
                    "last": "Anable",
                    "suffix": ""
                }
            ],
            "year": 2005,
            "venue": "Transp Policy",
            "volume": "12",
            "issn": "1",
            "pages": "65--78",
            "other_ids": {
                "DOI": [
                    "10.1016/j.tranpol.2004.11.004"
                ]
            }
        },
        "BIBREF31": {
            "ref_id": "b31",
            "title": "Demand for carpooling in the UK",
            "authors": [
                {
                    "first": "Hcr",
                    "middle": [],
                    "last": "Sheldon",
                    "suffix": ""
                }
            ],
            "year": 1999,
            "venue": "Transp Res Lab",
            "volume": "413",
            "issn": "",
            "pages": "49--64",
            "other_ids": {}
        },
        "BIBREF32": {
            "ref_id": "b32",
            "title": "Who chooses to carpool and why? Examination of Texas carpoolers",
            "authors": [
                {
                    "first": "J",
                    "middle": [],
                    "last": "Li",
                    "suffix": ""
                },
                {
                    "first": "P",
                    "middle": [],
                    "last": "Embry",
                    "suffix": ""
                },
                {
                    "first": "S",
                    "middle": [
                        "P"
                    ],
                    "last": "Mattingly",
                    "suffix": ""
                },
                {
                    "first": "K",
                    "middle": [
                        "F"
                    ],
                    "last": "Sadabadi",
                    "suffix": ""
                },
                {
                    "first": "I",
                    "middle": [],
                    "last": "Rasmidatta",
                    "suffix": ""
                },
                {
                    "first": "M",
                    "middle": [
                        "W"
                    ],
                    "last": "Burris",
                    "suffix": ""
                }
            ],
            "year": 2007,
            "venue": "Transp Res Rec",
            "volume": "2021",
            "issn": "",
            "pages": "110--117",
            "other_ids": {
                "DOI": [
                    "10.3141/2021-13"
                ]
            }
        },
        "BIBREF33": {
            "ref_id": "b33",
            "title": "Flexible carpooling to transit stations",
            "authors": [
                {
                    "first": "P",
                    "middle": [],
                    "last": "Minett",
                    "suffix": ""
                }
            ],
            "year": 2013,
            "venue": "",
            "volume": "",
            "issn": "",
            "pages": "",
            "other_ids": {}
        },
        "BIBREF34": {
            "ref_id": "b34",
            "title": "Carpooling and carpool clubs: clarifying concepts and assessing value enhancement possibilities through a stated preference web survey in",
            "authors": [
                {
                    "first": "G",
                    "middle": [],
                    "last": "Correia",
                    "suffix": ""
                },
                {
                    "first": "J",
                    "middle": [
                        "M"
                    ],
                    "last": "Viegas",
                    "suffix": ""
                }
            ],
            "year": 2011,
            "venue": "Transp Res Part A Policy Pract",
            "volume": "45",
            "issn": "2",
            "pages": "81--90",
            "other_ids": {
                "DOI": [
                    "10.1016/j.tra.2010.11.001"
                ]
            }
        },
        "BIBREF35": {
            "ref_id": "b35",
            "title": "Why do people carpool: results from a Swiss survey",
            "authors": [
                {
                    "first": "F",
                    "middle": [],
                    "last": "Ciari",
                    "suffix": ""
                }
            ],
            "year": 2012,
            "venue": "",
            "volume": "",
            "issn": "",
            "pages": "",
            "other_ids": {
                "DOI": [
                    "10.3929/ethz-b-000041315"
                ]
            }
        },
        "BIBREF36": {
            "ref_id": "b36",
            "title": "Casual carpooling scan report",
            "authors": [
                {
                    "first": "M",
                    "middle": [],
                    "last": "Burris",
                    "suffix": ""
                }
            ],
            "year": 2014,
            "venue": "Casual Carpooling An Anal. its Mech. Merits",
            "volume": "",
            "issn": "",
            "pages": "",
            "other_ids": {}
        },
        "BIBREF37": {
            "ref_id": "b37",
            "title": "Investigation of factors that stimulate car drivers to change from car to carpooling in city center oriented work trips",
            "authors": [
                {
                    "first": "P",
                    "middle": [],
                    "last": "Van Der Waerden",
                    "suffix": ""
                },
                {
                    "first": "A",
                    "middle": [],
                    "last": "Lem",
                    "suffix": ""
                },
                {
                    "first": "W",
                    "middle": [],
                    "last": "Schaefer",
                    "suffix": ""
                }
            ],
            "year": 2015,
            "venue": "Transp Res Procedia",
            "volume": "10",
            "issn": "",
            "pages": "335--344",
            "other_ids": {
                "DOI": [
                    "10.1016/j.trpro.2015.09.083"
                ]
            }
        },
        "BIBREF38": {
            "ref_id": "b38",
            "title": "A study of carpooling behaviour using a stated preference web survey in selected cities of India",
            "authors": [
                {
                    "first": "S",
                    "middle": [],
                    "last": "Malodia",
                    "suffix": ""
                },
                {
                    "first": "H",
                    "middle": [],
                    "last": "Singla",
                    "suffix": ""
                }
            ],
            "year": 2016,
            "venue": "Transp Plan Technol",
            "volume": "39",
            "issn": "5",
            "pages": "538--550",
            "other_ids": {
                "DOI": [
                    "10.1080/03081060.2016.1174368"
                ]
            }
        },
        "BIBREF39": {
            "ref_id": "b39",
            "title": "Ridesharing as a green commute alternative: a campus case study",
            "authors": [
                {
                    "first": "S",
                    "middle": [],
                    "last": "Erdoğan",
                    "suffix": ""
                },
                {
                    "first": "C",
                    "middle": [],
                    "last": "Cirillo",
                    "suffix": ""
                },
                {
                    "first": "J",
                    "middle": [
                        "M"
                    ],
                    "last": "Tremblay",
                    "suffix": ""
                }
            ],
            "year": 2015,
            "venue": "Int J Sustain Transp",
            "volume": "9",
            "issn": "5",
            "pages": "377--388",
            "other_ids": {
                "DOI": [
                    "10.1080/15568318.2013.800619"
                ]
            }
        },
        "BIBREF40": {
            "ref_id": "b40",
            "title": "Trying to increase carpooling at a major U.S. university: a survey and an intervention",
            "authors": [
                {
                    "first": "S",
                    "middle": [
                        "A"
                    ],
                    "last": "Kaplowitz",
                    "suffix": ""
                },
                {
                    "first": "A",
                    "middle": [],
                    "last": "Slabosky",
                    "suffix": ""
                }
            ],
            "year": 2018,
            "venue": "Sustain (United States)",
            "volume": "11",
            "issn": "2",
            "pages": "74--80",
            "other_ids": {
                "DOI": [
                    "10.1089/sus.2017.0020"
                ]
            }
        },
        "BIBREF41": {
            "ref_id": "b41",
            "title": "Carpooling and the economics of self-driving cars",
            "authors": [
                {
                    "first": "M",
                    "middle": [],
                    "last": "Ostrovsky",
                    "suffix": ""
                }
            ],
            "year": 2019,
            "venue": "",
            "volume": "",
            "issn": "",
            "pages": "581--582",
            "other_ids": {}
        },
        "BIBREF42": {
            "ref_id": "b42",
            "title": "Making car pooling work-myths and where to start",
            "authors": [
                {
                    "first": "B",
                    "middle": [],
                    "last": "Srivastava",
                    "suffix": ""
                }
            ],
            "year": 2012,
            "venue": "Intell. Transp. Syst. World Congr. ITS",
            "volume": "",
            "issn": "",
            "pages": "",
            "other_ids": {}
        },
        "BIBREF43": {
            "ref_id": "b43",
            "title": "Toward an understanding of transnationalism and gender",
            "authors": [
                {
                    "first": "K",
                    "middle": [
                        "A"
                    ],
                    "last": "Soltys",
                    "suffix": ""
                }
            ],
            "year": 2012,
            "venue": "Gend Hum Rights",
            "volume": "",
            "issn": "",
            "pages": "",
            "other_ids": {
                "DOI": [
                    "10.1093/acprof:oso/9780199260911.003.0008"
                ]
            }
        },
        "BIBREF44": {
            "ref_id": "b44",
            "title": "Increasing carpooling in Vermont: opportunities and obstacles",
            "authors": [
                {
                    "first": "R",
                    "middle": [],
                    "last": "Watts",
                    "suffix": ""
                }
            ],
            "year": 2010,
            "venue": "Univ Vermont Transp Res Cent",
            "volume": "1",
            "issn": "10",
            "pages": "3--22",
            "other_ids": {}
        },
        "BIBREF45": {
            "ref_id": "b45",
            "title": "Using the multilevel random effect model to analyze the behavior of carpool users in different cities",
            "authors": [
                {
                    "first": "T",
                    "middle": [
                        "Y"
                    ],
                    "last": "Chen",
                    "suffix": ""
                },
                {
                    "first": "R",
                    "middle": [
                        "C"
                    ],
                    "last": "Jou",
                    "suffix": ""
                },
                {
                    "first": "Y",
                    "middle": [
                        "C"
                    ],
                    "last": "Chiu",
                    "suffix": ""
                }
            ],
            "year": 2021,
            "venue": "Sustain",
            "volume": "13",
            "issn": "2",
            "pages": "1--13",
            "other_ids": {
                "DOI": [
                    "10.3390/su13020937"
                ]
            }
        },
        "BIBREF46": {
            "ref_id": "b46",
            "title": "The effects of carpooling on potential car Buyers' purchasing intention: a case study of Jinan",
            "authors": [
                {
                    "first": "Z",
                    "middle": [],
                    "last": "Mou",
                    "suffix": ""
                },
                {
                    "first": "W",
                    "middle": [],
                    "last": "Liang",
                    "suffix": ""
                },
                {
                    "first": "Y",
                    "middle": [],
                    "last": "Chen",
                    "suffix": ""
                },
                {
                    "first": "H",
                    "middle": [],
                    "last": "Zhang",
                    "suffix": ""
                },
                {
                    "first": "K",
                    "middle": [],
                    "last": "Yan",
                    "suffix": ""
                },
                {
                    "first": "X",
                    "middle": [],
                    "last": "Li",
                    "suffix": ""
                }
            ],
            "year": 2020,
            "venue": "Case Stud Transp Policy",
            "volume": "8",
            "issn": "4",
            "pages": "1285--1294",
            "other_ids": {
                "DOI": [
                    "10.1016/j.cstp.2020.08.008"
                ]
            }
        },
        "BIBREF47": {
            "ref_id": "b47",
            "title": "Sustainable commuting: results from a social approach and international evidence on carpooling",
            "authors": [
                {
                    "first": "J",
                    "middle": [
                        "A"
                    ],
                    "last": "Molina",
                    "suffix": ""
                },
                {
                    "first": "Ignacio",
                    "middle": [],
                    "last": "Giménez-Nadal",
                    "suffix": ""
                },
                {
                    "first": "J",
                    "middle": [],
                    "last": "Velilla",
                    "suffix": ""
                },
                {
                    "first": "J",
                    "middle": [],
                    "last": "",
                    "suffix": ""
                }
            ],
            "year": 2020,
            "venue": "Sustain",
            "volume": "12",
            "issn": "22",
            "pages": "1--12",
            "other_ids": {
                "DOI": [
                    "10.3390/su12229587"
                ]
            }
        },
        "BIBREF48": {
            "ref_id": "b48",
            "title": "An empirical investigation into carpooling behaviour for sustainability",
            "authors": [
                {
                    "first": "S",
                    "middle": [],
                    "last": "Dinesh",
                    "suffix": ""
                },
                {
                    "first": "G",
                    "middle": [],
                    "last": "Rejikumar",
                    "suffix": ""
                },
                {
                    "first": "G",
                    "middle": [
                        "S"
                    ],
                    "last": "Sisodia",
                    "suffix": ""
                }
            ],
            "year": 2021,
            "venue": "Transp Res Part F Traffic Psychol Behav",
            "volume": "77",
            "issn": "",
            "pages": "181--196",
            "other_ids": {
                "DOI": [
                    "10.1016/j.trf.2021.01.005"
                ]
            }
        },
        "BIBREF49": {
            "ref_id": "b49",
            "title": "Travelers' attitudes toward carpooling in Lahore: motives and constraints",
            "authors": [
                {
                    "first": "M",
                    "middle": [],
                    "last": "Ashraf",
                    "suffix": ""
                },
                {
                    "first": "J",
                    "middle": [],
                    "last": "Tahir",
                    "suffix": ""
                },
                {
                    "first": "M",
                    "middle": [],
                    "last": "Hafiz",
                    "suffix": ""
                },
                {
                    "first": "M",
                    "middle": [],
                    "last": "Asif",
                    "suffix": ""
                }
            ],
            "year": 2017,
            "venue": "J Mod Transp",
            "volume": "25",
            "issn": "4",
            "pages": "268--278",
            "other_ids": {
                "DOI": [
                    "10.1007/s40534-017-0135-9"
                ]
            }
        },
        "BIBREF50": {
            "ref_id": "b50",
            "title": "Evaluation of interpersonal influences in the formation and promotion of carpools",
            "authors": [
                {
                    "first": "I",
                    "middle": [
                        "P"
                    ],
                    "last": "Levin",
                    "suffix": ""
                },
                {
                    "first": "M",
                    "middle": [
                        "J"
                    ],
                    "last": "Gray",
                    "suffix": ""
                },
                {
                    "first": "I",
                    "middle": [],
                    "last": "City",
                    "suffix": ""
                }
            ],
            "year": 1974,
            "venue": "",
            "volume": "",
            "issn": "",
            "pages": "35--39",
            "other_ids": {}
        },
        "BIBREF51": {
            "ref_id": "b51",
            "title": "Park and pool lots' impact on promoting shared mobility and carpooling on highways: the case of",
            "authors": [
                {
                    "first": "R",
                    "middle": [],
                    "last": "Rijavec",
                    "suffix": ""
                },
                {
                    "first": "N",
                    "middle": [],
                    "last": "Dadashzadeh",
                    "suffix": ""
                },
                {
                    "first": "M",
                    "middle": [],
                    "last": "Žura",
                    "suffix": ""
                },
                {
                    "first": "R",
                    "middle": [],
                    "last": "Marsetič",
                    "suffix": ""
                }
            ],
            "year": 2020,
            "venue": "Slovenia. Sustain",
            "volume": "12",
            "issn": "8",
            "pages": "",
            "other_ids": {
                "DOI": [
                    "10.3390/SU12083188"
                ]
            }
        },
        "BIBREF52": {
            "ref_id": "b52",
            "title": "Using latent attitudinal variables for measuring carpooling, 12th World Conf",
            "authors": [
                {
                    "first": "A",
                    "middle": [
                        "E"
                    ],
                    "last": "Silva",
                    "suffix": ""
                }
            ],
            "year": 2010,
            "venue": "Transp. Res",
            "volume": "",
            "issn": "",
            "pages": "1--23",
            "other_ids": {}
        },
        "BIBREF53": {
            "ref_id": "b53",
            "title": "Attraction of bus rapid transit (BRT) for car and bike owners",
            "authors": [
                {
                    "first": "M",
                    "middle": [
                        "M"
                    ],
                    "last": "Abid",
                    "suffix": ""
                }
            ],
            "year": 2020,
            "venue": "",
            "volume": "9",
            "issn": "",
            "pages": "1--21",
            "other_ids": {
                "DOI": [
                    "10.2478/rjti-2020-0001"
                ]
            }
        },
        "BIBREF54": {
            "ref_id": "b54",
            "title": "Sampling techniques",
            "authors": [
                {
                    "first": "W",
                    "middle": [
                        "G"
                    ],
                    "last": "Cochran",
                    "suffix": ""
                }
            ],
            "year": 1977,
            "venue": "",
            "volume": "",
            "issn": "",
            "pages": "",
            "other_ids": {}
        },
        "BIBREF55": {
            "ref_id": "b55",
            "title": "Guidelines -Gaskination's StatWiki -Data screening",
            "authors": [
                {
                    "first": "J",
                    "middle": [],
                    "last": "Gaskin",
                    "suffix": ""
                }
            ],
            "year": 2021,
            "venue": "",
            "volume": "",
            "issn": "",
            "pages": "",
            "other_ids": {}
        },
        "BIBREF56": {
            "ref_id": "b56",
            "title": "Applied statistics using SPSS, STATISTICA, MATLAB and R, 2nd edn",
            "authors": [
                {
                    "first": "M",
                    "middle": [],
                    "last": "De Sá",
                    "suffix": ""
                },
                {
                    "first": "P",
                    "middle": [],
                    "last": "Joaquim",
                    "suffix": ""
                }
            ],
            "year": 2007,
            "venue": "",
            "volume": "",
            "issn": "",
            "pages": "",
            "other_ids": {}
        },
        "BIBREF57": {
            "ref_id": "b57",
            "title": "Structural equation modeling with AMOS: basic concepts, applications, and programming, 2nd edn",
            "authors": [
                {
                    "first": "B",
                    "middle": [
                        "M"
                    ],
                    "last": "Byrne",
                    "suffix": ""
                }
            ],
            "year": 2013,
            "venue": "",
            "volume": "",
            "issn": "",
            "pages": "",
            "other_ids": {
                "DOI": [
                    "10.4324/9780203805534"
                ]
            }
        },
        "BIBREF58": {
            "ref_id": "b58",
            "title": "Gaskination's StatWiki",
            "authors": [
                {
                    "first": "James",
                    "middle": [],
                    "last": "Gaskin",
                    "suffix": ""
                }
            ],
            "year": 2021,
            "venue": "Stats Tools Package",
            "volume": "",
            "issn": "",
            "pages": "",
            "other_ids": {}
        },
        "BIBREF59": {
            "ref_id": "b59",
            "title": "Reliability analysis -statistical solutions",
            "authors": [
                {
                    "first": "J",
                    "middle": [],
                    "last": "Lani",
                    "suffix": ""
                }
            ],
            "year": 2021,
            "venue": "",
            "volume": "",
            "issn": "",
            "pages": "",
            "other_ids": {}
        },
        "BIBREF60": {
            "ref_id": "b60",
            "title": "Understanding a widely misunderstood statistic: Cronbach's alpha, Underst. A Widely Misunderstood Stat. Cronbach's α",
            "authors": [
                {
                    "first": "N",
                    "middle": [
                        "L"
                    ],
                    "last": "Ritter",
                    "suffix": ""
                }
            ],
            "year": 2010,
            "venue": "",
            "volume": "",
            "issn": "",
            "pages": "1--17",
            "other_ids": {}
        },
        "BIBREF61": {
            "ref_id": "b61",
            "title": "Stephanie Glen Cronbach's alpha: simple definition, use and interpretation -statistics how to",
            "authors": [],
            "year": 2021,
            "venue": "",
            "volume": "",
            "issn": "",
            "pages": "",
            "other_ids": {}
        },
        "BIBREF62": {
            "ref_id": "b62",
            "title": "The four types of validity",
            "authors": [
                {
                    "first": "Fiona",
                    "middle": [],
                    "last": "Middleton",
                    "suffix": ""
                }
            ],
            "year": 2019,
            "venue": "",
            "volume": "",
            "issn": "",
            "pages": "",
            "other_ids": {}
        },
        "BIBREF63": {
            "ref_id": "b63",
            "title": "On the evaluation of structural equation models",
            "authors": [
                {
                    "first": "R",
                    "middle": [
                        "P"
                    ],
                    "last": "Bagozzi",
                    "suffix": ""
                },
                {
                    "first": "Y",
                    "middle": [],
                    "last": "Yi",
                    "suffix": ""
                }
            ],
            "year": 1988,
            "venue": "J Acad Mark Sci",
            "volume": "16",
            "issn": "1",
            "pages": "74--94",
            "other_ids": {
                "DOI": [
                    "10.1007/BF02723327"
                ]
            }
        },
        "BIBREF64": {
            "ref_id": "b64",
            "title": "Structural equation models with unobservable variables and measurement error: algebra and statistics",
            "authors": [
                {
                    "first": "C",
                    "middle": [],
                    "last": "Fornell",
                    "suffix": ""
                },
                {
                    "first": "D",
                    "middle": [
                        "F"
                    ],
                    "last": "Larcker",
                    "suffix": ""
                }
            ],
            "year": 1981,
            "venue": "J Mark Res",
            "volume": "18",
            "issn": "3",
            "pages": "382--388",
            "other_ids": {
                "DOI": [
                    "10.1177/002224378101800313"
                ]
            }
        },
        "BIBREF65": {
            "ref_id": "b65",
            "title": "SEM series part 5b: validating the measurement model",
            "authors": [
                {
                    "first": "James",
                    "middle": [],
                    "last": "Gaskin",
                    "suffix": ""
                }
            ],
            "year": 2013,
            "venue": "",
            "volume": "",
            "issn": "",
            "pages": "",
            "other_ids": {}
        },
        "BIBREF66": {
            "ref_id": "b66",
            "title": "An easy approach to exploratory factor analysis: marketing perspective",
            "authors": [
                {
                    "first": "Ul",
                    "middle": [],
                    "last": "Hadia",
                    "suffix": ""
                },
                {
                    "first": "N",
                    "middle": [],
                    "last": "Abdullah",
                    "suffix": ""
                },
                {
                    "first": "N",
                    "middle": [],
                    "last": "Sentosa",
                    "suffix": ""
                },
                {
                    "first": "I",
                    "middle": [],
                    "last": "",
                    "suffix": ""
                }
            ],
            "year": 2016,
            "venue": "J Educ Soc Res",
            "volume": "",
            "issn": "",
            "pages": "",
            "other_ids": {
                "DOI": [
                    "10.5901/jesr.2016.v6n1p215"
                ]
            }
        },
        "BIBREF67": {
            "ref_id": "b67",
            "title": "SEM series part 3: exploratory factor analysis",
            "authors": [
                {
                    "first": "James",
                    "middle": [],
                    "last": "Gaskin",
                    "suffix": ""
                }
            ],
            "year": 2013,
            "venue": "",
            "volume": "",
            "issn": "",
            "pages": "",
            "other_ids": {}
        },
        "BIBREF68": {
            "ref_id": "b68",
            "title": "Travelers' acceptance of electric carsharing systems in developing countries: the case of China",
            "authors": [
                {
                    "first": "V",
                    "middle": [],
                    "last": "Tran",
                    "suffix": ""
                },
                {
                    "first": "S",
                    "middle": [],
                    "last": "Zhao",
                    "suffix": ""
                },
                {
                    "first": "E",
                    "middle": [
                        "B"
                    ],
                    "last": "Diop",
                    "suffix": ""
                },
                {
                    "first": "W",
                    "middle": [],
                    "last": "Song",
                    "suffix": ""
                }
            ],
            "year": 2019,
            "venue": "Sustain",
            "volume": "11",
            "issn": "19",
            "pages": "1--22",
            "other_ids": {
                "DOI": [
                    "10.3390/su11195348"
                ]
            }
        },
        "BIBREF69": {
            "ref_id": "b69",
            "title": "An extension of the theory of planned behavior to predict pedestrians' violating crossing behavior using structural equation modeling",
            "authors": [
                {
                    "first": "H",
                    "middle": [],
                    "last": "Zhou",
                    "suffix": ""
                },
                {
                    "first": "S",
                    "middle": [
                        "B"
                    ],
                    "last": "Romero",
                    "suffix": ""
                },
                {
                    "first": "X",
                    "middle": [],
                    "last": "Qin",
                    "suffix": ""
                }
            ],
            "year": 2016,
            "venue": "Accid Anal Prev",
            "volume": "95",
            "issn": "",
            "pages": "417--424",
            "other_ids": {
                "DOI": [
                    "10.1016/j.aap.2015.09.009"
                ]
            }
        },
        "BIBREF70": {
            "ref_id": "b70",
            "title": "The benefits of carpooling",
            "authors": [
                {
                    "first": "S",
                    "middle": [],
                    "last": "Shaheen",
                    "suffix": ""
                },
                {
                    "first": "A",
                    "middle": [],
                    "last": "Cohen",
                    "suffix": ""
                },
                {
                    "first": "A",
                    "middle": [],
                    "last": "Bayen",
                    "suffix": ""
                }
            ],
            "year": 2018,
            "venue": "UC Berkely Transp Sustain Res Cent",
            "volume": "",
            "issn": "",
            "pages": "1--32",
            "other_ids": {
                "DOI": [
                    "10.7922/G2DZ06GF"
                ]
            }
        },
        "BIBREF71": {
            "ref_id": "b71",
            "title": "Publisher's Note",
            "authors": [],
            "year": null,
            "venue": "",
            "volume": "",
            "issn": "",
            "pages": "",
            "other_ids": {}
        },
        "BIBREF72": {
            "ref_id": "b72",
            "title": "Springer Nature remains neutral with regard to jurisdictional claims in published maps and institutional affiliations",
            "authors": [],
            "year": null,
            "venue": "",
            "volume": "",
            "issn": "",
            "pages": "",
            "other_ids": {}
        }
    },
    "ref_entries": {
        "FIGREF1": {
            "text": "Islamabad population growth (source: World Population Review [17])",
            "latex": null,
            "type": "figure"
        },
        "FIGREF2": {
            "text": "Research",
            "latex": null,
            "type": "figure"
        },
        "FIGREF3": {
            "text": "Islamabad city (Source: Google map) Conceptual",
            "latex": null,
            "type": "figure"
        },
        "FIGREF4": {
            "text": "Respondents",
            "latex": null,
            "type": "figure"
        },
        "FIGREF5": {
            "text": "Awareness of respondents about carpooling before this studyFig. 7 Willingness of respondents to travel with opposite gender partners (M7) in accordance with their marital status Ayaz et al.",
            "latex": null,
            "type": "figure"
        },
        "FIGREF6": {
            "text": "Responses to all the Likert scale variables taken for the studyFig. 9Intention to shift to carpooling, if high occupancy vehicle lanes provided Ayaz et al.",
            "latex": null,
            "type": "figure"
        },
        "FIGREF7": {
            "text": "AMOS: Analysis of a moment structures; AVE: Average variance extracted; CFA: Confirmatory factor analysis; CFI: Comparative fit index; CR: Composite reliability; CV: Convergent validity; EFA: Exploratory factor analysis; RMSEA: Root mean square error of approximation; SEM: Structural equation model; SRMR: Standardized root mean square residual; SPSS: Statistical Package for Social Sciences; TLI: Tucker-Lewis index",
            "latex": null,
            "type": "figure"
        },
        "TABREF1": {
            "text": "Coding and descriptions of the items in the questionnaire measured on a Likert scale",
            "latex": null,
            "type": "table"
        },
        "TABREF4": {
            "text": "Respondents' sociodemographic information",
            "latex": null,
            "type": "table"
        },
        "TABREF5": {
            "text": "Cronbach's alpha values obtained from reliability analysis",
            "latex": null,
            "type": "table"
        },
        "TABREF7": {
            "text": "PCA pattern matrix and exploratory factor analysis (EFA)",
            "latex": null,
            "type": "table"
        },
        "TABREF8": {
            "text": "Model fit results and acceptable thresholds of the model fit indices",
            "latex": null,
            "type": "table"
        },
        "TABREF9": {
            "text": "Ayaz et al. Journal of Engineering and Applied Science acquaintanceship factor (32%) and motives for carpooling, i.e., 25% effect on travelers' choice to use carpooling as their mode of transportation. This study concludes these latent constructs are the key motives for carpooling services. On the other hand, stranger partner is negatively influencing the intention to shift to carpooling service, i.e., −16%, which represents this variable as the only constraint for carpooling service identified by this study. The other latent construct of \"constraint\" was found insignificant (p > 0.05) in the model.",
            "latex": null,
            "type": "table"
        },
        "TABREF10": {
            "text": "Results of structural model Path Hypothesis Estimate S.E. p-value Remarks Intention to shift to carpooling service to this research can be provided in future studies by taking new and suitable variables.",
            "latex": null,
            "type": "table"
        },
        "TABREF11": {
            "text": "Descriptive statistics of the items taken for EFA, CFA, and SEM",
            "latex": null,
            "type": "table"
        }
    },
    "back_matter": [
        {
            "text": "The authors are highly thankful to the anonymous reviewers and the Journal of Engineering and Applied Science for considering our study for publication. ",
            "cite_spans": [],
            "ref_spans": [],
            "section": "Acknowledgements"
        },
        {
            "text": "Authors' contributions AA developed the complete framework for the study. HS contributed to the data collection and revision of the manuscript. AA analyzed the collected data, developed the model, interpreted the results, and wrote the paper. MA and AW supervised the entire study and provided their valuable suggestions and recommendations for the improvement of the study. Finally, MA and AW reviewed the paper and recommended it for submission to the journal. The authors read and approved the final manuscript.",
            "cite_spans": [],
            "ref_spans": [],
            "section": "Appendix"
        },
        {
            "text": "There is no funding source for this study.",
            "cite_spans": [],
            "ref_spans": [],
            "section": "Funding"
        },
        {
            "text": "All the relevant data has been included in the article.",
            "cite_spans": [],
            "ref_spans": [],
            "section": "Availability of data and materials"
        },
        {
            "text": "The authors declare that they have no competing interests. Received: 6 July 2021 Accepted: 6 September 2021",
            "cite_spans": [],
            "ref_spans": [],
            "section": "Competing interests"
        }
    ]
}