{
    "paper_id": "0a0edd03229d5fc4c06c3da09970418150c2b5ac",
    "metadata": {
        "title": "Pharmacists' Perceptions and Drivers of Immunization Practices for COVID-19 Vaccines: Results of a Nationwide Survey Prior to COVID-19 Vaccine Emergency Use Authorization",
        "authors": [
            {
                "first": "Sonia",
                "middle": [
                    "Susan"
                ],
                "last": "Jacob",
                "suffix": "",
                "affiliation": {},
                "email": ""
            },
            {
                "first": "Mary",
                "middle": [],
                "last": "Barna Bridgeman",
                "suffix": "",
                "affiliation": {
                    "laboratory": "",
                    "institution": "Rutgers University",
                    "location": {
                        "postCode": "08901",
                        "settlement": "New Brunswick",
                        "region": "NJ",
                        "country": "USA"
                    }
                },
                "email": ""
            },
            {
                "first": "Hyoeun",
                "middle": [],
                "last": "Kim",
                "suffix": "",
                "affiliation": {
                    "laboratory": "",
                    "institution": "Rutgers University",
                    "location": {
                        "postCode": "08901",
                        "settlement": "New Brunswick",
                        "region": "NJ",
                        "country": "USA"
                    }
                },
                "email": ""
            },
            {
                "first": "Michael",
                "middle": [],
                "last": "Toscani",
                "suffix": "",
                "affiliation": {
                    "laboratory": "",
                    "institution": "Rutgers University",
                    "location": {
                        "postCode": "08901",
                        "settlement": "New Brunswick",
                        "region": "NJ",
                        "country": "USA"
                    }
                },
                "email": ""
            },
            {
                "first": "Racquel",
                "middle": [],
                "last": "Kohler",
                "suffix": "",
                "affiliation": {
                    "laboratory": "",
                    "institution": "The State University of New Jersey",
                    "location": {
                        "postCode": "08901",
                        "settlement": "Rutgers, New Brunswick",
                        "region": "NJ",
                        "country": "USA"
                    }
                },
                "email": ""
            },
            {
                "first": "Stephanie",
                "middle": [],
                "last": "Shiau",
                "suffix": "",
                "affiliation": {
                    "laboratory": "",
                    "institution": "Rutgers University",
                    "location": {
                        "postCode": "08854",
                        "settlement": "Piscataway",
                        "region": "NJ",
                        "country": "USA"
                    }
                },
                "email": ""
            },
            {
                "first": "Humberto",
                "middle": [
                    "R"
                ],
                "last": "Jimenez",
                "suffix": "",
                "affiliation": {
                    "laboratory": "",
                    "institution": "Rutgers University",
                    "location": {
                        "postCode": "08901",
                        "settlement": "New Brunswick",
                        "region": "NJ",
                        "country": "USA"
                    }
                },
                "email": ""
            },
            {
                "first": "Joseph",
                "middle": [
                    "A"
                ],
                "last": "Barone",
                "suffix": "",
                "affiliation": {
                    "laboratory": "",
                    "institution": "Rutgers University",
                    "location": {
                        "postCode": "08901",
                        "settlement": "New Brunswick",
                        "region": "NJ",
                        "country": "USA"
                    }
                },
                "email": ""
            },
            {
                "first": "Navaneeth",
                "middle": [],
                "last": "Narayanan",
                "suffix": "",
                "affiliation": {
                    "laboratory": "",
                    "institution": "Rutgers University",
                    "location": {
                        "postCode": "08901",
                        "settlement": "New Brunswick",
                        "region": "NJ",
                        "country": "USA"
                    }
                },
                "email": ""
            }
        ]
    },
    "abstract": [
        {
            "text": "Citation: Jacob, S.S.; Bridgeman, M.B.; Kim, H.; Toscani, M.; Kohler, R.; Shiau, S.; Jimenez, H.R.; Barone, J.A.; Narayanan, N. Pharmacists'",
            "cite_spans": [],
            "ref_spans": [],
            "section": "Abstract"
        }
    ],
    "body_text": [
        {
            "text": "Since January of 2020, the novel coronavirus (COVID-19) pandemic has swept across the United States, resulting in more than 522,973 deaths as of 8 March 2021 [1] . Global research initiatives to determine optimal clinical management strategies are ongoing, but much remains unknown. To improve public health, the White House executed Operation Warp Speed in March 2020, which promoted the development and manufacturing of COVID-19 vaccines by selected pharmaceuticals in order to accelerate the development of novel therapeutic agents to aid the response to this pandemic throughout the country [2] . Despite the efforts to release a COVID-19 vaccine in a timely manner, a Reuters poll conducted in May 2020 demonstrated that one-fourth of Americans were uninterested in getting the coronavirus vaccine once available. The common reasons included nervousness about the vaccine's quick approval and weariness about the risk associated with a new vaccine [3] . It is important to note that the general public's knowledge regarding COVID-19 may have been influenced by myths circulating on social media [4] . However, another survey revealed that participants were more willing to get vaccinated if they thought their healthcare provider would recommend vaccination [5] . Pharmacists are on the frontline of mass immunization efforts and play a vital role in recommending vaccines to improve public health. This involvement also makes pharmacists at increased risk for exposure, thus, emphasizing the importance to receive a COVID-19 vaccine. The Department of Health and Human Services authorized pharmacists to order and administer COVID-19 vaccines under the Public Readiness and Emergency Preparedness (PREP) Act [6] . Previous research has shown that healthcare providers with high confidence in the benefits and safety of vaccines were more likely to accept vaccines for themselves and recommend vaccines to their patients [7] .",
            "cite_spans": [
                {
                    "start": 158,
                    "end": 161,
                    "text": "[1]",
                    "ref_id": "BIBREF0"
                },
                {
                    "start": 595,
                    "end": 598,
                    "text": "[2]",
                    "ref_id": "BIBREF1"
                },
                {
                    "start": 953,
                    "end": 956,
                    "text": "[3]",
                    "ref_id": "BIBREF2"
                },
                {
                    "start": 1100,
                    "end": 1103,
                    "text": "[4]",
                    "ref_id": "BIBREF3"
                },
                {
                    "start": 1263,
                    "end": 1266,
                    "text": "[5]",
                    "ref_id": "BIBREF4"
                },
                {
                    "start": 1714,
                    "end": 1717,
                    "text": "[6]",
                    "ref_id": "BIBREF5"
                },
                {
                    "start": 1926,
                    "end": 1929,
                    "text": "[7]",
                    "ref_id": "BIBREF6"
                }
            ],
            "ref_spans": [],
            "section": "Introduction"
        },
        {
            "text": "In April 2020, there were 78 active COVID-19 vaccine candidates. These vaccine candidates include the Pfizer Inc. and Moderna Inc. mRNA vaccine platforms and the Janssen viral vector vaccine platform [8] . The preliminary updates on the efficacy of COVID-19 vaccines in phase III clinical trials may have influenced many pharmacists' perceptions within a short period of time. In a survey conducted among 400 pharmacists in November 2020, 52% of pharmacists were ready to receive the COVID-19 vaccine as soon as possible, 74% were willing to administer the vaccine as soon as possible, and 37% were willing to receive and vaccinate patients as soon as possible [9] . In December 2020, the FDA's Vaccines and Related Biological Products Advisory Committee (VRBPAC) approved the United States' first COVID-19 vaccines Emergency Use Authorization (EUA) submitted by Pfizer Inc. and Moderna Inc. [10, 11] . On 27 February 2021 the FDA's VRBPAC approved the Janssen COVID-19 vaccine under emergency use authorization [12] . The COVID-19 vaccine global landscape continues to expand-with 108 vaccines in clinical development and 3 vaccines approved for emergency-use authorization by the Food and Drug Administration (FDA) in the United States as of 15 July 2021 [13] .",
            "cite_spans": [
                {
                    "start": 200,
                    "end": 203,
                    "text": "[8]",
                    "ref_id": "BIBREF7"
                },
                {
                    "start": 661,
                    "end": 664,
                    "text": "[9]",
                    "ref_id": "BIBREF8"
                },
                {
                    "start": 892,
                    "end": 896,
                    "text": "[10,",
                    "ref_id": "BIBREF9"
                },
                {
                    "start": 897,
                    "end": 900,
                    "text": "11]",
                    "ref_id": "BIBREF10"
                },
                {
                    "start": 1012,
                    "end": 1016,
                    "text": "[12]",
                    "ref_id": "BIBREF11"
                },
                {
                    "start": 1257,
                    "end": 1261,
                    "text": "[13]",
                    "ref_id": "BIBREF12"
                }
            ],
            "ref_spans": [],
            "section": "Introduction"
        },
        {
            "text": "It is crucial for pharmacists to stay informed on COVID-19 vaccines' safety and efficacy data to address vaccine hesitancy so that their patients can feel comfortable in deciding to receive the vaccine. Through this study, we aim to assess how clinical information, background training, and personal experience with COVID-19, as well as how pharmacists' knowledge, beliefs, and attitudes influence their perceptions toward COVID-19 vaccines. The objective of this study was to assess what factors influence pharmacists' willingness to receive and recommend COVID-19 vaccines and to identify pertinent information that pharmacists need to make an informed decision to receive and recommend COVID-19 vaccines.",
            "cite_spans": [],
            "ref_spans": [],
            "section": "Introduction"
        },
        {
            "text": "This was a national cross-sectional study administered with use of the secure online survey platform, Qualtrics. A convenience sample of voluntary participants were recruited nationally through email-and listserv-based distribution, utilizing publicly accessible contact lists in pharmacy professional organization listservs and professional social media platforms such as LinkedIn. The professional organization listservs that were used include Rutgers pharmacy preceptors, Rutgers Pharmaceutical Industry Fellowship (RPIF) current fellows and alumni, Garden State Pharmacy Owners, New Jersey Society of Health-System Pharmacists (NJSHP), American College of Clinical Pharmacy (ACCP), American Society of Health-System Pharmacists (ASHP), American Society of Consultant Pharmacists (ASCP), and American Association of Colleges of Pharmacy (AACP). Once participants agreed with the informed consent form, they were able to access the 34-question survey. The survey was open on 18 September 2020 and closed on 16 November 2020. This survey data was collected prior to any preliminary COVID-19 vaccine data.",
            "cite_spans": [],
            "ref_spans": [],
            "section": "Materials and Methods"
        },
        {
            "text": "Any licensed U.S. pharmacist from various settings was able to participate. The exclusion criteria included pharmacy technicians, interns, externs, and non-pharmacy licensed subjects. Participants were excluded from analysis if they did not consent to the survey, were not a practicing pharmacist in the USA, completed ≤ 15% of the survey, or did not respond to the questions corresponding to the primary outcome. The study variables collected were parameters in the form of yes/no questions, select all that apply, and ordinal scale ranking. The independent variables collected were demographics, exposure to COVID-19, work type, likelihood to receive a vaccine, likelihood to recommend a vaccine, concerns of vaccine safety, concerns of vaccine efficacy, and prioritization of vaccine information.",
            "cite_spans": [],
            "ref_spans": [],
            "section": "Materials and Methods"
        },
        {
            "text": "The primary outcomes were the pharmacists' willingness to receive and recommend COVID-19 vaccines. This was assessed using Questions 22, 23, 26, and 27 (Table S1 and the use of a Likert scale). We created a binary variable indicating willingness to receive and recommend a COVID-19 vaccine for \"somewhat likely\" or 'extremely likely\" responses.",
            "cite_spans": [],
            "ref_spans": [],
            "section": "Materials and Methods"
        },
        {
            "text": "Pharmacists' willingness to receive and recommend COVID-19 vaccines were assessed at ≤ 1 year from the time of vaccine approval and > 1 year from the time of vaccine approval. Covariates assessed in the survey included COVID-19 exposure or personal experience, primary pharmacy practice setting, background in training, region of the United States, and prioritization of clinical data. Pharmacists' perceptions of COVID-19 and COVID-19 vaccines were also assessed. Further exploratory analyses were done to assess concordance and discordance among pharmacists' decisions to receive and recommend using Questions 22, 23, 26, and 27 (Table S1) .",
            "cite_spans": [],
            "ref_spans": [
                {
                    "start": 631,
                    "end": 641,
                    "text": "(Table S1)",
                    "ref_id": "TABREF0"
                }
            ],
            "section": "Materials and Methods"
        },
        {
            "text": "This survey was approved by the Institutional Review Board of Rutgers University and data were analyzed using descriptive and inferential statistics. The p-values were determined using a chi-squared analysis. All analyses were conducted using SAS 9.4 (Cary, NC, USA).",
            "cite_spans": [],
            "ref_spans": [],
            "section": "Materials and Methods"
        },
        {
            "text": "A total of 763 participants responded to the survey, however, only 632 participants were included in the final analysis. A total of 131 participants were excluded because 6 (4.6%) did not consent, 61 (46.6%) were not practicing pharmacists in the USA, 41 (31.3%) completed ≤ 15% of the survey, and 23 (17.6%) of the participants did not answer one or more of the four prime study questions regarding their willingness to receive or recommend a COVID-19 vaccine.",
            "cite_spans": [],
            "ref_spans": [],
            "section": "Results"
        },
        {
            "text": "Characteristics of the study population are shown in Table 1 . The majority of our respondents were from the Northeast region of the USA, female, between 18 and 55 years old, white, worked in a direct patient care setting, and had completed post-doctoral training.",
            "cite_spans": [],
            "ref_spans": [
                {
                    "start": 53,
                    "end": 60,
                    "text": "Table 1",
                    "ref_id": "TABREF0"
                }
            ],
            "section": "Results"
        },
        {
            "text": "Perceptions of COVID-19 and new COVID-19 vaccines were assessed and are presented in Table 2 . The majority of pharmacists were concerned about becoming infected with COVID-19, believed it would affect their daily work, and believed spread was dependent on human control. However, only about half of the pharmacists believed that a COVID-19 vaccine would protect them. Pharmacists' willingness to receive and recommend a COVID-19 vaccine were assessed at ≤ 1 year from the time of vaccine approval and > 1 year after vaccine approval, as listed in Table 2 . Pharmacists were significantly more likely to receive and recommend a COVID-19 vaccine at > 1 year after vaccine approval as compared were ≤ 1 year after vaccine approval. Overall, more than half of the pharmacists were somewhat likely or extremely likely to receive and recommend a COVID-19 vaccine. Perceptions of COVID-19 and new COVID-19 vaccines were assessed and are presented in Table 3 . The majority of pharmacists were concerned about becoming infected with COVID-19, believed it would affect their daily work, and believed spread was depen-dent on human control. However, only about half of the pharmacists believed that that a COVID-19 vaccine would protect them. A secondary analysis was conducted to determine how consistent individual respondents were in their choice to receive and recommend COVID-19 vaccines When comparing the responses for vaccine decision-making to receive vs. recommend a COVID-19 vaccine at ≤ 1 year after vaccine approval, significantly more pharmacists were \"somewhat likely or extremely likely,\" to recommend the vaccine than to receive the vaccine (p < 0.0001). Pharmacists' concordance between vaccine receival and recommendation status showed that 59.7% of the pharmacists said they were somewhat likely/extremely likely to both receive and recommend COVID-19 vaccines and 29.1% of the pharmacists said they were neither likely nor unlikely/somewhat unlikely/or extremely unlikely to both receive and recommend COVID-19 vaccines. When assessing discordance, it was found that 3.8% of the pharmacists that said they were \"somewhat likely/extremely likely to recommend the vaccine\" but answered that they were \"neither likely nor unlikely, somewhat unlikely, or strongly unlikely,\" to receive the vaccine themselves at ≤ 1 year from time of vaccine approval.",
            "cite_spans": [],
            "ref_spans": [
                {
                    "start": 85,
                    "end": 92,
                    "text": "Table 2",
                    "ref_id": "TABREF1"
                },
                {
                    "start": 548,
                    "end": 555,
                    "text": "Table 2",
                    "ref_id": "TABREF1"
                },
                {
                    "start": 944,
                    "end": 951,
                    "text": "Table 3",
                    "ref_id": "TABREF2"
                }
            ],
            "section": "Results"
        },
        {
            "text": "A comparison of responses for vaccine decision-making to receive a COVID-19 vaccine vs. to recommend a COVID-19 vaccine was also completed at > 1 year after vaccine approval. There was a statistically significant difference when pharmacists were asked if they would receive a COVID-19 vaccine vs. recommend a COVID-19 vaccine at > 1 year after vaccine approval (p < 0.0001). Pharmacists' concordance between vaccine receival and recommendation status >1 year after vaccine approval showed that 72.8% of the pharmacists said they were \"somewhat likely/extremely likely to both receive and recommend COVID-19 vaccines\" and 13.6% of the pharmacists said they were \"neither likely nor unlikely/somewhat unlikely/or extremely unlikely to both receive and recommend COVID-19 vaccines\". When assessing discordance, it was found that 8.4% of the pharmacists that said they would \"somewhat agree or strongly agree,\" to recommend the vaccine, but answered that they were \"neither likely nor likely, somewhat disagree, or strongly disagree,\" to receive the vaccine themselves >1 year after vaccine approval.",
            "cite_spans": [],
            "ref_spans": [],
            "section": "Results"
        },
        {
            "text": "Potential factors that may influence pharmacists' decision to receive a COVID-19 vaccine are illustrated in Table 4 . There was a significant difference (p < 0.0001) between collective responses of each of the five categories (extremely unlikely, somewhat unlikely, neither likely nor unlikely, somewhat likely, and extremely likely) at ≤ 1 year and > 1 year after vaccine approval. * All data presented as n (%) unless otherwise specified. ** The option of \"unsure,\" was not an available answer choice for the following question. *** p-value compares the somewhat likely, extremely likely at ≤ 1 year vs. > 1 year from vaccine approval.",
            "cite_spans": [],
            "ref_spans": [
                {
                    "start": 108,
                    "end": 115,
                    "text": "Table 4",
                    "ref_id": "TABREF3"
                }
            ],
            "section": "Results"
        },
        {
            "text": "Potential factors that may influence pharmacists' decision to recommend a COVID-19 vaccine are illustrated in Table 5 . There was a significant difference (p < 0.0001) between collective responses of each of the five categories (extremely unlikely, somewhat unlikely, neither likely nor unlikely, somewhat likely, extremely likely) at ≤ 1 year and > 1 year after vaccine approval. * All data presented as n (%) unless otherwise specified. ** The option of \"unsure,\" was not an available answer choice for the following question. *** p-value compares the somewhat likely, extremely likely at ≤ 1 year vs. > 1 year from vaccine approval.",
            "cite_spans": [],
            "ref_spans": [
                {
                    "start": 110,
                    "end": 117,
                    "text": "Table 5",
                    "ref_id": "TABREF4"
                }
            ],
            "section": "Results"
        },
        {
            "text": "If participants chose \"neither unlikely nor likely, somewhat unlikely, or extremely unlikely,\" to either receive or recommend COVID-19 vaccines they were then asked to select all reasons for why they would delay or refuse a COVID-19 vaccine, regardless of time of vaccine approval. Participants who said they would delay or refuse receiving a COVID-19 vaccine (n = 253) chose to do so for the following reasons: concerns about side effects or sickness (81%), rapidly changing real world data during pandemic (46.6%), not in a high-risk or priority group (23.7%), belief that the vaccine does not work (23.3%), limited contact with high-risk patients (12.6%), ability to social distance and wear a mask provides sufficient protection (5.5%), COVID-19 is non-severe or temporary issue (3.2%), vaccine candidate already had COVID-19 (0.8%), COVID-19 vaccination is not needed nor wanted (6.3%), and other (28.9%). If participants chose \"somewhat agree or strongly agree,\" to any of Question 23, 24, 26, or 27, then, they were asked to select all reasons they chose to receive or recommend the vaccine. Participants who said they would delay or refuse recommending a COVID-19 vaccine (n = 253) to their patients, chose to do so for the following reasons: concerns about side effects or sickness (75.1%), rapidly changing real world data during pandemic (41.1%), belief that the vaccine does not work (17%), not in a high-risk or priority group (15%), limited contact with high-risk patients (9.5%), hesitant about vaccine discussion with patients (9.1%), ability to social distance and wear a mask provides sufficient protection (4.7%), vaccine candidate already had COVID-19 (4.7%), COVID-19 is a non-severe or temporary issue (2%), other (20.6%). Concerns that fell under the \"other,\" category included political influence on vaccine approval, and uncertainty regarding the safety and efficacy data, and fear that the approval process would be too quick or compromise safety.",
            "cite_spans": [],
            "ref_spans": [],
            "section": "Results"
        },
        {
            "text": "If participants chose \"somewhat likely or extremely likely,\" to either receive or recommend COVID-19 vaccines. Then, they were asked to select all reasons why they were in favor of the COVID-19 vaccine. Among those who favored the COVID-19 vaccine for themselves (n = 565), the following reasons included: avoid transmitting COVID-19 to family (91.9%), reduce the risk of contracting COVID-19 to protect self (87.6%), being a healthcare worker (80%), avoid transmitting COVID-19 to community or patients (64.1%), workplace mandate (47.6%), recommendations of government health agencies (43.5%), recommendation from other medical professionals (40.4%), have a medical condition that puts vaccine candidate at increased risk for COVID-19 (12.9%), recommendations of friends and family (9%), recommendations of political leaders (1.8%), other (41.6%). Among those who favored recommending the COVID-19 vaccine to their patients (n = 537), the following reasons included: reduce the risk of contracting COVID-19 to protect self (94.2%), avoid transmitting COVID-19 to family (90.5%), avoid transmitting COVID-19 to community or patients (90.3%), patient has a medical condition that puts them at increased risk for COVID-19 (86%), recommendations of government health agencies (62.9%), recommendations of political leaders (2.2%), and other (1.7%).",
            "cite_spans": [],
            "ref_spans": [],
            "section": "Results"
        },
        {
            "text": "Regardless of the pharmacists' decision to receive or recommend vaccination, all respondents were asked to prioritize the top three clinical pieces of clinical information they would prioritize when formulating a decision to receive or recommend a COVID-19 vaccine. The prioritization of this clinical information is shown in Figure 1 . ",
            "cite_spans": [],
            "ref_spans": [
                {
                    "start": 326,
                    "end": 334,
                    "text": "Figure 1",
                    "ref_id": "FIGREF0"
                }
            ],
            "section": "Results"
        },
        {
            "text": "To date, this is the largest survey study to report the results of pharmacists' perceptions of and willingness to receive and recommend COVID-19 vaccines during a global pandemic. A previous study conducted by Petek et al. showed that familiarity with influenza disease did not impact the decision to vaccinate for influenza [14] . Pharmacists' perceptions of COVID-19 were assessed to gauge if the rapidly changing knowledge of the disease state would influence pharmacists' view of credibility for a new vaccine. Our study found that 67.1% of the pharmacists were willing to receive a COVID-19 vaccine and 63.4% of the pharmacists were willing to recommend a COVID-19 vaccine at ≤ 1 year from the time of vaccine approval. At > 1 year after vaccine approval, 78% of the pharmacists were willing to receive a COVID-19 vaccine and 81.2% of the pharmacists were willing to recommend a COVID-19 vaccine. There was a significant difference in pharmacists' vaccine decisions between the varying time frame of vaccine approval. Pharmacists with post-doctoral training were more likely to receive and recommend a COVID-19 vaccine than those without post-doctoral training. Pharmacists in indirect patient care settings were more likely to receive or recommend a COVID-19 vaccine than those in direct patient care settings. Lastly, pharmacists with increased personal experience and exposure to COVID-19 were more likely than unlikely to receive and recommend a COVID-19 vaccine. Pharmacist with no post-doctoral training were less likely to receive or recommend a COVID-19 vaccine than those with post-doctoral training. Pharmacist in direct patient care settings were less likely to receive or recommend a COVID-19 vaccine than those indirect patient care settings. Pharmacist without personal experience nor exposure to COVID-19 were more unlikely than likely to receive or recommend a COVID-19 vaccine. These determinants may aid in identifying current concerns of pharmacists so that medical education may be tailored to address those concerns.",
            "cite_spans": [
                {
                    "start": 210,
                    "end": 222,
                    "text": "Petek et al.",
                    "ref_id": null
                },
                {
                    "start": 325,
                    "end": 329,
                    "text": "[14]",
                    "ref_id": "BIBREF13"
                }
            ],
            "ref_spans": [],
            "section": "Discussion"
        },
        {
            "text": "Our results were consistent with the results of another nationwide survey of 400 pharmacists conducted by the American Pharmacist Association (APhA) from 21 November 2020 to 28 November 2020. The survey conducted by APhA showed that 69% of pharmacists would receive a COVID-19 vaccine at ≤ 1 year and 60% of pharmacists would recommend the vaccine at ≤ 1 year [9] . The APhA survey was conducted shortly after preliminary results for COVID-19 vaccines efficacy trials were published [15, 16] . Our survey was conducted from 19 September 2020 to 18 November 2020 (prior to release of any COVID-19 vaccine trial data) and showed that baseline willingness status of pharmacists to receive and recommend COVID-19 vaccines were similar to their willingness status once the preliminary clinical trial findings were released. A major difference between our study and the survey conducted by APhA is that the APhA survey assessed pharmacists' willingness at three different time intervals: vaccination as soon as possible, after six months of experience with the vaccine, and after one year of experience with the vaccine. Although we assessed willingness at ≤ 1 year and > 1 year of vaccine approval, this difference between studies may be negligible in a real-world setting. COVID-19 vaccine distribution is decided by phases recommend by the Centers of Disease Control and Prevention; therefore, recipients may not have the ability to choose when they will receive the vaccine within the first year of vaccine roll-out. The APhA survey also assessed how prepared pharmacist felt to administer COVID-19 vaccines as soon as they are available. Pharmacists had the option of stating the following: they are ready to receive and vaccinate as soon as the vaccine is available, they are in the final preparation stages and are ready to vaccinate patients as soon as the vaccine is available, they are not prepared to vaccinate in the first wave of the vaccination effort but plan to participate in future phases, or logistics of preparation are too difficult for them to participate [9] . This is a component that our survey did not assess but would be useful to determine what resources pharmacists need to feel prepared, in order to increase their willingness to receive and recommend vaccines.",
            "cite_spans": [
                {
                    "start": 360,
                    "end": 363,
                    "text": "[9]",
                    "ref_id": "BIBREF8"
                },
                {
                    "start": 483,
                    "end": 487,
                    "text": "[15,",
                    "ref_id": "BIBREF14"
                },
                {
                    "start": 488,
                    "end": 491,
                    "text": "16]",
                    "ref_id": "BIBREF15"
                },
                {
                    "start": 2072,
                    "end": 2075,
                    "text": "[9]",
                    "ref_id": "BIBREF8"
                }
            ],
            "ref_spans": [],
            "section": "Discussion"
        },
        {
            "text": "Previous research has found that 69% of the general U.S. population were willing to get a COVID-19 vaccine. Reiter et al. conducted a cross-sectional survey which consisted of 2006 adults ages 18 and older during May 2020. Reiter et al. demonstrated that participants were more likely to get vaccinated if they thought their healthcare provider would recommend vaccination. The general U.S. population was also more likely to be willing to get vaccinated if they reported higher levels of perceived risk of being infected by COVID-19, or perceived effectiveness of COVID-19 vaccine. The results from the general adult U.S. population also revealed that participants were less likely to be willing to get vaccinated if they were non-Latinx Black or had higher levels of perceived potential vaccine harm [5] . The rate of willingness to receive a COVID-19 vaccine was comparable to other studies done surveying the general adult population [5] . Since the general adult population consider healthcare providers as a major influencer in their vaccine decision, the need to increase pharmacists' confidence and acceptance of COVID-19 vaccines is evident. We also did not analyze how willingness toward vaccination differed between race, although this may be important for future findings to address perceptions as they relate to health disparities.",
            "cite_spans": [
                {
                    "start": 802,
                    "end": 805,
                    "text": "[5]",
                    "ref_id": "BIBREF4"
                },
                {
                    "start": 938,
                    "end": 941,
                    "text": "[5]",
                    "ref_id": "BIBREF4"
                }
            ],
            "ref_spans": [],
            "section": "Discussion"
        },
        {
            "text": "An online survey of U.S. adults observed trends in vaccine trust and vaccine hesitancy between 14 October 2020 and 29 March 2021. Daly et al. surveyed 7420 participants who provided 42,154 survey responses. U.S adults showed that overall vaccine hesitancy has declined significantly by 10.8% from October 2020 (46%) to March 2021 (35.2%). U.S. adults were asked to rate their trust for the \"governmental approval process to ensure the COVID-19 vaccine is safe for the public,\" and the \"process in general (not just for COVID-19) to develop safe vaccines for the public,\" on a scale of one (fully trust) to four (do not trust). Change in trust increased by 0.4 from October 2020 (3.0) to March 2021 (2.6) [17] . Since our survey was conducted before vaccine data showed high efficacy against COVID-19, there is a need to conduct a survey of pharmacists' trust and willingness to vaccinate against COVID-19 in the USA, now that COVID-19 vaccines have regulatory approval and the existence of mass immunization programs.",
            "cite_spans": [
                {
                    "start": 704,
                    "end": 708,
                    "text": "[17]",
                    "ref_id": "BIBREF16"
                }
            ],
            "ref_spans": [],
            "section": "Discussion"
        },
        {
            "text": "Research is still needed to understand how U.S. pharmacists' readiness to provide COVID-19 services impacts their willingness to provide COVID-19 vaccination. Merks et al. conducted a cross-sectional survey that consisted of 1777 Polish community pharmacist between February and August 2020. Merks et al. assessed the readiness and willingness of pharmacists, trained and not trained through a pilot immunization workshop, to provide vaccination services during the COVID-19 pandemic in Poland. Polish community pharmacists who underwent additional immunization training showed a greater readiness to provide immunization services as compared with those who did not receive training. The most common barriers affecting Polish pharmacists' readiness were: providing vaccinations will require more work, not enough training courses, and pharmacy facilities are not adjusted to provide these services [18] . Acknowledging that readiness and willingness for vaccination are not mutually exclusive, our findings were comparable in showing that those who have completed additional training were more likely than unlikely to receive and recommend COVID-19 vaccines. This may emphasize the effects of educational training on vaccine acceptance. Our study did not analyze what resources are needed to overcome vaccine hesitancy in pharmacists or barriers in vaccine implementation in pharmacy practice settings.",
            "cite_spans": [
                {
                    "start": 898,
                    "end": 902,
                    "text": "[18]",
                    "ref_id": "BIBREF17"
                }
            ],
            "ref_spans": [],
            "section": "Discussion"
        },
        {
            "text": "There are several limitations to our study. First, the use of a convenience sample may have allowed for possible selection bias in regard to survey distribution. According to the Bureau Labor of Statistics, 42% of the pharmacy graduates work in a community practice setting and 26% of the pharmacy graduates work in a hospital practice setting, therefore, our study population is not representative of the pharmacist workforce data in the United States [19] . Moreover, there was no standardized denominator to accurately determine the survey response rates given the broad distribution across online platforms and email distribution lists from professional organizations. Lastly, our survey took place before multiple companies filed for the FDA Emergency Use Authorization which publicized thẽ 95% effectiveness clinical trial data [14, 15] . This vaccine data could certainly affect the perceptions of pharmacists toward COVID-19 vaccines and the current survey findings may change based on the now available data.",
            "cite_spans": [
                {
                    "start": 453,
                    "end": 457,
                    "text": "[19]",
                    "ref_id": null
                },
                {
                    "start": 834,
                    "end": 838,
                    "text": "[14,",
                    "ref_id": "BIBREF13"
                },
                {
                    "start": 839,
                    "end": 842,
                    "text": "15]",
                    "ref_id": "BIBREF14"
                }
            ],
            "ref_spans": [],
            "section": "Discussion"
        },
        {
            "text": "However, a potential strength of our data is that it was taken before the interim COVID-19 vaccine results and can be viewed as pharmacists' unbiased baseline perceptions. Our data represents how pharmacists feel at baseline and how pharmacists are influenced prior to release of vaccines emergency use authorization. This not only informs the current pandemic, but future ones as well. Lastly, to the best of our knowledge, this is the largest survey assessing pharmacist personal and professional behaviors regarding future COVID-19 vaccines. There were survey respondents across the country as well as across specialty areas and practice settings.",
            "cite_spans": [],
            "ref_spans": [],
            "section": "Discussion"
        },
        {
            "text": "Vaccines are among the most effective public health interventions worldwide. By understanding possible determinants in vaccine decision-making, we should be able to further tailor vaccine education and understand barriers to vaccine acceptance. Further research is needed on both health behaviors and vaccine confidence among healthcare professionals, as well as clinical decision-making in areas of novel therapeutics.",
            "cite_spans": [],
            "ref_spans": [],
            "section": "Discussion"
        },
        {
            "text": "This cross-sectional survey was conducted from September to November 2020 (prior to the release of any COVID-19 vaccine trial data) but during the time governing bodies such as the Department of Health and Human Services, Food and Drug Administration, and the White House issued COVID-19 vaccine emergency use authorization guidance. Pharmacists, as members of the front-line immunization effort, play a vital role in recommending and providing vaccines to improve public health. We aimed to assess pharmacists' willingness to receive and recommend COVID-19 vaccines and factors that may influence this decision. Our study showed that although most pharmacists would receive and recommend a COVID-19 vaccine, a substantial proportion of pharmacists reports vaccine hesitancy to receive or recommend COVID-19 vaccines. Pharmacists prioritize similar clinical information when considering the decision to receive and recommend a COVID-19 vaccine.",
            "cite_spans": [],
            "ref_spans": [],
            "section": "Conclusions"
        },
        {
            "text": "Supplementary Materials: The following are available online at https://www.mdpi.com/article/10 .3390/pharmacy9030131/s1, Table S1 : Survey Questionnaire. Funding: This research did not receive any specific grant from funding agencies in the public, commercial, or not-for-profit sectors.",
            "cite_spans": [],
            "ref_spans": [
                {
                    "start": 121,
                    "end": 129,
                    "text": "Table S1",
                    "ref_id": "TABREF0"
                }
            ],
            "section": "Conclusions"
        },
        {
            "text": "Institutional Review Board Statement: The study was approved by the Institutional Review Board of Rutgers University (Protocol ID Pro2020002011, date of approval: 18 September 2020).",
            "cite_spans": [],
            "ref_spans": [],
            "section": "Conclusions"
        },
        {
            "text": "Informed consent was obtained from all subjects involved in the study.",
            "cite_spans": [],
            "ref_spans": [],
            "section": "Informed Consent Statement:"
        }
    ],
    "bib_entries": {
        "BIBREF0": {
            "ref_id": "b0",
            "title": "Centers for Disease Control and Prevention Website",
            "authors": [
                {
                    "first": "",
                    "middle": [],
                    "last": "Cdc Covid Data",
                    "suffix": ""
                },
                {
                    "first": "",
                    "middle": [],
                    "last": "Tracker",
                    "suffix": ""
                }
            ],
            "year": 2021,
            "venue": "",
            "volume": "",
            "issn": "",
            "pages": "",
            "other_ids": {}
        },
        "BIBREF1": {
            "ref_id": "b1",
            "title": "Explaining Operation Warp Speed. U.S. Department of Health and Human Services Website",
            "authors": [],
            "year": 2021,
            "venue": "Fact Sheet",
            "volume": "",
            "issn": "",
            "pages": "",
            "other_ids": {}
        },
        "BIBREF2": {
            "ref_id": "b2",
            "title": "Reuters/Ipsos Coronavirus Vaccine Survey (05/22/2020)",
            "authors": [
                {
                    "first": "C",
                    "middle": [],
                    "last": "Jackson",
                    "suffix": ""
                },
                {
                    "first": "A",
                    "middle": [
                        "A"
                    ],
                    "last": "Lohr",
                    "suffix": ""
                }
            ],
            "year": 2020,
            "venue": "",
            "volume": "",
            "issn": "",
            "pages": "",
            "other_ids": {}
        },
        "BIBREF3": {
            "ref_id": "b3",
            "title": "Knowledge and Perceptions of COVID-19 Among the General Public in the United States and the United Kingdom: A Cross-sectional Online Survey",
            "authors": [
                {
                    "first": "P",
                    "middle": [],
                    "last": "Geldsetzer",
                    "suffix": ""
                }
            ],
            "year": null,
            "venue": "Ann. Intern. Med",
            "volume": "2020",
            "issn": "",
            "pages": "157--160",
            "other_ids": {
                "DOI": [
                    "10.7326/M20-0912"
                ]
            }
        },
        "BIBREF4": {
            "ref_id": "b4",
            "title": "Acceptability of a COVID-19 vaccine among adults in the United States: How many people would get vaccinated? Vaccine",
            "authors": [
                {
                    "first": "P",
                    "middle": [
                        "L"
                    ],
                    "last": "Reiter",
                    "suffix": ""
                },
                {
                    "first": "M",
                    "middle": [
                        "L"
                    ],
                    "last": "Pennell",
                    "suffix": ""
                },
                {
                    "first": "M",
                    "middle": [
                        "L"
                    ],
                    "last": "Katz",
                    "suffix": ""
                }
            ],
            "year": 2020,
            "venue": "",
            "volume": "38",
            "issn": "",
            "pages": "6500--6507",
            "other_ids": {
                "DOI": [
                    "10.1016/j.vaccine.2020.08.043"
                ]
            }
        },
        "BIBREF5": {
            "ref_id": "b5",
            "title": "Guidance for Licensed Pharmacists and Pharmacy Interns Regarding COVID-19 Vaccines and Immunity under the PREP Act. U.S. Department of Health and Human Services Website",
            "authors": [],
            "year": 2021,
            "venue": "",
            "volume": "",
            "issn": "",
            "pages": "",
            "other_ids": {}
        },
        "BIBREF6": {
            "ref_id": "b6",
            "title": "Vaccine hesitancy and healthcare providers",
            "authors": [
                {
                    "first": "P",
                    "middle": [],
                    "last": "Paterson",
                    "suffix": ""
                },
                {
                    "first": "F",
                    "middle": [],
                    "last": "Meurice",
                    "suffix": ""
                },
                {
                    "first": "L",
                    "middle": [
                        "R"
                    ],
                    "last": "Stanberry",
                    "suffix": ""
                },
                {
                    "first": "S",
                    "middle": [],
                    "last": "Glismann",
                    "suffix": ""
                },
                {
                    "first": "L",
                    "middle": [
                        "R"
                    ],
                    "last": "Rosenthal",
                    "suffix": ""
                },
                {
                    "first": "H",
                    "middle": [],
                    "last": "Larson",
                    "suffix": ""
                }
            ],
            "year": 2016,
            "venue": "Vaccine",
            "volume": "34",
            "issn": "",
            "pages": "6700--6706",
            "other_ids": {
                "DOI": [
                    "10.1016/j.vaccine.2016.10.042"
                ]
            }
        },
        "BIBREF7": {
            "ref_id": "b7",
            "title": "The COVID-19 vaccine development landscape",
            "authors": [
                {
                    "first": "T",
                    "middle": [
                        "T"
                    ],
                    "last": "Le",
                    "suffix": ""
                },
                {
                    "first": "Z",
                    "middle": [],
                    "last": "Andreadakis",
                    "suffix": ""
                },
                {
                    "first": "A",
                    "middle": [],
                    "last": "Kumar",
                    "suffix": ""
                },
                {
                    "first": "R",
                    "middle": [
                        "G"
                    ],
                    "last": "Román",
                    "suffix": ""
                },
                {
                    "first": "S",
                    "middle": [],
                    "last": "Tollefsen",
                    "suffix": ""
                },
                {
                    "first": "M",
                    "middle": [],
                    "last": "Savile",
                    "suffix": ""
                },
                {
                    "first": "S",
                    "middle": [],
                    "last": "Mayhew",
                    "suffix": ""
                }
            ],
            "year": 2020,
            "venue": "Nat. Rev. Drug. Discov",
            "volume": "19",
            "issn": "",
            "pages": "305--306",
            "other_ids": {
                "DOI": [
                    "10.1038/d41573-020-00151-8"
                ]
            }
        },
        "BIBREF8": {
            "ref_id": "b8",
            "title": "Pharmacists Ready to Receive and Administer COVID-19 Vaccines, According to APhA Survey. The American Pharmacists Association Website",
            "authors": [
                {
                    "first": "F",
                    "middle": [],
                    "last": "Fortin",
                    "suffix": ""
                }
            ],
            "year": 2021,
            "venue": "",
            "volume": "",
            "issn": "",
            "pages": "",
            "other_ids": {}
        },
        "BIBREF9": {
            "ref_id": "b9",
            "title": "FDA Statement on Vaccines and Related Biological Products Advisory Committee Meeting. U.S. Food and Drug Administration Website",
            "authors": [
                {
                    "first": "S",
                    "middle": [
                        "M"
                    ],
                    "last": "Hahn",
                    "suffix": ""
                },
                {
                    "first": "P",
                    "middle": [],
                    "last": "Marks",
                    "suffix": ""
                }
            ],
            "year": 2021,
            "venue": "",
            "volume": "",
            "issn": "",
            "pages": "",
            "other_ids": {}
        },
        "BIBREF10": {
            "ref_id": "b10",
            "title": "Vaccines and Related Biological Products Advisory Committee 17 December 2020 Meeting Announcement. U.S. Food and Drug Administration Website",
            "authors": [
                {
                    "first": "S",
                    "middle": [
                        "M"
                    ],
                    "last": "Hahn",
                    "suffix": ""
                },
                {
                    "first": "P",
                    "middle": [],
                    "last": "Marks",
                    "suffix": ""
                }
            ],
            "year": 2021,
            "venue": "",
            "volume": "",
            "issn": "",
            "pages": "",
            "other_ids": {}
        },
        "BIBREF11": {
            "ref_id": "b11",
            "title": "FDA Issues Emergency Use Authorization for Third COVID-19 Vaccine. U.S. Food and Drug Administration Website",
            "authors": [
                {
                    "first": "S",
                    "middle": [
                        "M"
                    ],
                    "last": "Hahn",
                    "suffix": ""
                },
                {
                    "first": "P",
                    "middle": [],
                    "last": "Marks",
                    "suffix": ""
                }
            ],
            "year": 2021,
            "venue": "",
            "volume": "",
            "issn": "",
            "pages": "",
            "other_ids": {}
        },
        "BIBREF12": {
            "ref_id": "b12",
            "title": "World Health Organization. COVID-19 Vaccine Tracker and Landscape. World Health Organization",
            "authors": [],
            "year": 2021,
            "venue": "",
            "volume": "",
            "issn": "",
            "pages": "",
            "other_ids": {}
        },
        "BIBREF13": {
            "ref_id": "b13",
            "title": "Motivators and barriers to vaccination of health professionals against seasonal influenza in primary healthcare",
            "authors": [
                {
                    "first": "D",
                    "middle": [],
                    "last": "Petek",
                    "suffix": ""
                },
                {
                    "first": "K",
                    "middle": [],
                    "last": "Kamnik-Jug",
                    "suffix": ""
                }
            ],
            "year": 2018,
            "venue": "BMC Health Serv. Res",
            "volume": "18",
            "issn": "",
            "pages": "",
            "other_ids": {
                "DOI": [
                    "10.1186/s12913-018-3659-8"
                ]
            }
        },
        "BIBREF14": {
            "ref_id": "b14",
            "title": "An mRNA Vaccine against SARS-CoV-2--Preliminary Report",
            "authors": [
                {
                    "first": "L",
                    "middle": [
                        "A"
                    ],
                    "last": "Jackson",
                    "suffix": ""
                },
                {
                    "first": "E",
                    "middle": [
                        "J"
                    ],
                    "last": "Anderson",
                    "suffix": ""
                },
                {
                    "first": "N",
                    "middle": [
                        "G"
                    ],
                    "last": "Rouphael",
                    "suffix": ""
                },
                {
                    "first": "P",
                    "middle": [
                        "C"
                    ],
                    "last": "Roberts",
                    "suffix": ""
                },
                {
                    "first": "M",
                    "middle": [],
                    "last": "Makhene",
                    "suffix": ""
                },
                {
                    "first": "R",
                    "middle": [
                        "N"
                    ],
                    "last": "Coler",
                    "suffix": ""
                },
                {
                    "first": "M",
                    "middle": [
                        "P"
                    ],
                    "last": "Cullough",
                    "suffix": ""
                },
                {
                    "first": "J",
                    "middle": [
                        "D"
                    ],
                    "last": "Chappell",
                    "suffix": ""
                },
                {
                    "first": "M",
                    "middle": [
                        "R"
                    ],
                    "last": "Denison",
                    "suffix": ""
                },
                {
                    "first": "L",
                    "middle": [
                        "J"
                    ],
                    "last": "Stevens",
                    "suffix": ""
                }
            ],
            "year": 2020,
            "venue": "N. Engl. J. Med",
            "volume": "383",
            "issn": "",
            "pages": "1920--1931",
            "other_ids": {
                "DOI": [
                    "10.1056/NEJMoa2022483"
                ]
            }
        },
        "BIBREF15": {
            "ref_id": "b15",
            "title": "Safety and Efficacy of the BNT162b2 mRNA Covid-19 Vaccine",
            "authors": [
                {
                    "first": "F",
                    "middle": [
                        "P"
                    ],
                    "last": "Polack",
                    "suffix": ""
                },
                {
                    "first": "S",
                    "middle": [
                        "J"
                    ],
                    "last": "Thomas",
                    "suffix": ""
                },
                {
                    "first": "N",
                    "middle": [],
                    "last": "Kitchin",
                    "suffix": ""
                },
                {
                    "first": "J",
                    "middle": [],
                    "last": "Absalon",
                    "suffix": ""
                },
                {
                    "first": "A",
                    "middle": [],
                    "last": "Gurtman",
                    "suffix": ""
                },
                {
                    "first": "S",
                    "middle": [],
                    "last": "Lockhart",
                    "suffix": ""
                },
                {
                    "first": "J",
                    "middle": [],
                    "last": "Perez",
                    "suffix": ""
                },
                {
                    "first": "G",
                    "middle": [],
                    "last": "Pérezmarc",
                    "suffix": ""
                },
                {
                    "first": "E",
                    "middle": [],
                    "last": "Moreira",
                    "suffix": ""
                },
                {
                    "first": "C",
                    "middle": [],
                    "last": "Zerbini",
                    "suffix": ""
                }
            ],
            "year": 2020,
            "venue": "N. Engl. J. Med",
            "volume": "383",
            "issn": "",
            "pages": "2603--2614",
            "other_ids": {
                "DOI": [
                    "10.1056/NEJMoa2034577"
                ]
            }
        },
        "BIBREF16": {
            "ref_id": "b16",
            "title": "Public Trust and Willingness to Vaccinate Against COVID-19 in the US From",
            "authors": [
                {
                    "first": "M",
                    "middle": [],
                    "last": "Daly",
                    "suffix": ""
                },
                {
                    "first": "A",
                    "middle": [],
                    "last": "Jones",
                    "suffix": ""
                },
                {
                    "first": "",
                    "middle": [
                        "E"
                    ],
                    "last": "Robinson",
                    "suffix": ""
                }
            ],
            "year": 2020,
            "venue": "",
            "volume": "325",
            "issn": "",
            "pages": "2397--2399",
            "other_ids": {
                "DOI": [
                    "10.1001/jama.2021.8246"
                ]
            }
        },
        "BIBREF17": {
            "ref_id": "b17",
            "title": "Readiness and Willingness to Provide Immunization Services after Pilot Vaccination Training: A Survey among Community Pharmacists Trained and Not Trained in Immunization during the COVID-19 Pandemic in Poland",
            "authors": [
                {
                    "first": "P",
                    "middle": [],
                    "last": "Merks",
                    "suffix": ""
                },
                {
                    "first": "U",
                    "middle": [],
                    "last": "Religioni",
                    "suffix": ""
                },
                {
                    "first": "K",
                    "middle": [],
                    "last": "Bilmin",
                    "suffix": ""
                },
                {
                    "first": "J",
                    "middle": [],
                    "last": "Lewicki",
                    "suffix": ""
                },
                {
                    "first": "M",
                    "middle": [],
                    "last": "Jakubowska",
                    "suffix": ""
                },
                {
                    "first": "W.-A",
                    "middle": [],
                    "last": "Walczuk",
                    "suffix": ""
                },
                {
                    "first": "A",
                    "middle": [],
                    "last": "Czerw",
                    "suffix": ""
                },
                {
                    "first": "J",
                    "middle": [],
                    "last": "Barańska",
                    "suffix": ""
                },
                {
                    "first": "P.-K",
                    "middle": [],
                    "last": "Rotman",
                    "suffix": ""
                },
                {
                    "first": "D",
                    "middle": [],
                    "last": "Świetlik",
                    "suffix": ""
                }
            ],
            "year": 2021,
            "venue": "Int. J. Environ. Res. Public Health",
            "volume": "18",
            "issn": "",
            "pages": "",
            "other_ids": {
                "DOI": [
                    "10.3390/ijerph18020599"
                ]
            }
        }
    },
    "ref_entries": {
        "FIGREF0": {
            "text": "Clinical data prioritized by pharmacists in vaccine decision-making (n = 616).",
            "latex": null,
            "type": "figure"
        },
        "FIGREF1": {
            "text": "Contributions: All authors contributed to the study conception and design. Material preparation, data collection and analysis were performed by S.S.J., N.N., M.B.B., H.K., S.S., R.K., M.T., H.R.J., and J.A.B.; the first draft of the manuscript was written by S.S.J.; all authors commented on previous versions of the manuscript. All authors have read and approved the final manuscript.",
            "latex": null,
            "type": "figure"
        },
        "TABREF0": {
            "text": "Baseline characteristics of survey respondents (n = 632).",
            "latex": null,
            "type": "table"
        },
        "TABREF1": {
            "text": "Pharmacists' decision for COVID-19 vaccination.",
            "latex": null,
            "type": "table"
        },
        "TABREF2": {
            "text": "Pharmacists' perceptions of COVID-19 and COVID-19 vaccines.",
            "latex": null,
            "type": "table"
        },
        "TABREF3": {
            "text": "Factors associated with pharmacists' willingness to receive COVID-19 vaccines.",
            "latex": null,
            "type": "table"
        },
        "TABREF4": {
            "text": "Factors associated with pharmacists' willingness to recommend COVID-19 vaccines.",
            "latex": null,
            "type": "table"
        }
    },
    "back_matter": [
        {
            "text": "The data presented in this article is not publicly available.",
            "cite_spans": [],
            "ref_spans": [],
            "section": "Data Availability Statement:"
        },
        {
            "text": "Mary Barna Bridgeman has served as a member of the AstraZeneca Speaker's Bureau. Sonia Jacob is a Rutgers/Janssen post-doctoral fellow within Medical Information Infectious Disease and Vaccines. The other authors declare that they have no known competing financial interests or personal relationships that have appeared to influence the work reported in this paper.",
            "cite_spans": [],
            "ref_spans": [],
            "section": "Conflicts of Interest:"
        }
    ]
}