{
    "paper_id": "0a128c938e41dcd9bc524902b8b09bf62ea9871f",
    "metadata": {
        "title": "Acupuncture as a complementary medicine for depression caused by the confinement by COVID-19. · Names (spelled out in full) of all authors and the institutions with which they are affiliated · Corresponding author details (name, e-mail address, mailing address, telephone and fax numbers)",
        "authors": [
            {
                "first": "Vique-Sánchez",
                "middle": [
                    "Jose"
                ],
                "last": "Luis",
                "suffix": "",
                "affiliation": {},
                "email": "jvique@uabc.edu.mx"
            }
        ]
    },
    "abstract": [
        {
            "text": "Ext: 40273 J o u r n a l P r e -p r o o f Journal Pre-proof Acupuncture as a complementary medicine for depression caused by the confinement by COVID-19.",
            "cite_spans": [],
            "ref_spans": [],
            "section": "Abstract"
        },
        {
            "text": "According to the WHO (World Health Organization), depression is a common disease throughout the world, and it is estimated that it affects approximately 350 million people. The COVID-19 pandemic has and will continue to have important consequences for mental health, which can cause a depressive state, with stress, anxiety, fear and grief that affect the entire population (with a higher prevalence and incidence in women), that are increased by confinements and social isolation.",
            "cite_spans": [],
            "ref_spans": [],
            "section": "Abstract"
        },
        {
            "text": "This study proposes the use of acupuncture as a therapeutic or complementary option to psychotherapies or pharmacotherapies, since here is showed that acupuncture is effective, safe and cheaper than the main treatments, to be able to treat people with some level of depression and to attend to and reduce the consequences that COVID-19, which acupuncture could be a complementary medicine that can help the health systems of countries.",
            "cite_spans": [],
            "ref_spans": [],
            "section": "Abstract"
        },
        {
            "text": "Journal Pre-proof",
            "cite_spans": [],
            "ref_spans": [],
            "section": "Abstract"
        },
        {
            "text": "It is necessary to offer therapeutics options that can attend the consequences that the current COVID-19 pandemic has generated, one of these consequences is depression (at different levels or degrees), which has developed in the healthy and sick population, so this study proposes the use of acupuncture as a therapeutic or complementary option to psychotherapies or pharmacotherapies, and acupuncture has a high probability of improving the therapeutic effects in the population 10 18 19 20 , therefore, acupuncture could be a complementary medicine that can help the health systems. As already mentioned, the effects of acupuncture can be seen and measured quickly (hours to days) 18 19 20 in addition to being safe, which would help J o u r n a l P r e -p r o o f Journal Pre-proof J o u r n a l P r e -p r o o f Journal Pre-proof J o u r n a l P r e -p r o o f Journal Pre-proof",
            "cite_spans": [],
            "ref_spans": [],
            "section": "Abstract"
        }
    ],
    "body_text": [
        {
            "text": "Acupuntura como medicina complementaria para la depresión causada por el confinamiento por COVID-19.",
            "cite_spans": [],
            "ref_spans": [],
            "section": ""
        },
        {
            "text": "Según la OMS (Organización Mundial de la Salud), la depresión es una enfermedad común en todo el mundo, y se estima que afecta aproximadamente a 350 millones de personas. La pandemia COVID-19 tiene y seguirá teniendo importantes consecuencias para la salud mental, que puede provocar un estado depresivo, con estrés, ansiedad, miedo y duelo que afectan a toda la población (con mayor prevalencia e incidencia en mujeres), que son aumentados por los confinamientos y el aislamiento social.",
            "cite_spans": [],
            "ref_spans": [],
            "section": "Resumen"
        },
        {
            "text": "Este estudio propone el uso de la acupuntura como opción terapéutica o complementaria a las psicoterapias o farmacoterapias, ya que aquí se demuestra que la acupuntura es efectiva, segura y más económica que los principales tratamientos, para poder tratar a personas con algún nivel de depresión, para atender y reducir las consecuencias del COVID-19, por lo que la acupuntura podría ser una medicina complementaria que puede ayudar a los sistemas de salud de los países. Currently there are several social factors 4 , and today, social networks are added 5 6 , that can aggravate depressive states in the most susceptible population sectors and even more due to the COVID-19 pandemic that the world has faced, which has also caused confinement in the population, increasing stress in the population and a high impact on activities economic. These The COVID-19 pandemic has and will continue to have important consequences for mental health, which can cause a depressive state, with stress, anxiety, fear and grief that affect the entire population (with a higher prevalence and incidence in women).",
            "cite_spans": [
                {
                    "start": 556,
                    "end": 559,
                    "text": "5 6",
                    "ref_id": null
                }
            ],
            "ref_spans": [],
            "section": "Resumen"
        },
        {
            "text": "Depression according to western-medicine (allopathic) is a mental disorder characterized by the presence of sadness, loss of interest or pleasure, feelings of guilt or lack of self-esteem, sleep or appetite disorders, feelings of fatigue and lack of concentration. This disorder can become chronic or recurrent and significantly impede performance at work or school and the ability to cope with daily life; and in its most serious form, it can lead to suicide (WHO 2020).",
            "cite_spans": [],
            "ref_spans": [],
            "section": "Resumen"
        },
        {
            "text": "J o u r n a l P r e -p r o o f",
            "cite_spans": [],
            "ref_spans": [],
            "section": "Resumen"
        },
        {
            "text": "For Traditional Chinese Medicine, the term used for depression is Yu, which has a double meaning \"depression\" and \"stagnation\", the latter being one of the pillars within the pathophysiology to promote the appearance of this pathology 9 10 . Finding therefore within its etiology emotional tensions, Yin and Yang disorders, weak constitution, irregular diet, which lead to the appearance of energy stagnation 11 , that generate a deficiency and alteration of the functions of energy, blood, organs and/or viscera that are important for the fundamentals of acupuncture; these factors favor the manifestation of various symptoms that correspond to a depressive state where there will be apathy, asthenia, adynamia, emotional lability, anxiety, lack of concentration, tachycardia, mental confusion, melancholy, among others 10 12 13 14 15 .",
            "cite_spans": [
                {
                    "start": 235,
                    "end": 239,
                    "text": "9 10",
                    "ref_id": null
                },
                {
                    "start": 409,
                    "end": 411,
                    "text": "11",
                    "ref_id": "BIBREF9"
                }
            ],
            "ref_spans": [],
            "section": "Depression according to Traditional Chinese Medicine"
        },
        {
            "text": "The use and promotion of acupuncture to attend for the population with depression due to COVID-19, Is acupuncture capable of improving mental health in this type of population?, since this pandemic has caused confinement in healthy and sick people of COVID-19 that has increased the risk factors (stress, anxiety, fear and grief) that predispose to developing depressive states. Therefore, health promotion campaigns could be developed against depression using acupuncture individually or as complementary medicine, and that the use of this therapeutic form can complement the usual treatments (psychotherapeutic and/or pharmacological) against depression. In this way, acupuncture could reduce the mental conditions that COVID-19 has developed and that many people continue with alterations in mental health. Therefore, it could be demonstrated that acupuncture has a therapeutic effect against depression, and/or synergistic with conventional treatments and that its use is also safe, proposing its use individually or in addition, promoting studies to evaluate its impact on the population.",
            "cite_spans": [],
            "ref_spans": [],
            "section": "Acupuncture at depression"
        },
        {
            "text": "In acupuncture treatment begins by determining the \"treatment principle\", based on the etiology that triggered the onset of depression, however, in general it is intended to address Other points that are also useful in depression to treat according to the \"treatment principle\"",
            "cite_spans": [],
            "ref_spans": [],
            "section": "Treating depression with acupuncture"
        },
        {
            "text": "and syndromic differentiation are: Taichong (L3), which harmonizes the energy of the Liver, drains heat, drains energy stagnation; Neiguan (Pc6) as an anxiolytic, regulates energy dynamics, useful in mental disorders; Shenmen (H7), clears the heart, calms the spirit and J o u r n a l P r e -p r o o f mind, regulates emotional activity mainly when there is fear, sadness and/or anxiety; Sanyinjiao (Sp6), harmonizes energy and blood, favors and protects the spleen, manages blood and fluids, tones the yin; Zusanli (St36), tones Spleen energy, regulates blood and energy 11 18 22 (Figure 1 ). The points mentioned fulfill specific functions which are useful for depression, taking their pathophysiology as a starting point; however, due to the ease of anatomical location of them, the Yintang (extra) and Baihui (DM20) points are easier to use and locate for health personnel who might apply them. J o u r n a l P r e -p r o o f",
            "cite_spans": [
                {
                    "start": 572,
                    "end": 580,
                    "text": "11 18 22",
                    "ref_id": null
                }
            ],
            "ref_spans": [
                {
                    "start": 581,
                    "end": 590,
                    "text": "(Figure 1",
                    "ref_id": "FIGREF2"
                }
            ],
            "section": "Treating depression with acupuncture"
        },
        {
            "text": "There are conventional treatment guidelines for depression, such as The Clinical Guide for the Management of Depression 23 , which mentions the algorithm and treatments to treat mild and moderate depression, also mentions that mainly psychotherapies and pharmacotherapies can be used, alone or in combination, depending on the severity of depression and if it is a chronic patient (more than 2 years with depression). In addition, the guide mentions that pharmacotherapy treatments can present therapeutic effects up to 16 weeks after use and in general, the patient must be told to wait between 2 to 3 months to see improvement 23 .",
            "cite_spans": [
                {
                    "start": 629,
                    "end": 631,
                    "text": "23",
                    "ref_id": "BIBREF19"
                }
            ],
            "ref_spans": [],
            "section": "Advantages of Acupuncture over conventional treatments"
        },
        {
            "text": "Another point against pharmacotherapy is that treatment must be continued sometimes up to 6 months after the remission of the depression. This shows us that they can be side effects of each drug, as well as the costs that they represent for the patient when consuming them for a long time.",
            "cite_spans": [],
            "ref_spans": [],
            "section": "Advantages of Acupuncture over conventional treatments"
        },
        {
            "text": "The works consulted have described the mechanism of action, as well as the therapeutic effects in animals and humans, demonstrating the favorable effect of acupuncture in approximately 3000 people 10 18 20 , it is important to note that with acupuncture the therapeutic effects can be seen, feeling and measured faster than with conventional therapeutic forms, as well as more safety when using acupuncture. All this shows that acupuncture could be more favorable than inconvenient and that the use of acupuncture against depression could be promoted.",
            "cite_spans": [
                {
                    "start": 197,
                    "end": 205,
                    "text": "10 18 20",
                    "ref_id": null
                }
            ],
            "ref_spans": [],
            "section": "Advantages of Acupuncture over conventional treatments"
        },
        {
            "text": "the patient to feel motivated to continue the treatment, as well as to promote the use of this therapeutic form. Another advantage is the low cost with which this treatment can be offered to the patient, compared to the psychotherapeutic and pharmacological options.",
            "cite_spans": [],
            "ref_spans": [],
            "section": "Conclusions"
        },
        {
            "text": "The authors declare that they have no conflict of interest.",
            "cite_spans": [],
            "ref_spans": [],
            "section": "Conflicts of interest/Competing interests"
        }
    ],
    "bib_entries": {
        "BIBREF0": {
            "ref_id": "b0",
            "title": "Depresión: estado del conocimiento y la necesidad de políticas públicas y planes de acción en México",
            "authors": [
                {
                    "first": "S",
                    "middle": [],
                    "last": "Berenzon",
                    "suffix": ""
                },
                {
                    "first": "Asunción",
                    "middle": [],
                    "last": "Lara",
                    "suffix": ""
                },
                {
                    "first": "M",
                    "middle": [],
                    "last": "Robles",
                    "suffix": ""
                },
                {
                    "first": "R",
                    "middle": [],
                    "last": "Medina-Mora",
                    "suffix": ""
                },
                {
                    "first": "M",
                    "middle": [
                        "E"
                    ],
                    "last": "",
                    "suffix": ""
                }
            ],
            "year": 2013,
            "venue": "Salud Pública de México",
            "volume": "55",
            "issn": "",
            "pages": "",
            "other_ids": {}
        },
        "BIBREF1": {
            "ref_id": "b1",
            "title": "Psychiatric disorders in Mexico: lifetime prevalence in a nationally representative sample. The British journal of psychiatry : the journal of mental science",
            "authors": [
                {
                    "first": "M",
                    "middle": [
                        "E"
                    ],
                    "last": "Medina-Mora",
                    "suffix": ""
                },
                {
                    "first": "G",
                    "middle": [],
                    "last": "Borges",
                    "suffix": ""
                },
                {
                    "first": "C",
                    "middle": [],
                    "last": "Benjet",
                    "suffix": ""
                },
                {
                    "first": "C",
                    "middle": [],
                    "last": "Lara",
                    "suffix": ""
                },
                {
                    "first": "P",
                    "middle": [],
                    "last": "Berglund",
                    "suffix": ""
                }
            ],
            "year": 2007,
            "venue": "",
            "volume": "190",
            "issn": "",
            "pages": "521--529",
            "other_ids": {}
        },
        "BIBREF2": {
            "ref_id": "b2",
            "title": "Una revisión crítica del modelo atributivo de la depresión",
            "authors": [
                {
                    "first": "J",
                    "middle": [
                        "L"
                    ],
                    "last": "Álvaro-Estramiana",
                    "suffix": ""
                },
                {
                    "first": "A",
                    "middle": [],
                    "last": "Garrido-Luque",
                    "suffix": ""
                },
                {
                    "first": "I",
                    "middle": [],
                    "last": "Schweiger-Gallo",
                    "suffix": ""
                }
            ],
            "year": 2010,
            "venue": "Revista Internacional de Sociología",
            "volume": "68",
            "issn": "2",
            "pages": "333--381",
            "other_ids": {}
        },
        "BIBREF3": {
            "ref_id": "b3",
            "title": "When Social Networking Is Not Working",
            "authors": [
                {
                    "first": "A",
                    "middle": [
                        "L"
                    ],
                    "last": "Forest",
                    "suffix": ""
                },
                {
                    "first": "J",
                    "middle": [
                        "V"
                    ],
                    "last": "Wood",
                    "suffix": ""
                }
            ],
            "year": 2012,
            "venue": "Psychological Science",
            "volume": "23",
            "issn": "3",
            "pages": "295--302",
            "other_ids": {
                "DOI": [
                    "10.1177/0956797611429709"
                ]
            }
        },
        "BIBREF4": {
            "ref_id": "b4",
            "title": "Technogenic flourishing: a mixed methods inquiry into the impact of variable rewards on Facebook users' well-being. California Institute of Integral Studies",
            "authors": [
                {
                    "first": "T",
                    "middle": [],
                    "last": "Lucking",
                    "suffix": ""
                }
            ],
            "year": 2015,
            "venue": "",
            "volume": "",
            "issn": "",
            "pages": "",
            "other_ids": {}
        },
        "BIBREF5": {
            "ref_id": "b5",
            "title": "International Mental Health perspectives on the novel coronavirus SARS-CoV-2 pandemic. Revista de psiquiatria y salud mental",
            "authors": [
                {
                    "first": "J",
                    "middle": [
                        "E"
                    ],
                    "last": "Ibáñez-Vizoso",
                    "suffix": ""
                },
                {
                    "first": "Í",
                    "middle": [],
                    "last": "Alberdi-Páramo",
                    "suffix": ""
                },
                {
                    "first": "M",
                    "middle": [],
                    "last": "Díaz-Marsá",
                    "suffix": ""
                }
            ],
            "year": null,
            "venue": "",
            "volume": "13",
            "issn": "",
            "pages": "111--114",
            "other_ids": {}
        },
        "BIBREF6": {
            "ref_id": "b6",
            "title": "Mental health in the Americas: an overview of the treatment gap. Revista Panamericana de Salud Pública",
            "authors": [
                {
                    "first": "R",
                    "middle": [],
                    "last": "Kohn",
                    "suffix": ""
                },
                {
                    "first": "A",
                    "middle": [
                        "A"
                    ],
                    "last": "Ali",
                    "suffix": ""
                },
                {
                    "first": "V",
                    "middle": [],
                    "last": "Puac-Polanco",
                    "suffix": ""
                },
                {
                    "first": "C",
                    "middle": [],
                    "last": "Figueroa",
                    "suffix": ""
                },
                {
                    "first": "V",
                    "middle": [],
                    "last": "López-Soto",
                    "suffix": ""
                },
                {
                    "first": "K",
                    "middle": [],
                    "last": "Morgan",
                    "suffix": ""
                }
            ],
            "year": 2018,
            "venue": "Internet]",
            "volume": "42",
            "issn": "",
            "pages": "",
            "other_ids": {}
        },
        "BIBREF7": {
            "ref_id": "b7",
            "title": "The practice of Chinese Medicine",
            "authors": [
                {
                    "first": "G",
                    "middle": [],
                    "last": "Maciocia",
                    "suffix": ""
                }
            ],
            "year": 2015,
            "venue": "",
            "volume": "",
            "issn": "",
            "pages": "",
            "other_ids": {}
        },
        "BIBREF8": {
            "ref_id": "b8",
            "title": "Acupuncture for Depression: A Review of Clinical Applications. The Canadian Journal of Psychiatry",
            "authors": [
                {
                    "first": "J",
                    "middle": [],
                    "last": "Wu",
                    "suffix": ""
                },
                {
                    "first": "A",
                    "middle": [
                        "S"
                    ],
                    "last": "Yeung",
                    "suffix": ""
                },
                {
                    "first": "R",
                    "middle": [],
                    "last": "Schnyer",
                    "suffix": ""
                },
                {
                    "first": "Y",
                    "middle": [],
                    "last": "Wang",
                    "suffix": ""
                },
                {
                    "first": "D",
                    "middle": [],
                    "last": "Mischoulon",
                    "suffix": ""
                }
            ],
            "year": 2012,
            "venue": "",
            "volume": "57",
            "issn": "",
            "pages": "397--405",
            "other_ids": {
                "DOI": [
                    "10.1177/070674371205700702"
                ]
            }
        },
        "BIBREF9": {
            "ref_id": "b9",
            "title": "Escuela Superior de Medicina Tradicional China. Acupuntura -Medicina Interna",
            "authors": [
                {
                    "first": "Ping",
                    "middle": [
                        "L"
                    ],
                    "last": "El Gran Libro De La",
                    "suffix": ""
                },
                {
                    "first": "Medicina",
                    "middle": [],
                    "last": "China",
                    "suffix": ""
                }
            ],
            "year": 2002,
            "venue": "",
            "volume": "",
            "issn": "",
            "pages": "261--277",
            "other_ids": {}
        },
        "BIBREF11": {
            "ref_id": "b11",
            "title": "Major Depression in Chinese Medicine Outpatients with Stagnation Syndrome: Prevalence and the Impairments in Well-Being. Evidence-Based Complementary and Alternative Medicine",
            "authors": [
                {
                    "first": "S-M",
                    "middle": [],
                    "last": "Ng",
                    "suffix": ""
                },
                {
                    "first": "L-L",
                    "middle": [],
                    "last": "Leng",
                    "suffix": ""
                }
            ],
            "year": 2018,
            "venue": "Revista Internacional de Acupuntura",
            "volume": "2018",
            "issn": "",
            "pages": "1--9",
            "other_ids": {}
        },
        "BIBREF12": {
            "ref_id": "b12",
            "title": "Curative effect of acupuncture on quality of life in patient with depression: a clinical randomized single-blind placebo-controlled study",
            "authors": [
                {
                    "first": "F",
                    "middle": [],
                    "last": "Ling",
                    "suffix": ""
                },
                {
                    "first": "F",
                    "middle": [],
                    "last": "Wenbin",
                    "suffix": ""
                },
                {
                    "first": "C",
                    "middle": [],
                    "last": "Zhao",
                    "suffix": ""
                },
                {
                    "first": "X",
                    "middle": [],
                    "last": "Nenggui",
                    "suffix": ""
                },
                {
                    "first": "L",
                    "middle": [],
                    "last": "Jianhua",
                    "suffix": ""
                },
                {
                    "first": "L",
                    "middle": [],
                    "last": "Aiping",
                    "suffix": ""
                }
            ],
            "year": 2016,
            "venue": "Journal of Traditional Chinese Medicine",
            "volume": "36",
            "issn": "2",
            "pages": "151--160",
            "other_ids": {}
        },
        "BIBREF13": {
            "ref_id": "b13",
            "title": "Effect of Acupuncture on Chronic Pain with Depression: A Systematic Review. Evidence-Based Complementary and Alternative Medicine",
            "authors": [
                {
                    "first": "B",
                    "middle": [],
                    "last": "Yan",
                    "suffix": ""
                },
                {
                    "first": "S",
                    "middle": [],
                    "last": "Zhu",
                    "suffix": ""
                },
                {
                    "first": "Y",
                    "middle": [],
                    "last": "Wang",
                    "suffix": ""
                },
                {
                    "first": "G",
                    "middle": [],
                    "last": "Da",
                    "suffix": ""
                },
                {
                    "first": "G",
                    "middle": [],
                    "last": "Tian",
                    "suffix": ""
                }
            ],
            "year": 2020,
            "venue": "",
            "volume": "2020",
            "issn": "",
            "pages": "1--10",
            "other_ids": {}
        },
        "BIBREF14": {
            "ref_id": "b14",
            "title": "Acupuncture for Treating Anxiety and Depression in Women: A Clinical Systematic Review",
            "authors": [
                {
                    "first": "D",
                    "middle": [
                        "P"
                    ],
                    "last": "Sniezek",
                    "suffix": ""
                },
                {
                    "first": "I",
                    "middle": [
                        "J"
                    ],
                    "last": "Siddiqui",
                    "suffix": ""
                }
            ],
            "year": 2013,
            "venue": "",
            "volume": "25",
            "issn": "",
            "pages": "164--72",
            "other_ids": {
                "DOI": [
                    "10.1089/acu.2012.0900"
                ]
            }
        },
        "BIBREF15": {
            "ref_id": "b15",
            "title": "Acupuncture for Depression: A Systematic Review and Meta-Analysis",
            "authors": [
                {
                    "first": "M",
                    "middle": [],
                    "last": "Armour",
                    "suffix": ""
                },
                {
                    "first": "C",
                    "middle": [
                        "A"
                    ],
                    "last": "Smith",
                    "suffix": ""
                },
                {
                    "first": "L-Q",
                    "middle": [],
                    "last": "Wang",
                    "suffix": ""
                },
                {
                    "first": "D",
                    "middle": [],
                    "last": "Naidoo",
                    "suffix": ""
                },
                {
                    "first": "G-Y",
                    "middle": [],
                    "last": "Yang",
                    "suffix": ""
                },
                {
                    "first": "H",
                    "middle": [],
                    "last": "Macpherson",
                    "suffix": ""
                }
            ],
            "year": 2019,
            "venue": "Journal of Clinical Medicine",
            "volume": "8",
            "issn": "8",
            "pages": "",
            "other_ids": {}
        },
        "BIBREF16": {
            "ref_id": "b16",
            "title": "Electroacupuncture at 2/100 Hz Activates Antinociceptive Spinal Mechanisms Different from Those Activated by Electroacupuncture at 2 and 100",
            "authors": [
                {
                    "first": "Josie Resende Torres Da",
                    "middle": [],
                    "last": "Silva",
                    "suffix": ""
                },
                {
                    "first": "Marcelo",
                    "middle": [],
                    "last": "Lourenço Da Silva",
                    "suffix": ""
                },
                {
                    "first": "Wap",
                    "middle": [],
                    "last": "",
                    "suffix": ""
                }
            ],
            "year": null,
            "venue": "",
            "volume": "",
            "issn": "",
            "pages": "",
            "other_ids": {}
        },
        "BIBREF18": {
            "ref_id": "b18",
            "title": "Yuxin He FG-L. Anxiolytic-like behavioural effects of head electroacupuncture in rats susceptible to stress",
            "authors": [
                {
                    "first": "Jia",
                    "middle": [],
                    "last": "Chen",
                    "suffix": ""
                },
                {
                    "first": "W",
                    "middle": [],
                    "last": "Douglas",
                    "suffix": ""
                },
                {
                    "first": "",
                    "middle": [],
                    "last": "Barrett",
                    "suffix": ""
                }
            ],
            "year": 2016,
            "venue": "Acupunct Med",
            "volume": "34",
            "issn": "",
            "pages": "235--275",
            "other_ids": {}
        },
        "BIBREF19": {
            "ref_id": "b19",
            "title": "Guia Clinica para el Manejo de la depresión",
            "authors": [
                {
                    "first": "G",
                    "middle": [],
                    "last": "Heinze",
                    "suffix": ""
                },
                {
                    "first": "P",
                    "middle": [],
                    "last": "Camacho",
                    "suffix": ""
                }
            ],
            "year": 2010,
            "venue": "",
            "volume": "",
            "issn": "",
            "pages": "",
            "other_ids": {}
        }
    },
    "ref_entries": {
        "FIGREF0": {
            "text": "consequences have shown that it is necessary to carry out research to know the effects on the mental health of the population due to the pandemic of the SARS-CoV-2 virus (COVID-19), since there are studies that indicate an important psychological impact on the population, which can range from psychological distress to post-traumatic stress disorder and other disorders7 8  .",
            "latex": null,
            "type": "figure"
        },
        "FIGREF1": {
            "text": "in energy, blood, organs and/or viscera. The different causes that are described and attended in acupuncture are energy stagnation, regulation of the energy dynamics of the Liver, eliminating humidity, transforming phlegm, toning and nourishing the Spleen and Heart, also nourishing and toning the blood and energy, being one of the main objectives to regulate the Shen9 11 15  . Some of the points that are useful in depression are the Yintang (extra) andBaihui (DM20), since some of their actions are to improve energy, clear the mind, calm the spirit and balance the function of the Liver 13 . On the other hand, studies have been carried out where in animal models the efficacy of the application of these acupuncture points for depression has been verified, for example, it is reported that in a murine model of induceddepression after applying electroacupuncture (EA) in the Yintang (extra) and Baihui (DM20) points during 14 sessions, signs and signs of a decrease in depression and an increase in the search to preserve life were determined, observing survival behaviors, compared to the group that received sham acupuncture (simulated), where the mice presented behaviors indicative of depression, decreased interest in continuing to live and presented a decrease in body weight 16 . As well as reports with patients with depression 10 17 18 , clearly the acupuncture groups improve on different criteria with respect to the control groups. Anxiety and depression have a high prevalence, especially in the female population and also pregnant women 19 , where also acupuncture showed clinically significant reductions in the severity of depression compared to conventional treatments 20 , with which changes observed in the symptoms and behavior of patients can be related to the effect of acupuncture. These results can be justified since it is described that serotonin (5-HT) released by the fibers of the nucleus of the raphe magnum, activates encephalinergic and GABAergic spinal neurons, while cholinergic and GABAergic spinal neurons are activated by norepinephrine (NE) released by noradrenergic fibers, these stimuli activated by acupuncture and EA may differ according to the frequency of the stimulation, at low frequency EA (<15Hz) increases the spinal release of methencephalins, endomorphins and beta-endorphins, while high EA frequency (15 to 100Hz) increases spinal dynorphin release 21 .",
            "latex": null,
            "type": "figure"
        },
        "FIGREF2": {
            "text": "Acupuncture points and initial algorithm for the treatment of depression with acupuncture.",
            "latex": null,
            "type": "figure"
        },
        "TABREF0": {
            "text": "Palabras clave: Acupuntura, COVID-19, Depresión, Confinamiento, Antidepresivos.According to the WHO (World Health Organization), depression is a common disease throughout the world, and it is estimated that it affects approximately 350 million people. It is an important health problem in the population, especially when it is of long duration and",
            "latex": null,
            "type": "table"
        }
    },
    "back_matter": [
        {
            "text": "The authors are very grateful for the financial support from PRODEP-SEP, SNI-CONACyT, GGF, FMM-UABC and Dr. José Manuel Avendaño Reyes.",
            "cite_spans": [],
            "ref_spans": [],
            "section": "Acknowledgments"
        }
    ]
}