{
    "paper_id": "0a17c29d621aec169d45a736426fd69e361b7c93",
    "metadata": {
        "title": "Additional file 3 : Comparison of country health profiles (i.e., GBD metric) with national health statistics in European Countries",
        "authors": []
    },
    "abstract": [],
    "body_text": [
        {
            "text": "Background: The country profiles provide a measure of priority health conditions and risk factors, a summary breakdown of major causes, and an appreciation of health sector performance, according to the GBD methodology. The main objectives of this study were to compare the way GBD identifies top priorities in health outcomes, risk factors and health sector performance, with a country's assessment based on their national health reporting and to identify the potential differences in estimates due to different data sources and methods used by countries producing their own BoD estimates.",
            "cite_spans": [],
            "ref_spans": [],
            "section": "Executive summary"
        },
        {
            "text": "Methods: Using the 'standard' GBD metrics available in the GBD 2017 study, we have produced a series of country health profiles of European countries. All charts have been produced using the same R code. We uploaded them on an interactive website created only for 'Country Health Profiles' and shared with 30 countries with an electronic link. The survey participants were from public health institutes and were involved in burden of disease activities in their country.",
            "cite_spans": [],
            "ref_spans": [],
            "section": "Executive summary"
        },
        {
            "text": "The response rate was 76 % (23/30). This comparison highlighted that in the majority of countries the priority health conditions and risk factors based on national health statistics correspond to the IHME ranking of health conditions. However, in some European countries, certain differences were identified such as in France, the trend of musculoskeletal disorders, mental health and neurological diseases to the disability has changed since 2010 and occupational risks are underestimated by IHME. In Romania, mortality rates for cardiovascular diseases and cancer are under-estimated by IHME as compared to national statistics and premature mortality for cardiovascular diseases are over-estimated by IHME. In Serbia, mortality rates for cardiovascular and respiratory diseases were under-estimated by IHME as compared to the Serbian BoD study in 2000. In Scotland, the mortality rates due to substance use have higher numbers in the national death register compared to those used by IHME. Some countries reported additional data sources used by the individual country for national health reporting not enlisted in IHME list. The countries who calculate their own BoD estimates mentioned that choice of a standard population and the use of different methodological choices could influence the estimates.",
            "cite_spans": [],
            "ref_spans": [],
            "section": "Results:"
        },
        {
            "text": "Our results highlighted some variations in ranking of health conditions and risk factors by comparing IHME estimates with individual countries assessments based on their national health reporting. Very few countries have a complete BoD assessment, i.e. comprehensive, updated, and repeated over time to identify trends. For countries who develop their own BoD study, the inter-country comparability remains an issue due to different data sources, choice of a standard population and different methodological approaches applied.",
            "cite_spans": [],
            "ref_spans": [],
            "section": "Conclusions:"
        },
        {
            "text": "Keywords: Burden of disease; Mortality; Morbidity; DALYs; Risk factors; GBD metrics",
            "cite_spans": [],
            "ref_spans": [],
            "section": "Conclusions:"
        },
        {
            "text": "• The importance of key aspects such as good quality data sources, choice of a standard population and different methodological choices used to calculate BoD estimates, can influence the estimates and the ranking of diseases and risk factors.",
            "cite_spans": [],
            "ref_spans": [],
            "section": "Key points"
        },
        {
            "text": "• Building analytical capacity and awareness of different methodological approaches are necessary for developing national BoD studies.",
            "cite_spans": [],
            "ref_spans": [],
            "section": "Key points"
        },
        {
            "text": "• The comparability and consistency of estimates across diseases are essential to estimating BoD estimates and can strongly influence the local, national and European levels policy decisions.",
            "cite_spans": [],
            "ref_spans": [],
            "section": "Key points"
        },
        {
            "text": "• A European data infrastructure is required, to support development of the European BoD estimates that would facilitate sharing similar data sources and common methods used to calculate BoD estimates at EU-level.",
            "cite_spans": [],
            "ref_spans": [],
            "section": "Key points"
        },
        {
            "text": "The country profiles provide a measure of priority health conditions and risk factors, a summary breakdown of major causes, and an appreciation of health sector performance, according to the GBD methodology [1] . This approach highlights the usefulness and possible applications of a standardized, comprehensive methodology in Burden of Disease assessment and allows a standardized comparison with European peer countries. However, most of the European countries do not produce GBD-metrics (YLLs, YLDs, DALYs). Therefore, we intend to compare the ranking of priorities in diseases and risk factors, using GBD metrics (as provided by the Country Health Profile developed using the Institute for Health Metrics and Evaluation methodology), to the ranking of a country's standard metrics (mortality, morbidity rates, risk factor prevalence, etc.). For example, the national ranking of a given country could be based on risk factor prevalence showing that smoking is its main health problem, whereas GBDmetrics (i.e., DALYs attributable to risk factors) may show that alcohol is more important. No attempt has been made to provide a detailed background narrative to the findings of country health profiles.",
            "cite_spans": [
                {
                    "start": 207,
                    "end": 210,
                    "text": "[1]",
                    "ref_id": "BIBREF0"
                }
            ],
            "ref_spans": [],
            "section": "I. Background"
        },
        {
            "text": "The main objectives of this study were to compare the way GBD identifies top priorities in risk factors, health outcomes and health sector performance, with a country's assessment based on their national health reporting and to identify the potential differences in estimates/trends due to different data sources and methods used by countries producing their own BoD estimates.",
            "cite_spans": [],
            "ref_spans": [],
            "section": "II. Objectives"
        },
        {
            "text": "Using the 'standard' GBD metrics, we have produced a series of country health profiles. All charts have been produced using the same R code, as an example of Public Health England's Reproducible Analytical Pipelines procedures. All data used are publicly available, at https://vizhub.healthdata.org/gbd-compare/ and http://ghdx.healthdata.org/gbd-resultstool. Almost, 80,000 different data sources were used to produce these country health profiles. The information on data sources can be found here: http://ghdx.healthdata.org/gbd-2017/data-input-sources. After producing the charts for country health profiles of European countries, we uploaded them on an interactive website created only for 'Country Health Profiles' (https://espaces.santepubliquefrance.fr/espace_projets/Accueil/gbd). A username and password was provided to each country, accessing this website of country health profiles and uploading their comments.",
            "cite_spans": [],
            "ref_spans": [],
            "section": "III. Methodology"
        },
        {
            "text": "A brief description of GBD metrics was used to describe country health profiles with an example of the England country health profile (additional file 1) and shared with the participants. An invitation email was sent on February 5, 2020 to 30 European countries to compare their country health profile with their country's current assessment based on their national reporting. The survey participants were from public health institutes and were involved in burden of disease activities in their country. The abbreviation of the countries' names are reported in additional file 2. One following reminder was sent to the nonrespondents to submit their comments on June 8, 2020. The 30 country health profiles are reported in additional file 3.",
            "cite_spans": [],
            "ref_spans": [],
            "section": "III. Methodology"
        },
        {
            "text": "We received the comments from 23 countries with a response rate of 76% (23/30). These results are reported under following sections: A. Comments on country health profiles and the potential differences in estimates/trends and B. Additional data sources used by the countries for national health reporting.",
            "cite_spans": [],
            "ref_spans": [],
            "section": "IV. Results"
        },
        {
            "text": "We described the comments on country health profiles by taking into account the IHME estimations and the national health statistics of each country. Some countries mentioned potential underlying factors explaining the differences between GBD estimates and their country results. The countries did not calculate these estimates to compare with their national health statistics.",
            "cite_spans": [],
            "ref_spans": [],
            "section": "A. Comments on country health profiles and potential differences in estimates/trends"
        },
        {
            "text": "Here is the summary of country health profiles including life expectancy, mortality, premature mortality, morbidity, DALYs, risk factors, DALYs breakdown and Health Care Access and Quality Index in European countries: IHME estimates also highlight that the neurological disorders (i.e., Alzheimer's, dementia, etc.) are the third most contributing factor to the burden of mortality in all European countries except in Cyprus, where mortality rates due to diabetes mellitus is the third most contributing factor to the burden of mortality. Since 1990, the mortality rates for neurological diseases were nearly unchanged in all European countries, which could be explained due to lack of new treatments and ageing population.",
            "cite_spans": [],
            "ref_spans": [],
            "section": "A. Comments on country health profiles and potential differences in estimates/trends"
        },
        {
            "text": "Potential difference in mortality estimates/trend: In Belgium, according to national estimates developed using the SPMA procedure (standardized procedure mortality analysis: https://spma.wiv-isp.be/SitePages/Home.aspx) in 2016, cardiovascular diseases are ranked as the top contributing factor to the burden of morality by using the European standard population as a reference population. However, by changing the reference population from European Standard Population to the World Standard Population, this ranking changes and cancer mortality rates have become the first contributing factor to the burden of mortality as used by IHME. The estimates calculated by SPMA do not take into account the redistribution of ill-defined codes. In Estonia, the mortality rate for neurological disorders have grown year by year but according to the European standard population the rate for injuries (unintentional and intentional self-harm) are higher than the rate for neurological disorders and there are more respiratory infections than neurological disorders. In Romania, an important difference was observed i.e., the mortality rates for cardiovascular diseases are below 400/100,000 according to IHME estimates but according to national health statistics, these estimates are higher, and slightly decreasing from 725 in 1999 to 677 in 2017, respectively. The mortality rates for cancer are increasing from 173 in 1999 to 233 in 2017 according to national statistics but these mortality rates are less than 200 according to IHME estimates. In Serbia, mortality rates for cardiovascular and respiratory diseases were underestimated by IHME as compared to the Serbian BoD study in 2000 due to different methods of estimation. In Scotland, the mortality rates in 2013 and 2016 due to substance use had higher numbers in national death register. The reason for this increase was due to use of an expanded set of ICD codes for drug related deaths. In Spain, the national health statistics reported an increase in mortality rates of respiratory and neurological diseases between 2010 and 2017 whereas according to IHME these mortality rates are decreasing.",
            "cite_spans": [],
            "ref_spans": [],
            "section": "A. Comments on country health profiles and potential differences in estimates/trends"
        },
        {
            "text": "According to the IHME estimates, cardiovascular and cancer are the major diseases contributing to the YLL in European countries. The mortality rates of these two health conditions have a decreasing trend from 1990 to 2017. The majority of the countries who do not calculate their BoD estimates, confirm that the trend of cardiovascular and cancer correspond to their national health statistics.",
            "cite_spans": [],
            "ref_spans": [],
            "section": "Age-standardized Years of Life Lost [YLL] 1990 -2017 (Figure 3)"
        },
        {
            "text": "In Romania, during 1990-2017, there is an important difference in premature mortality due to cardiovascular diseases with a decreasing trend from 7000+ to 5000+ in IHME data and a decreasing trend from 5000+ to 3000 according to national statistics. Moreover, the premature mortality estimates for cancer are slightly higher at the beginning of the previously mentioned period.",
            "cite_spans": [],
            "ref_spans": [],
            "section": "Age-standardized Years of Life Lost [YLL] 1990 -2017 (Figure 3)"
        },
        {
            "text": "In Slovenia, the premature mortality is decreasing in Slovenia and in 2018, the main contributor was the cancer premature mortality (44%) and followed by cardiovascular diseases (17%).",
            "cite_spans": [],
            "ref_spans": [],
            "section": "Age-standardized Years of Life Lost [YLL] 1990 -2017 (Figure 3)"
        },
        {
            "text": "Potential challenges to compare YLL estimates: Some countries who are performing their BoD studies mentioned following challenges to compare the national YLL estimates, with the IHME estimated YLL:",
            "cite_spans": [],
            "ref_spans": [],
            "section": "Age-standardized Years of Life Lost [YLL] 1990 -2017 (Figure 3)"
        },
        {
            "text": "• The national YLL estimates are calculated without taking into account the redistribution of ill-defined codes (Belgium). As well a different methodology of redistributing ill-defined codes may be applied (Germany). • Changing the reference population to World or European Standard Population influences the ranking of diseases contributing to YLL (Belgium, Estonia, Scotland). Belgium and Scotland used the European standard population as a reference.",
            "cite_spans": [],
            "ref_spans": [],
            "section": "Age-standardized Years of Life Lost [YLL] 1990 -2017 (Figure 3)"
        },
        {
            "text": "• The use of national life tables and population LE influences the ranking of diseases contributing to YLL (Estonia, Germany, Scotland).",
            "cite_spans": [],
            "ref_spans": [],
            "section": "Age-standardized Years of Life Lost [YLL] 1990 -2017 (Figure 3)"
        },
        {
            "text": "• Mortality rates for cardiovascular and respiratory diseases were underestimated by IHME as compared to the Serbian BoD studies due to different methods of estimation in 2000 (Serbia).",
            "cite_spans": [],
            "ref_spans": [],
            "section": "Age-standardized Years of Life Lost [YLL] 1990 -2017 (Figure 3)"
        },
        {
            "text": "This is not a common indicator used in the European countries. According to IHME estimates, musculoskeletal disorders, mental health and neurological diseases are the main health conditions contributing to disability in the majority of European countries. In some countries, unintentional injuries are either second (CZ, HU, PL, RO, SK) or third (BG, EE, LT, LV) main contributors to disability (i.e., YLD) until 2017. The overall trend of various health conditions contributing to YLD estimates remained unchanged during 1990 -2017. It is noteworthy that among all European countries, the trend of musculoskeletal disorders and neurological diseases remains unchanged almost over the last three decades according to the IHME estimates. This has a strong impact on disability and may influence increased use of rehabilitation services, absence from work, sick leave or early retirement.",
            "cite_spans": [],
            "ref_spans": [],
            "section": "Age-standardized Years Lived with Disability [YLD] 1990 -2017 (Figure 4)"
        },
        {
            "text": "According to the Estonian BoD study in 2015 and 2017, there were top four diseases contributing to the YLDs: 1. Circulatory diseases, 2. Musculoskeletal disorders, 3. Neoplasms and 4. Sense organ diseases. Neurological disorders are often underestimated in Estonia due to poor knowledge of diagnosing Alzheimer's., Slovenia reported that according to national health statistics, the diabetes and kidney diseases are the second main contributor to the morbidity and this estimate fluctuate over this period, which may be due to more systematic implementation of prevention programs.",
            "cite_spans": [],
            "ref_spans": [],
            "section": "Age-standardized Years Lived with Disability [YLD] 1990 -2017 (Figure 4)"
        },
        {
            "text": "The countries who are performing their own BoD studies reported that the comparison of national YLDs estimates with IHME is challenging due to following reasons: use of different data sources, different methods used for agestandardized rates, differences in prevalence rates, estimation of country specific severity distributions and duration parameters.",
            "cite_spans": [],
            "ref_spans": [],
            "section": "Potential challenges to compare YLD:"
        },
        {
            "text": "Potential difference in YLD estimates/trend: In France, the evolution of musculoskeletal disorders, mental health and neurological diseases contributing to the disability has changed since 2010 as compared to the IHME trends.",
            "cite_spans": [],
            "ref_spans": [],
            "section": "Potential challenges to compare YLD:"
        },
        {
            "text": "DALYs are not yet produced in the majority of European countries; therefore, the comparison with IHME estimates was not possible. Potential challenges when comparing DALYs: Estonia, Germany, Scotland and Serbia who produce their own BoD estimates, mentioned that due to different standard populations and methodological approaches, the direct comparison of their estimates with IHME is not possible.",
            "cite_spans": [],
            "ref_spans": [],
            "section": "Age-standardized DALYs 1990 -2017 (Figure 5)"
        },
        {
            "text": "According to IHME, in majority of the European countries, the contribution of individual risk factors (i.e., 19) to the overall burden (i.e., DALYs) show a steady decrease over this period. According to the 3-category structure of risks used by GBD, the following are the risk factors whose contribution to the DALYs changes slightly over this period:",
            "cite_spans": [],
            "ref_spans": [],
            "section": "Age-standardized DALYs due to known risk factors 1990 -2017 (Figure 6)"
        },
        {
            "text": "1. Behavioural risk factors including alcohol use, dietary risks, low physical activity, tobacco use and unsafe sex. 2. Metabolic risk factors including, high LDL-cholesterol and high systolic blood pressure.",
            "cite_spans": [],
            "ref_spans": [],
            "section": "Age-standardized DALYs due to known risk factors 1990 -2017 (Figure 6)"
        },
        {
            "text": "There are some risk factors, whose contribution to DALYs changes little or not at all over this period in European countries. For example, drug use, intimate partner violence, childhood maltreatment, high body-mass index, high fasting plasma glucose, occupation risks and other environmental risks. In Scotland, the drug use has increased over the last decades. In the European region, the overall burden of disease/diseases due to known risk factors has decreased but the relative contribution of a single risk factor within a given year has largely stayed unchanged.",
            "cite_spans": [],
            "ref_spans": [],
            "section": "Environmental risk factors including air pollution."
        },
        {
            "text": "According to the national health statistics, DALYs due to alcohol use are decreasing over this period in Latvia, Lithuania and Poland. In Latvia as part of public health framework strategy to reduce alcoholism, following actions have been planned in 2014-2020 and 2020-2022: a gradual increase in excise tax, bans and restrictions to alcohol advertisement and sale.",
            "cite_spans": [],
            "ref_spans": [],
            "section": "Environmental risk factors including air pollution."
        },
        {
            "text": "According to Lithuania's health strategy, the alcohol use is decreasing since 2015. In Poland, the main risk factors with the largest share in DALYs are tobacco (21,2%), dietary risks (19,3 %) and metabolic risks like high systolic blood pressure 12,4%; high LDL cholesterol 10,2%; high body-mass index 9,7%, alcohol use 8,9%. In France, the overall trend of various risk factors corresponds to the national health statistics. In Scotland, the existing knowledge about the contribution of certain risk factors to the overall disease burden confirms that the tobacco use, diet, obesity and other metabolic risk factors are main contributors to overall disease burden.",
            "cite_spans": [],
            "ref_spans": [],
            "section": "Environmental risk factors including air pollution."
        },
        {
            "text": "According to public health strategy frameworks across many European countries, prevention intervention programs help to increase awareness via health campaigns promoting stop smoking, healthy diet, regular physical activities and less alcohol drinking.",
            "cite_spans": [],
            "ref_spans": [],
            "section": "Environmental risk factors including air pollution."
        },
        {
            "text": "Potential difference in risk factor estimates/trend: In France, the trend of occupational risks are underestimated by IHME.",
            "cite_spans": [],
            "ref_spans": [],
            "section": "Environmental risk factors including air pollution."
        },
        {
            "text": "The IHME estimates should be interpreted with caution, as individual risk factors may become intermediary factors in a causal pathway. The IHME methodology works with single risk-outcome pairs, which does not take into consideration interactions between risk factors or one risk factor being an intermediary to another one in a pathway.",
            "cite_spans": [],
            "ref_spans": [],
            "section": "Potential limitation related to method used:"
        },
        {
            "text": "According to the IHME estimates, the annual change in age-standardized DALYs attributable to individual health conditions is progressively declining over time in European countries. Cardiovascular and cancer are the main contributors to the annual decrease in overall DALYs in all European countries and to a lesser extent, unintentional injuries, diabetes, respiratory conditions, substance use disorder and other non-communicable diseases. In some European countries, the contribution of musculoskeletal disorders (DK, ENG, FR, IE) and substance use disorder (FI) to the overall DALYs has increased in 2017.",
            "cite_spans": [],
            "ref_spans": [],
            "section": "Annual change in age-standardized DALYs attributable to top ten health conditions 1990 -2017 (Figure 7)"
        },
        {
            "text": "According to the national health statistics, some European countries (CY, FI, IT, PL, PT, LV, LT) mentioned that the changes in cardiovascular diseases correspond to their national health reporting as reflected by premature mortality estimates (i.e., YLL in figure 3 ).",
            "cite_spans": [],
            "ref_spans": [
                {
                    "start": 258,
                    "end": 266,
                    "text": "figure 3",
                    "ref_id": "FIGREF2"
                }
            ],
            "section": "Annual change in age-standardized DALYs attributable to top ten health conditions 1990 -2017 (Figure 7)"
        },
        {
            "text": "In Estonia, there are quite some differences between the causes of YLLs and YLDs. If we sum them up, then the real problems cannot be observed. In France, the trend in interpersonal violence does not reflect the real-time situation. Germany mentioned that their national health reporting does not fully reflect these variations. Most of the European countries did not comment on these estimates because DALYs are not commonly calculated at national public health institutes as part of routine activities.",
            "cite_spans": [],
            "ref_spans": [],
            "section": "Potential difference in attributable DALYs estimates/trend:"
        },
        {
            "text": "According to IHME estimates in 2017, the HAQ index (i.e., a proxy measure of the quality of health care services based on amenable mortality [32 causes of death]) shows that in most European countries, results for circulatory diseases, respiratory diseases and some types of cancers are close to the highest percentile. This reflects the performance of health care services in those conditions amenable to better outcomes where high quality care is available. Improvements in life expectancy are linked to it.",
            "cite_spans": [],
            "ref_spans": [],
            "section": "Healthcare Access and Quality Index (HAQ) based on amenable mortality 2017 (Figure 8)"
        },
        {
            "text": "On the other hand, the HAQ index for the treatment of non-melanoma skin cancer (squamouscell carcinoma) is lower than 60 in following European countries, highlighting the potential issues with diagnosis, treatment and care: AT, BE, CY, DK, EE, ES, HR, HU, LV, LT, PL, PT, RO, SRB, SK, SI.",
            "cite_spans": [],
            "ref_spans": [],
            "section": "Healthcare Access and Quality Index (HAQ) based on amenable mortality 2017 (Figure 8)"
        },
        {
            "text": "Some countries mentioned that the HAQ index is a rough proxy measure, useful to compare the performance of health care services across European countries, but that it is of limited use for an in-depth improvement in the delivery and quality of health care services (DE, PL). Due to lack of knowledge on data sources and methods used for amenable mortality estimation, it is difficult to interpret these estimates (HU).",
            "cite_spans": [],
            "ref_spans": [],
            "section": "Healthcare Access and Quality Index (HAQ) based on amenable mortality 2017 (Figure 8)"
        },
        {
            "text": "IHME uses a broad range of various types of data sources to calculate GBD estimates. Some countries mentioned that many of these sources are not commonly used in routine calculation of their national health statistics.",
            "cite_spans": [],
            "ref_spans": [],
            "section": "B. Additional data sources used by individual countries for national health reporting"
        },
        {
            "text": "Following countries mentioned additional data sources, which are not included in the list of data sources by IHME:",
            "cite_spans": [],
            "ref_spans": [],
            "section": "B. Additional data sources used by individual countries for national health reporting"
        },
        {
            "text": "Croatia: Data sources to calculate related estimates of mortality, morbidity and for risk factors used by the IHME are appropriate. A data source that is often used in national statistics and is not included in the list of IHME data sources is EHIS [European Health Interview Survey -2nd wave]. Finland: the IHME data source for mortality data is the WHO mortality database and latest data is from 2015. From National Statistics Finland, more up-to-date information by sex until 2018 can be obtained. Death from 2019 will be published at the end of 2020. The latest morbidity information used by IHME from the Hospital Discharge Register is from 2014. For national calculations, we can obtain more upto-date information about in-and out-patient hospital visits from the care register.",
            "cite_spans": [],
            "ref_spans": [],
            "section": "B. Additional data sources used by individual countries for national health reporting"
        },
        {
            "text": "For risk factors such as smoking, hypertension and obesity, the latest questionnaire data used by IHME is from 2014 and health examination data from 2012. Since then, we have had a health examination survey in 2017 and questionnaire-based health surveys annually, latest completed data from 2019. In our national calculations, we can also use data on medical prescriptions and purchases.",
            "cite_spans": [],
            "ref_spans": [],
            "section": "B. Additional data sources used by individual countries for national health reporting"
        },
        {
            "text": "The following data sources are not included in the list of IHME data sources and are frequently used in national health statistics: surveys (ENRED, Baromètres santé, ESPS), INSERM CépiDC for national mortality data and INCA database for cancer.",
            "cite_spans": [],
            "ref_spans": [],
            "section": "France:"
        },
        {
            "text": "Germany: IHME heavily relies on evidence that is published in scientific journals in English language. Thus, with some exceptions like hospital data or causes of death data national data sources are not systematically accessed in order to estimate the burden of disease. In Germany, for instance, both national statistics and survey data on road injuries are accessible at micro data level, are not listed among the data that is used to estimate the burden of road traffic injuries. Some type of data that is important to consider for accurate national estimates, may be difficult to access for foreign research institutions due to data protection regulations (e.g. claims data).",
            "cite_spans": [],
            "ref_spans": [],
            "section": "France:"
        },
        {
            "text": "Italy: Most of the data sources used by the IHME to calculate estimates of mortality, morbidity and risk factors are appropriate. However, the IHME also used data related to earthquakes in Italy released by the British Broadcasting Corporation (BBC) News, which is inappropriate.",
            "cite_spans": [],
            "ref_spans": [],
            "section": "France:"
        },
        {
            "text": "Lithuania: There are many important data sources, which are used at national level but are not used for BoD calculations by IHME. For example, morbidity data (Health Insurance Fund), national health interview survey data (Institute of Hygiene) and other data sources are presented at sveikstat.hi.lt.",
            "cite_spans": [],
            "ref_spans": [],
            "section": "France:"
        },
        {
            "text": "The National Public Health Institute of Slovenia is collaborating with IHME. In the last round the mortality data sources were checked, which were the same as used for national health statistics. There are some missing data sources for risk factors (i.e., including two types of periodic surveys: ",
            "cite_spans": [],
            "ref_spans": [],
            "section": "Slovenia:"
        },
        {
            "text": "The results of this study provided an overview of priority health conditions and risk factors contributing to the overall burden (i.e., DALYs) and health system performance in European countries by comparing the national health statistics with IHME calculated estimates. This comparison highlighted certain differences in ranking of priority health conditions and risk factors in some European countries. These differences may be due to additional data sources used by the individual country for national health reporting, choice of a standard population and the use of different methodological choices to calculate BoD estimates.",
            "cite_spans": [],
            "ref_spans": [],
            "section": "V. Discussion"
        },
        {
            "text": "Some countries mentioned the additional data sources used in their routine calculations of national statistics, which are not included in the list of IHME and can influence the ranking of health conditions and risk factors produced. Low-quality data challenge to calculate BoD estimates.",
            "cite_spans": [],
            "ref_spans": [],
            "section": "Different data sources"
        },
        {
            "text": "The choice of the standard population strongly influences the disease ranking [4] . For example, in Belgium as mentioned under \"Age-standardized mortality rates by top ten conditions 1990 -2017\", cardiovascular diseases are ranked as the top contributing factor to the burden of morality by using the European standard population. However, by changing the standard population from the European population to the world population, this ranking changes and cancer mortality has become the first contributing factor to the burden of mortality as used by IHME.",
            "cite_spans": [
                {
                    "start": 78,
                    "end": 81,
                    "text": "[4]",
                    "ref_id": "BIBREF3"
                }
            ],
            "ref_spans": [],
            "section": "Choice of standard population"
        },
        {
            "text": "Several methodological challenges were identified by some European countries who produce their own BoD estimates, which limits the comparison of GBD estimates with national BoD estimates and national statistics. For example, differences in prevalence rates and duration parameters, use of different life tables to estimate YLL, difference in estimation methods used to calculate age-standardized rates, to redistribute garbage codes and invalid ICD-10 codes, use of same severity distributions across countries and regions [5] , estimation of disability weights at disease level or sequelae level, comorbidity adjustment methods, etc.",
            "cite_spans": [
                {
                    "start": 523,
                    "end": 526,
                    "text": "[5]",
                    "ref_id": "BIBREF4"
                }
            ],
            "ref_spans": [],
            "section": "Use of different methodological choices"
        },
        {
            "text": "Some countries mentioned that the lack of information on the method used to calculate IHME estimates makes it challenging to compare them with estimates from national studies.",
            "cite_spans": [],
            "ref_spans": [],
            "section": "Use of different methodological choices"
        },
        {
            "text": "Some countries mentioned that ranking of mortality estimates due to some health conditions do not correspond to the IHME ranking. For example, in Romania, mortality rates for cardiovascular diseases and cancer are under-estimated by IHME as compared to national statistics and premature mortality for cardiovascular diseases are over-estimated by IHME. In Serbia, mortality rates for cardiovascular and respiratory diseases were under-estimated by IHME as compared to the Serbian BoD study in 2000. In Scotland, the mortality rates due to substance use tend to have higher numbers in national death register. In France, the trend of musculoskeletal disorders, mental health and neurological diseases contributing to the disability have changed since 2010, and occupational risks are underestimated.",
            "cite_spans": [],
            "ref_spans": [],
            "section": "The difference in priority health conditions and risk factors"
        },
        {
            "text": "To our knowledge, this is the first study describing the country health profiles and comparing with national health statistics in individual countries. These results emphasize the importance of good quality data sources, choice of a standard population and methods used to calculate BoD estimates, which can influence the estimates and the ranking of health conditions and risk factors.",
            "cite_spans": [],
            "ref_spans": [],
            "section": "Strengths and limitations"
        },
        {
            "text": "There are some limitations in this study. First, the majority of the countries did not calculate GBD estimates using their own data to compare with IHME calculated estimates. The countries only compared the IHME trends with their national health statistics of their country, which are based on prevalence and incidence estimates. Second, it is difficult to compare the country health profiles with national health statistics and to assess whether the differences in IHME estimates are due to the actual differences in population health or whether these are the result of different data sources, standard population and methodological choices. Third, the IHME estimates were not stratified by different age structures and sex to explain differences at various levels. Fourth, grouping of various health conditions such as neurological disorders and cancers are too general, which may not reveal the underlying the variations in estimates of individual diseases grouped under one category. As an example of cancer, the country health profile did not describe as breast cancer, lung cancer, prostate cancer, etc.",
            "cite_spans": [],
            "ref_spans": [],
            "section": "Strengths and limitations"
        },
        {
            "text": "The results of this comparison highlight the importance of key aspects such as different data sources, choice of a standard population and different methods used to calculate BoD estimates when developing BoD studies. Therefore, from perspectives of European and intracountry comparisons at local levels, the comparability and consistency of estimates across diseases, can strongly influence the local, national and European levels policy decisions. There are two possibilities: first, if European countries are relying on IHME estimates, it is important to share good quality and updated data sources with IHME to improving the calculation of their GBD estimates. Second, if European countries want to calculate their own BoD estimates, it is essential to understand the rationale of using various methodological approaches in their country contexts. As very few European countries have the capacity to calculate their own BoD estimates, therefore, to build this capacity among European countries is of prime importance.",
            "cite_spans": [],
            "ref_spans": [],
            "section": "Implications for policy and research"
        },
        {
            "text": "From the perspectives of comparison of estimates among European countries, a European data infrastructure is required, which could support to establish the European BoD estimates, as a means for supporting evidence-based decision-making. This would allow sharing similar data sources and common methods used to calculate BoD estimates at EU level.",
            "cite_spans": [],
            "ref_spans": [],
            "section": "Implications for policy and research"
        },
        {
            "text": "These results highlight some variations in priority health conditions based on national health reporting or disease assessments in individual countries. Few countries have a formal, complete BoD assessment, i.e. comprehensive, updated, and repeated over time to identify trends. Even the countries who develop their own BoD study, the inter-country comparability still remains an issue due to different data sources, the choice of a standard population, and different methodological approaches. The use of GBD metrics (YLL, YLD, DALYs) is neither mandatory nor necessary when developing a BoD study. However, in the absence of a defined set of principles, countries may find it difficult to compare their estimates to their peers, and to monitor the trends of health conditions and risk factors over time.",
            "cite_spans": [],
            "ref_spans": [],
            "section": "VI. Conclusions"
        },
        {
            "text": "A. Additional file 1",
            "cite_spans": [],
            "ref_spans": [],
            "section": "VIII. Additional files"
        },
        {
            "text": "Description of GBD metrics used to describe country health profiles Figure 1 shows the observed and expected life expectancy. Expected values are based on a country's expected performance according to its Socio-demographic Index (SDI) (computed using the geometric mean of income per person, educational attainment in the population older than age 15 years, and total fertility rate). 1 Please note that GBD does not publish expected life expectancy for the European Union as a whole, which is why figures were used for Western Europe for illustrative purposes. shows morbidity, as Years lived with disability (YLDs). These are years lived in less than ideal health. This includes health loss that may last for only a few days or a lifetime. YLDs are estimated from the prevalence of diseases and injuries, and the corresponding disability weight for each sequela. YLDs adjusted for disability and co-morbidity are the final YLDs. Trends in morbidity often show markedly different patterns from mortality, often 'flatlining' whereas mortality decreases. Figure 5 shows the combined burden of mortality and morbidity, Disability-adjusted life years (DALYs). These are the years of healthy life lost due to premature death and disability. DALYs are the sum of years of life lost (YLLs) and years lived with disability (YLDs). It is the major metric used in burden of disease assessments. Its shape is usually heavily influenced by the mortality component. Figure 6 shows the DALYs lost to all causes, distributed by most common risk factors. GBD uses a 3-category structure of risks, i.e. behavioural, metabolic and environmental, and estimates single risk factor -health outcome pairs. The amount of DALYs (their PAFs [Population Attributable Fractions]) reflects known risk factors, and therefore represents a fraction of total DALYs, as conditions such as e.g. dementia, musculoskeletal disorders or cancer are only partly explained by underlying risk factors. This allows explaining, which causes have most contributed to changes in burden. A frequent finding across countries is the year-on-year decrease in cardiovascular disease rates. Figure 8 presents values for the Healthcare Access and Quality Index (HAQ) 2 . This is a measure of amenable mortality based on GBD mortality rates. It is based on 32 underlying causes of death. The HAQ summarizes amenable mortality (premature deaths theoretically avoidable by access to and receipt of high quality medical care) into an index, which takes values from 0-100 where 100 is best achievable performance. Amenable mortality refers to deaths, which are thought to be avoidable in a defined set of conditions by optimal access to and quality of medical care. The higher the value of the index the more likely people are able to access high quality effective care. It has been used as a comparative measure of healthcare and health system performance for years. The box-and-whiskers plot shows the distribution of HAQ values for Member States, with the individual country highlighted as a red dot. This is the main index used by GBD to measure health system performance.",
            "cite_spans": [
                {
                    "start": 385,
                    "end": 386,
                    "text": "1",
                    "ref_id": "BIBREF0"
                }
            ],
            "ref_spans": [
                {
                    "start": 68,
                    "end": 76,
                    "text": "Figure 1",
                    "ref_id": "FIGREF0"
                },
                {
                    "start": 1054,
                    "end": 1062,
                    "text": "Figure 5",
                    "ref_id": null
                },
                {
                    "start": 1454,
                    "end": 1462,
                    "text": "Figure 6",
                    "ref_id": null
                },
                {
                    "start": 2141,
                    "end": 2149,
                    "text": "Figure 8",
                    "ref_id": null
                }
            ],
            "section": "VIII. Additional files"
        },
        {
            "text": "Here is an example of interpretation using the England GBD health profile",
            "cite_spans": [],
            "ref_spans": [],
            "section": "VIII. Additional files"
        },
        {
            "text": "England outperforms its expected value. However, in recent years, improvements in observed LE have stalled, while the 'expected trend' is meant to be continuing to rise. Compare with other EU countries where observed life expectancy is below the expected (e.g. Hungary, Romania) or countries where life improvement has not only stalled, but has deteriorated (Scotland, Finland).",
            "cite_spans": [],
            "ref_spans": [],
            "section": "Figure 1, life expectancy"
        },
        {
            "text": "In England, mortality rates have greatly decreased for cardiovascular disease, and to minor extent for cancer. The recent slowing down in life expectancy rise is mirrored by the behaviour of these two conditions. This pattern is similar in most countries, in that CVD and cancer account for most of the burden of mortality and therefore largely determine life expectancy. The individual shape of curves is however different between countries, perhaps more so for cancer than for CVD.",
            "cite_spans": [],
            "ref_spans": [],
            "section": "Figure 2, mortality"
        },
        {
            "text": "The values are based on mortality data and reflect the pattern of overall improvement until the recent stalling.",
            "cite_spans": [],
            "ref_spans": [],
            "section": "Figure 3, premature mortality"
        },
        {
            "text": "While mortality has massively improved, telling something about the health system's ability to protect the population from dying of a disease, morbidity has stayed mostly unchanged, in some cases even worsening, such as MSK. In fact, in countries such as England, the main challenge is morbidity, not mortality.",
            "cite_spans": [],
            "ref_spans": [],
            "section": "Figure 4, morbidity"
        },
        {
            "text": "DALYs are the combination of YLLs (premature mortality) and YLDs (morbidity) giving an appreciation of the overall burden. The shape of the curves is heavily influenced by premature mortality, as the rates per 100,00 of YLLs resp. YLDs allow to identify. Nevertheless, MSK and mental health figure prominently.",
            "cite_spans": [],
            "ref_spans": [],
            "section": "Figure 5, combined burden"
        },
        {
            "text": "This is the contribution of individual risk factors to the overall burden, measured in DALYs. Given that the question for the UK is \"what has contributed to the recent stalling in life expectancy\", this figure starts unravelling how risk factors have improved over the years, and how several have stopped decreasing in recent years. Risk factors like dietary risks or high blood pressure, whose contribution to the burden had been diminishing steadily over the previous years, no longer decrease in importance in recent years.",
            "cite_spans": [],
            "ref_spans": [],
            "section": "Figure 6, risk factors"
        },
        {
            "text": "As mentioned above, this chart shows which year-on-year decreases in main conditions account for overall changes in the burden of disease. CVD and cancer, and to a lesser extent respiratory conditions, brought about major improvements between 1990 and roughly 2010 and stalled ever after. This pattern is found in most comparable countries.",
            "cite_spans": [],
            "ref_spans": [],
            "section": "Figure 7, DALY breakdown"
        },
        {
            "text": "This proxy measure for quality of health services shows that in England testicular cancer, rheumatic heart disease, leukaemia, and chronic kidney disease are rather well treated, reaching the highest percentile of the index. CVD and a range of cancers are equally among the higher levels of the distribution, confirming the contribution of the health services to the improvements in life expectancy, but not the recent stalling.",
            "cite_spans": [],
            "ref_spans": [],
            "section": "Figure 8, Healthcare Access and Quality Index"
        }
    ],
    "bib_entries": {
        "BIBREF0": {
            "ref_id": "b0",
            "title": "IHME: Country Health Profiles",
            "authors": [],
            "year": null,
            "venue": "",
            "volume": "",
            "issn": "",
            "pages": "",
            "other_ids": {}
        },
        "BIBREF1": {
            "ref_id": "b1",
            "title": "Hospitalization and ambulatory care for mood disorders in psychiatric settings in metropolitan france",
            "authors": [
                {
                    "first": "L",
                    "middle": [],
                    "last": "Badjadj",
                    "suffix": ""
                },
                {
                    "first": "Chan",
                    "middle": [],
                    "last": "Chee",
                    "suffix": ""
                },
                {
                    "first": "C",
                    "middle": [],
                    "last": "",
                    "suffix": ""
                }
            ],
            "year": 2010,
            "venue": "BEH",
            "volume": "",
            "issn": "",
            "pages": "",
            "other_ids": {}
        },
        "BIBREF2": {
            "ref_id": "b2",
            "title": "Hospitalization and ambulatory care of patients with anxiety disorders in public psychiatric settings in metropolitan France",
            "authors": [
                {
                    "first": "C",
                    "middle": [
                        "C"
                    ],
                    "last": "Chee",
                    "suffix": ""
                }
            ],
            "year": 2010,
            "venue": "BEH (Bulletin épidémiologiue hebdomadaire",
            "volume": "",
            "issn": "",
            "pages": "",
            "other_ids": {}
        },
        "BIBREF3": {
            "ref_id": "b3",
            "title": "How do world and European standard populations impact burden of disease studies? A case study of disability-adjusted life years (DALYs) in Scotland. Archives of Public Health",
            "authors": [
                {
                    "first": "Gma",
                    "middle": [],
                    "last": "Wyper",
                    "suffix": ""
                },
                {
                    "first": "I",
                    "middle": [],
                    "last": "Grant",
                    "suffix": ""
                },
                {
                    "first": "E",
                    "middle": [],
                    "last": "Fletcher",
                    "suffix": ""
                },
                {
                    "first": "G",
                    "middle": [],
                    "last": "Mccartney",
                    "suffix": ""
                },
                {
                    "first": "C",
                    "middle": [],
                    "last": "Fischbacher",
                    "suffix": ""
                },
                {
                    "first": "D",
                    "middle": [
                        "L"
                    ],
                    "last": "Stockton",
                    "suffix": ""
                }
            ],
            "year": 2020,
            "venue": "",
            "volume": "78",
            "issn": "",
            "pages": "",
            "other_ids": {}
        },
        "BIBREF4": {
            "ref_id": "b4",
            "title": "Prioritising the development of severity distributions in burden of disease studies for countries in the European region",
            "authors": [
                {
                    "first": "Gma",
                    "middle": [],
                    "last": "Wyper",
                    "suffix": ""
                },
                {
                    "first": "I",
                    "middle": [],
                    "last": "Grant",
                    "suffix": ""
                },
                {
                    "first": "E",
                    "middle": [],
                    "last": "Fletcher",
                    "suffix": ""
                },
                {
                    "first": "N",
                    "middle": [],
                    "last": "Chalmers",
                    "suffix": ""
                },
                {
                    "first": "G",
                    "middle": [],
                    "last": "Mccartney",
                    "suffix": ""
                },
                {
                    "first": "D",
                    "middle": [
                        "L"
                    ],
                    "last": "Stockton",
                    "suffix": ""
                }
            ],
            "year": 2020,
            "venue": "",
            "volume": "78",
            "issn": "",
            "pages": "",
            "other_ids": {}
        }
    },
    "ref_entries": {
        "FIGREF0": {
            "text": "Life expectancy [LE] 1990 -2017 (Figure 1) The observed life expectancy estimates are in line with national estimates in BE, DE, FI, FR, HU, IT, LV, NO, RO, SI, and SC. For example in Belgium, according to the national estimates of 2018, the observed LE was 81.5Y (both gender), 83.7 (*F), 79.2 (*M), whereas according to IHME estimates in 2017, the observed LE was 81.4 (both gender), 83.8 (F), 78.9 (M). In Norway, according to the national estimates of 2017, the observed LE was 82.6Y (both gender), 84.3 (*F), 80.9 (*M), whereas according to IHME estimates in 2017, the observed LE was 82.3 (both gender), 84.2 (F), 80.5 (M).",
            "latex": null,
            "type": "figure"
        },
        "FIGREF1": {
            "text": "shows age-adjusted mortality rates by major conditions (top ten).",
            "latex": null,
            "type": "figure"
        },
        "FIGREF2": {
            "text": "shows Years of Life Lost (YLLs). These are the years of life lost due to premature mortality; estimated as the product of deaths and the remaining standard life expectancy at the age of death. It is computed as how many years of life are lost due to a person dying at a particular age and did not live to the full life expectancy possible. The trends are usually very similar to mortality trends.",
            "latex": null,
            "type": "figure"
        },
        "FIGREF3": {
            "text": "Figure 4 shows morbidity, as Years lived with disability (YLDs). These are years lived in less than ideal health. This includes health loss that may last for only a few days or a lifetime. YLDs are estimated from the prevalence of diseases and injuries, and the corresponding disability weight for each sequela. YLDs adjusted for disability and co-morbidity are the final YLDs. Trends in morbidity often show markedly different patterns from mortality, often 'flatlining' whereas mortality decreases.",
            "latex": null,
            "type": "figure"
        },
        "FIGREF4": {
            "text": "attempts to illustrate the contribution of individual causes to changes in disease burden. The columns present year-on-year changes in rates, broken down by major causes.",
            "latex": null,
            "type": "figure"
        },
        "TABREF0": {
            "text": "etc., the mortality rates of cardiovascular diseases and cancer are still contributing most to the burden of diseases in all European countries.",
            "latex": null,
            "type": "table"
        },
        "TABREF1": {
            "text": "According to IHME estimates in 2017, among 20 countries(AT, BG, CY, CZ, DE, EE, FI, GR, HR, HU, LV, LI, MT, PL, RO, SC, SRB, SK, SI,SW), either cancer or cardiovascular diseases are the top two health conditions contributing to the DALYs. Among 11 countries (BE, DK, ENG, ES, FR, IR, IT, LU, NL, NO, PT), the musculoskeletal disorders are the second most contributing health condition to the DALYs. Among eight countries (CZ, EE, LV, LI, PL, RO, SK, SI), unintentional injuries are the third most contributing health condition to DALYs. In France and Italy, mental health is the third most contributing health condition to DALYs.Five countries (DE, FI, HU, IT, SC) mentioned that, according to the national health statistics, some priority health conditions highlighted by IHME are similar to their own national priorities/goals.",
            "latex": null,
            "type": "table"
        }
    },
    "back_matter": []
}