{
    "paper_id": "0a18f102e9a9f3c778fce97f1895699e6cbd1552",
    "metadata": {
        "title": "Novelty-induced frontal-STN networks in Parkinson's disease 4 Running Title: Novelty-induced networks in Parkinson's disease 5 6",
        "authors": [
            {
                "first": "Rachel",
                "middle": [
                    "C"
                ],
                "last": "Cole",
                "suffix": "",
                "affiliation": {
                    "laboratory": "",
                    "institution": "University of Iowa",
                    "location": {
                        "postCode": "52242",
                        "settlement": "Iowa City",
                        "region": "IA"
                    }
                },
                "email": ""
            },
            {
                "first": "Arturo",
                "middle": [
                    "I"
                ],
                "last": "Espinoza",
                "suffix": "",
                "affiliation": {
                    "laboratory": "",
                    "institution": "University of Iowa",
                    "location": {
                        "postCode": "52242",
                        "settlement": "Iowa City",
                        "region": "IA"
                    }
                },
                "email": ""
            },
            {
                "first": "Arun",
                "middle": [],
                "last": "Singh",
                "suffix": "",
                "affiliation": {
                    "laboratory": "",
                    "institution": "University of South Dakota",
                    "location": {
                        "postCode": "11 57069",
                        "settlement": "Vermillion",
                        "region": "SD"
                    }
                },
                "email": ""
            },
            {
                "first": "Joel",
                "middle": [
                    "I"
                ],
                "last": "Berger",
                "suffix": "",
                "affiliation": {
                    "laboratory": "",
                    "institution": "University of Iowa",
                    "location": {
                        "postCode": "52242",
                        "settlement": "Iowa City",
                        "region": "IA"
                    }
                },
                "email": ""
            },
            {
                "first": "James",
                "middle": [
                    "F"
                ],
                "last": "Cavanagh",
                "suffix": "",
                "affiliation": {},
                "email": ""
            },
            {
                "first": "Jeremy",
                "middle": [
                    "D"
                ],
                "last": "Greenlee",
                "suffix": "",
                "affiliation": {
                    "laboratory": "",
                    "institution": "University of Iowa",
                    "location": {
                        "postCode": "52242",
                        "settlement": "Iowa City",
                        "region": "IA"
                    }
                },
                "email": ""
            },
            {
                "first": "Nandakumar",
                "middle": [
                    "S"
                ],
                "last": "Narayanan",
                "suffix": "",
                "affiliation": {
                    "laboratory": "",
                    "institution": "University of Iowa",
                    "location": {
                        "postCode": "52242",
                        "settlement": "Iowa City",
                        "region": "IA"
                    }
                },
                "email": "nandakumar-narayanan@uiowa.edu"
            },
            {
                "first": "Nandakumar",
                "middle": [],
                "last": "Narayanan",
                "suffix": "",
                "affiliation": {},
                "email": ""
            }
        ]
    },
    "abstract": [
        {
            "text": "135 words; Introduction, 617 words; Discussion: 1,207 words 27 The authors declare no competing financial interests. 28 Acknowledgements 29 We would like to acknowledge Haiming Chen, Youngcho Kim, Derrick Okine, Jan Wessel, 30 Darcy Diesberg, and Tobin Dykstra for technical contributions and helpful discussions. This 31 work was funded by NINDS R01 NS100849-01A1 to NN/JG/JFC and NIA F32 AG069445-01 Abstract 36",
            "cite_spans": [],
            "ref_spans": [],
            "section": "Abstract"
        },
        {
            "text": "Evaluating and responding to new information requires cognitive control. Here, we studied 37 novelty-response mechanisms in Parkinson's disease (PD). In PD patient-volunteers, we 38 recorded from cortical circuits with scalp-based electroencephalography (EEG) and from 39 subcortical circuits using intraoperative neurophysiology during surgeries for implantation of 40 deep-brain stimulation (DBS) electrodes. We report three major results. First, novel auditory 41 stimuli triggered midfrontal ~4-Hz rhythms, which were attenuated in PD patients but were not 42 linked with cognitive function or novelty-associated slowing. Second, 32% of subthalamic 43 nucleus (STN) neurons were response-modulated; nearly all (94%) of these were also modulated 44 by novel stimuli. Finally, response-modulated STN neurons were coherent with midfrontal low-45 frequency activity. These findings link scalp-based measurements of neural activity with 46 neuronal activity in the STN. Our results provide insight into midfrontal cognitive control 47 mechanisms and how hyperdirect circuits evaluate new information.",
            "cite_spans": [],
            "ref_spans": [],
            "section": "Abstract"
        },
        {
            "text": "48 All rights reserved. No reuse allowed without permission.",
            "cite_spans": [],
            "ref_spans": [],
            "section": "Abstract"
        },
        {
            "text": "(which was not certified by peer review) is the author/funder, who has granted medRxiv a license to display the preprint in perpetuity.",
            "cite_spans": [],
            "ref_spans": [],
            "section": "Abstract"
        },
        {
            "text": "The copyright holder for this preprint this version posted June 30, 2021. ; https://doi.org/10. 1101 Significance statement 49 Parkinson's disease (PD) is a neurodegenerative disorder with motor and cognitive symptoms.",
            "cite_spans": [],
            "ref_spans": [],
            "section": "Abstract"
        },
        {
            "text": "Here we studied how the brain recruits cognitive control in response to new information. We 51 found that PD patients have decreased cortical low-frequency oscillations linked to cognitive 52 control. We also examined single neurons in PD patients in a deep brain structure called the 53 subthalamic nucleus, and found that response-modulated neurons were uniquely modulated by 54 novelty and they fired in-phase with these same low-frequency brain oscillations. Our work helps 55 illustrate how neural circuits evaluate new information, which could be relevant for PD as well 56 as other diseases that disrupt cognition. 57 All rights reserved. No reuse allowed without permission.",
            "cite_spans": [],
            "ref_spans": [],
            "section": "Abstract"
        }
    ],
    "body_text": [
        {
            "text": "neurons exert top-down control across the brain (Cavanagh & Frank, 2014), including 81 subcortical networks in the basal ganglia (Zink et al., 2006) . These subcortical basal ganglia 82 networks can be modulated by novelty; indeed, a human intraoperative study by Mikell and 83 colleagues (2014) found that subcortical neurons in the substantia nigra increased firing more 84 following infrequent novel sounds than frequent standard sounds. 85 We and others have found consistent evidence that PD attenuates midfrontal 1-8 Hz hypothesis that midfrontal ~4-Hz rhythms engage subcortical networks in response to novelty. 95 We tested this idea by first comparing midfrontal EEG during an oddball task between PD an intraoperative oddball task in PD patients undergoing DBS implantation surgery. We report 99 three main findings. First, we found that PD patients had decreased midfrontal ~4-Hz rhythms 100 compared to controls; however, these rhythms did not correlate with cognitive status or novelty-101 related slowing. Second, we found that neurons in the STN were strongly response-modulated 102 rather than cue-modulated, and most response-modulated STN neurons were influenced by 103 All rights reserved. No reuse allowed without permission.",
            "cite_spans": [
                {
                    "start": 84,
                    "end": 86,
                    "text": "81",
                    "ref_id": null
                },
                {
                    "start": 129,
                    "end": 148,
                    "text": "(Zink et al., 2006)",
                    "ref_id": "BIBREF51"
                },
                {
                    "start": 373,
                    "end": 375,
                    "text": "84",
                    "ref_id": null
                },
                {
                    "start": 441,
                    "end": 443,
                    "text": "85",
                    "ref_id": null
                },
                {
                    "start": 619,
                    "end": 621,
                    "text": "95",
                    "ref_id": null
                }
            ],
            "ref_spans": [],
            "section": "INTRODUCTION"
        },
        {
            "text": "(which was not certified by peer review) is the author/funder, who has granted medRxiv a license to display the preprint in perpetuity.",
            "cite_spans": [],
            "ref_spans": [],
            "section": "INTRODUCTION"
        },
        {
            "text": "The copyright holder for this preprint this version posted June 30, 2021. ; https://doi.org/10.1101/2021.06.24.21259502 doi: medRxiv preprint novelty. Third, we found that midfrontal low-frequency oscillations were coherent with 104 response-modulated STN neurons. These data provide insight into how novel information 105 engages a midfrontal cognitive control system, and how this system in turn contributes to a 106 hyperdirect subcortical mechanism for response control. Table 1 ). PD patients were recruited through the Movement In parallel with the EEG experiment, we recruited 18 PD patient-volunteers who had elected 121 to undergo bilateral STN deep brain stimulation (DBS) implantation surgery (see Table 2 ). These 122 participants were recruited over a time period of 1.5 years (July 2019-August 2020). Within the 123 study period there was a 5-month pause in enrollment due to research suspension during the 124 COVID-19 crisis. Patients were asked during preoperative clinical sessions (1-14 days prior to 125 surgery) whether they were interested in participating in research during their DBS implantation 126 All rights reserved. No reuse allowed without permission.",
            "cite_spans": [],
            "ref_spans": [
                {
                    "start": 475,
                    "end": 482,
                    "text": "Table 1",
                    "ref_id": "TABREF6"
                },
                {
                    "start": 709,
                    "end": 716,
                    "text": "Table 2",
                    "ref_id": null
                }
            ],
            "section": "INTRODUCTION"
        },
        {
            "text": "(which was not certified by peer review) is the author/funder, who has granted medRxiv a license to display the preprint in perpetuity. Oddball task for EEG experiment 134 We assessed the response to novelty using a version of the cross-modal oddball distractor task Our version of the cross-modal oddball distractor task involved a choice reaction-time task in 145 which a white arrow appeared in the center of a black screen, and the participant was required to 146 press the key that corresponded with the direction of the arrow (\"q\" for left arrow, \"p\" for right 147 arrow) as quickly as possible. The appearance of the arrow was preceded by an audio-visual cue 148 by 500 ms (either the standard cue or the distractor cue). Participants were instructed that this 149 All rights reserved. No reuse allowed without permission.",
            "cite_spans": [
                {
                    "start": 168,
                    "end": 171,
                    "text": "134",
                    "ref_id": null
                },
                {
                    "start": 464,
                    "end": 467,
                    "text": "146",
                    "ref_id": null
                }
            ],
            "ref_spans": [],
            "section": "INTRODUCTION"
        },
        {
            "text": "(which was not certified by peer review) is the author/funder, who has granted medRxiv a license to display the preprint in perpetuity.",
            "cite_spans": [],
            "ref_spans": [],
            "section": "INTRODUCTION"
        },
        {
            "text": "The copyright holder for this preprint this version posted June 30, 2021. ; https://doi.org/10.1101/2021.06.24.21259502 doi: medRxiv preprint cue would appear 500 ms before the target stimulus (white arrow), and they were told that the 150 cue would be a green circle and a short tone (600-Hz sine wave tone lasting 200 ms). The audio-151 visual cue was followed by the target arrow ( Figure 1A) . Participants had to respond within 1 s, 152 after which the fixation cross reappeared and the next trial started after a variable inter-trial 153 interval between 500-1000 ms.",
            "cite_spans": [],
            "ref_spans": [
                {
                    "start": 385,
                    "end": 395,
                    "text": "Figure 1A)",
                    "ref_id": null
                }
            ],
            "section": "INTRODUCTION"
        },
        {
            "text": "Participants completed a brief practice of the task (10 trials), which had all the familiar 155 standard cues described above. Following the practice, participants completed four blocks of 60 156 trials each, for a total of 240 trials. Of the 240 trials, 80% contained the standard cues as (which was not certified by peer review) is the author/funder, who has granted medRxiv a license to display the preprint in perpetuity. Bad channels and bad epochs were identified using the FASTER algorithm (Nolan et al., 173 2010) and the pop_rejchan function from EEGLAB, and were then interpolated and rejected 174 respectively. On average, 1.6 ± 0.9 channels per subject were removed, and Cz was never 175 removed during preprocessing. Eye blink contaminants were removed following independent 176 component analysis (ICA).",
            "cite_spans": [
                {
                    "start": 497,
                    "end": 511,
                    "text": "(Nolan et al.,",
                    "ref_id": null
                },
                {
                    "start": 512,
                    "end": 515,
                    "text": "173",
                    "ref_id": null
                }
            ],
            "ref_spans": [],
            "section": "154"
        },
        {
            "text": "Event-related potentials (ERPs) were low-pass-filtered at 20 Hz for analyses. Our primary 178 interest was in ~4-Hz midfrontal rhythms; consequently, we utilized time-frequency analyses. (which was not certified by peer review) is the author/funder, who has granted medRxiv a license to display the preprint in perpetuity. Oddball task for intraoperative neurophysiology 203 We used an auditory version of a 3-tone oddball task during intraoperative human 204 neurophysiology to capture the response to novelty in the operating room during DBS-electrode 205 implantation surgeries. This task is ideal for research for intraoperative patients whose heads are 206 in a stereotaxic frame during multielectrode recordings because, 1) it is in the auditory domain For the 3-tone oddball task, each trial consisted of one of the following sounds being played: a 216 standard tone that occurred frequently (500 Hz: 50% of trials), a target sound that occurred 217 infrequently (the word \"Go\": 30% of trials; this trial type was used to maintain attention), or a 218 All rights reserved. No reuse allowed without permission.",
            "cite_spans": [
                {
                    "start": 371,
                    "end": 374,
                    "text": "203",
                    "ref_id": null
                }
            ],
            "ref_spans": [],
            "section": "177"
        },
        {
            "text": "(which was not certified by peer review) is the author/funder, who has granted medRxiv a license to display the preprint in perpetuity.",
            "cite_spans": [],
            "ref_spans": [],
            "section": "177"
        },
        {
            "text": "The copyright holder for this preprint this version posted June 30, 2021. ; https://doi.org/10.1101/2021.06.24.21259502 doi: medRxiv preprint novel tone (unique birdcall: 20% of trials; Figure 3A ). Patients were instructed to press with 219 their left hand (typically thumb) if they heard the word \"Go,\" and to press with their right 220 hand/thumb if they heard anything else. We focused our analyses on the standard and the novel (which was not certified by peer review) is the author/funder, who has granted medRxiv a license to display the preprint in perpetuity. In addition to STN recordings, scalp EEG was also simultaneously recorded in the operating 241 room during the oddball task. Prior to the start of surgery, three midfrontal EEG electrodes (which was not certified by peer review) is the author/funder, who has granted medRxiv a license to display the preprint in perpetuity. (which was not certified by peer review) is the author/funder, who has granted medRxiv a license to display the preprint in perpetuity. coherence across neurons with different spike rates and trial numbers, spike-field coherence was 294 scaled such that the raw spike-field coherence of each neuron was divided by the 95% 295 confidence interval for each neuron. According to this metric, a \"1\" represents coherence at the 296 95% confidence interval. These analyses were performed in MATLAB. PD patients had slowed reaction-times during novelty-related distraction 308 All rights reserved. No reuse allowed without permission.",
            "cite_spans": [],
            "ref_spans": [
                {
                    "start": 186,
                    "end": 195,
                    "text": "Figure 3A",
                    "ref_id": null
                }
            ],
            "section": "177"
        },
        {
            "text": "(which was not certified by peer review) is the author/funder, who has granted medRxiv a license to display the preprint in perpetuity. We studied how novelty engaged cortical cognitive control mechanisms by recording EEG 309 during the cross-modal oddball distractor task (Figure 1) . This task asks participants to respond 310 to a target cue (arrow) following either a familiar stimulus (600-Hz tone) or a novel stimulus 311 consisting of complex and unique auditory features. Finally, we found that novelty-related slowing was not related to cognitive function, as 328 measured by MoCA (Spearman r=-0.15, p=0.19; Figure 1C) , or motor function, as measured by 329 UPDRS Part 3 in PD patients (Spearman r=0.10, p=0.50; Figure 1D ). Taken together, these data 330 suggest that PD patients were more distracted by novel stimuli than controls. 331 All rights reserved. No reuse allowed without permission.",
            "cite_spans": [],
            "ref_spans": [
                {
                    "start": 273,
                    "end": 283,
                    "text": "(Figure 1)",
                    "ref_id": null
                },
                {
                    "start": 590,
                    "end": 627,
                    "text": "(Spearman r=-0.15, p=0.19; Figure 1C)",
                    "ref_id": null
                },
                {
                    "start": 722,
                    "end": 731,
                    "text": "Figure 1D",
                    "ref_id": null
                }
            ],
            "section": "177"
        },
        {
            "text": "(which was not certified by peer review) is the author/funder, who has granted medRxiv a license to display the preprint in perpetuity. Next, we examined cortical correlates of cognitive control in response to novelty. We found 334 that ERPs were distinct between controls and PD patients, with PD patients showing smaller 335 negative deflections around 100 ms and 300 ms for standard tone trials (Figure 2A (which was not certified by peer review) is the author/funder, who has granted medRxiv a license to display the preprint in perpetuity. Figure 3B ). 365 With these 18 participants, we also performed intraoperative scalp EEG (Figure 4A) . 366 Although these recording locations were anterior to the midfrontal areas which showed peak ~4-367 Hz activity in the EEG experiment outside the operating room (i.e. Figure 2E) , we were able to 368 capture midfrontal cue-related ~4-Hz activity during trials with standard tones from the 369 intraoperative participants (Figure 4B) . We did not identify strong novelty-related midfrontal 370 ~4-Hz activity (Figure 4C) , although a poorer signal-to-noise ratio due to intraoperative 371 limitations may have particularly affected responses to novel stimuli wherein trial numbers were 372 lower. 373 We identified 54 well-isolated STN neurons from 17 of the 18 participants (1 did not have 374 STN neuronal recordings; Figure 4D -E). We defined modulations via neuron-by-neuron GLMs 375 of firing rate vs. all cues and responses at a trial-by-trial level. We found that 5 of the 54 neurons 376 All rights reserved. No reuse allowed without permission.",
            "cite_spans": [
                {
                    "start": 558,
                    "end": 561,
                    "text": "365",
                    "ref_id": null
                },
                {
                    "start": 647,
                    "end": 650,
                    "text": "366",
                    "ref_id": null
                },
                {
                    "start": 1245,
                    "end": 1248,
                    "text": "373",
                    "ref_id": null
                }
            ],
            "ref_spans": [
                {
                    "start": 398,
                    "end": 408,
                    "text": "(Figure 2A",
                    "ref_id": null
                },
                {
                    "start": 545,
                    "end": 554,
                    "text": "Figure 3B",
                    "ref_id": null
                },
                {
                    "start": 633,
                    "end": 644,
                    "text": "(Figure 4A)",
                    "ref_id": null
                },
                {
                    "start": 816,
                    "end": 826,
                    "text": "Figure 2E)",
                    "ref_id": null
                },
                {
                    "start": 970,
                    "end": 981,
                    "text": "(Figure 4B)",
                    "ref_id": null
                },
                {
                    "start": 1057,
                    "end": 1068,
                    "text": "(Figure 4C)",
                    "ref_id": null
                },
                {
                    "start": 1368,
                    "end": 1377,
                    "text": "Figure 4D",
                    "ref_id": null
                }
            ],
            "section": "177"
        },
        {
            "text": "(which was not certified by peer review) is the author/funder, who has granted medRxiv a license to display the preprint in perpetuity.",
            "cite_spans": [],
            "ref_spans": [],
            "section": "177"
        },
        {
            "text": "The copyright holder for this preprint this version posted June 30, 2021. ; https://doi.org/10.1101/2021.06.24.21259502 doi: medRxiv preprint (9%) were significantly modulated around the cue. By contrast, we found significantly more 38.5% of variance and appeared to be modulated around response; PC2 explained 28.5% of 382 variance and was modulated prior to response (Figure 5C-D) . These results provide convergent 383 evidence from two distinct analytic approaches (GLM and PCA) that STN neurons were strongly 384 response modulated.",
            "cite_spans": [],
            "ref_spans": [
                {
                    "start": 369,
                    "end": 382,
                    "text": "(Figure 5C-D)",
                    "ref_id": null
                }
            ],
            "section": "177"
        },
        {
            "text": "Next, we were interested in how response-related activity was modulated by novel cues. 386 Strikingly, we found that nearly all (16 of 17; 94%; Figure 6B ) response-related neurons had 387 differential activity with novel cues as quantified by an FDR-corrected neuron-by-neuron GLM 388 of event type on response-related activity. Thus, these data indicate that STN response-related 389 activity was powerfully modulated by novelty. (Figure 7B) . Around responses, low-frequency coherence was 399 All rights reserved. No reuse allowed without permission.",
            "cite_spans": [
                {
                    "start": 87,
                    "end": 90,
                    "text": "386",
                    "ref_id": null
                }
            ],
            "ref_spans": [
                {
                    "start": 144,
                    "end": 153,
                    "text": "Figure 6B",
                    "ref_id": null
                },
                {
                    "start": 432,
                    "end": 443,
                    "text": "(Figure 7B)",
                    "ref_id": null
                }
            ],
            "section": "385"
        },
        {
            "text": "(which was not certified by peer review) is the author/funder, who has granted medRxiv a license to display the preprint in perpetuity. In this study, we combined scalp-based EEG and intraoperative recordings to examine 408 novelty-related brain activity in frontal-subcortical circuits. We report three main results: 1) Both 409 PD and control participants engaged low-frequency power in response to novel stimuli, but, (which was not certified by peer review) is the author/funder, who has granted medRxiv a license to display the preprint in perpetuity. ",
            "cite_spans": [],
            "ref_spans": [],
            "section": "385"
        },
        {
            "text": "We found that response-modulated STN neuronal activity was coherent with these lower inhibition is associated with STN activity, which serves to suppress motor-related output from 443 the basal ganglia. The low-frequency coherence we found is consistent with recent studies that 444 All rights reserved. No reuse allowed without permission.",
            "cite_spans": [],
            "ref_spans": [],
            "section": "438"
        },
        {
            "text": "(which was not certified by peer review) is the author/funder, who has granted medRxiv a license to display the preprint in perpetuity. controls at quickly reorienting to the task at hand when presented with distracting novel stimuli. 466 We found that PD patients also demonstrated reduced novelty-related frontal theta oscillations 467 All rights reserved. No reuse allowed without permission.",
            "cite_spans": [
                {
                    "start": 235,
                    "end": 238,
                    "text": "466",
                    "ref_id": null
                }
            ],
            "ref_spans": [],
            "section": "438"
        },
        {
            "text": "(which was not certified by peer review) is the author/funder, who has granted medRxiv a license to display the preprint in perpetuity.",
            "cite_spans": [],
            "ref_spans": [],
            "section": "438"
        },
        {
            "text": "The copyright holder for this preprint this version posted June 30, 2021. ; https://doi.org/10.1101/2021.06.24.21259502 doi: medRxiv preprint compared to controls (although theta power was not directly related to behavioral response 468 speed). These findings suggest that structural and functional changes related to PD affect the 469 circuitry that evaluates and responds to novel stimuli. 470 Our work has several limitations. First, intraoperative recordings present many challenges, 471 including a lack of control over the experimental environment. In particular, our intracranial 472 EEG used adhesive electrodes and the electrode placement was somewhat anterior to the peak of 473 midfrontal ~4-Hz activity our whole scalp EEG experiment captured (i.e. Figure 2E) . These 474 factors may have affected our signal-to-noise ratio, particularly on novel trials with low trial 475 numbers. Because STN single-unit recordings occur in PD patients with attenuated novelty-476 triggered midfrontal ~4-Hz rhythms, it is unknown how our STN findings generalize to non-PD 477 patients or patients with other brain diseases that disrupt frontostriatal circuits. Finally, our a 478 priori approach focused on a midfrontal ~4-Hz region-of-interest, which did not perfectly 479 overlap with data-driven novelty-related differences in controls vs. PD patients. 480 Overall, we found evidence for a ~4-Hz stimulus-response arc between the frontal cortex and (which was not certified by peer review) is the author/funder, who has granted medRxiv a license to display the preprint in perpetuity.",
            "cite_spans": [
                {
                    "start": 392,
                    "end": 395,
                    "text": "470",
                    "ref_id": null
                },
                {
                    "start": 488,
                    "end": 491,
                    "text": "471",
                    "ref_id": null
                },
                {
                    "start": 1354,
                    "end": 1357,
                    "text": "480",
                    "ref_id": null
                }
            ],
            "ref_spans": [
                {
                    "start": 761,
                    "end": 771,
                    "text": "Figure 2E)",
                    "ref_id": null
                }
            ],
            "section": "438"
        },
        {
            "text": "The copyright holder for this preprint this version posted June 30, 2021. ; https://doi.org/10.1101/2021.06.24.21259502 doi: medRxiv preprint oscillations may contribute directly to improved cognitive performance. Future research should 490 systematically evaluate this mechanism in humans. 491 Overall, the current studies show that novelty-related distraction is more evident in PD 492 subjects compared to controls, that PD patients engage less novelty-related theta power, that (which was not certified by peer review) is the author/funder, who has granted medRxiv a license to display the preprint in perpetuity. and JG performed intraoperative recordings; AS, RC, JFC, and NN wrote analysis code; RC, 503 JFC, NN, and JG wrote the paper; and JB independently checked the data. 504 505 506 All rights reserved. No reuse allowed without permission.",
            "cite_spans": [
                {
                    "start": 291,
                    "end": 294,
                    "text": "491",
                    "ref_id": null
                }
            ],
            "ref_spans": [],
            "section": "438"
        },
        {
            "text": "(which was not certified by peer review) is the author/funder, who has granted medRxiv a license to display the preprint in perpetuity.",
            "cite_spans": [],
            "ref_spans": [],
            "section": "438"
        },
        {
            "text": "The copyright holder for this preprint this version posted June 30, 2021. ; https://doi.org/10.1101/2021.06.24.21259502 doi: medRxiv preprint (which was not certified by peer review) is the author/funder, who has granted medRxiv a license to display the preprint in perpetuity.",
            "cite_spans": [],
            "ref_spans": [],
            "section": "438"
        },
        {
            "text": "The copyright holder for this preprint this version posted June 30, 2021. ; https://doi.org/10.1101/2021.06.24.21259502 doi: medRxiv preprint",
            "cite_spans": [],
            "ref_spans": [],
            "section": "438"
        }
    ],
    "bib_entries": {
        "BIBREF0": {
            "ref_id": "b0",
            "title": "Cortical potentials evoked by subthalamic stimulation demonstrate a short latency 599 hyperdirect pathway in humans",
            "authors": [],
            "year": 2018,
            "venue": "Journal of Neuroscience",
            "volume": "38",
            "issn": "43",
            "pages": "9129--9141",
            "other_ids": {}
        },
        "BIBREF2": {
            "ref_id": "b2",
            "title": "Functional significance of the cortico-602 subthalamo-pallidal \"hyperdirect\" pathway",
            "authors": [
                {
                    "first": "A",
                    "middle": [],
                    "last": "Nambu",
                    "suffix": ""
                },
                {
                    "first": "H",
                    "middle": [],
                    "last": "Tokuno",
                    "suffix": ""
                },
                {
                    "first": "M",
                    "middle": [],
                    "last": "Takada",
                    "suffix": ""
                }
            ],
            "year": 2002,
            "venue": "Neuroscience Research",
            "volume": "43",
            "issn": "2",
            "pages": "111--117",
            "other_ids": {}
        },
        "BIBREF4": {
            "ref_id": "b4",
            "title": "Common medial frontal 605 mechanisms of adaptive control in humans and rodents",
            "authors": [
                {
                    "first": "N",
                    "middle": [
                        "S"
                    ],
                    "last": "Narayanan",
                    "suffix": ""
                },
                {
                    "first": "J",
                    "middle": [
                        "F"
                    ],
                    "last": "Cavanagh",
                    "suffix": ""
                },
                {
                    "first": "M",
                    "middle": [
                        "J"
                    ],
                    "last": "Frank",
                    "suffix": ""
                },
                {
                    "first": "M",
                    "middle": [],
                    "last": "Laubach",
                    "suffix": ""
                }
            ],
            "year": 2013,
            "venue": "",
            "volume": "16",
            "issn": "",
            "pages": "606--1888",
            "other_ids": {
                "DOI": [
                    "10.1038/nn.3549"
                ]
            }
        },
        "BIBREF5": {
            "ref_id": "b5",
            "title": "Dynamic imaging of brain function",
            "authors": [
                {
                    "first": "N",
                    "middle": [
                        "S"
                    ],
                    "last": "Narayanan",
                    "suffix": ""
                },
                {
                    "first": "M",
                    "middle": [],
                    "last": "Laubach",
                    "suffix": ""
                }
            ],
            "year": 2009,
            "venue": "",
            "volume": "",
            "issn": "",
            "pages": "",
            "other_ids": {}
        },
        "BIBREF6": {
            "ref_id": "b6",
            "title": "Dynamic Brain Imaging: Multi-Modal Methods and In Vivo Applications",
            "authors": [],
            "year": null,
            "venue": "",
            "volume": "",
            "issn": "",
            "pages": "135--165",
            "other_ids": {}
        },
        "BIBREF8": {
            "ref_id": "b8",
            "title": "FASTER: Fully Automated Statistical",
            "authors": [
                {
                    "first": "H",
                    "middle": [],
                    "last": "Nolan",
                    "suffix": ""
                },
                {
                    "first": "R",
                    "middle": [],
                    "last": "Whelan",
                    "suffix": ""
                },
                {
                    "first": "R",
                    "middle": [
                        "B"
                    ],
                    "last": "Reilly",
                    "suffix": ""
                }
            ],
            "year": 2010,
            "venue": "",
            "volume": "",
            "issn": "",
            "pages": "",
            "other_ids": {}
        },
        "BIBREF9": {
            "ref_id": "b9",
            "title": "Thresholding for EEG artifact Rejection",
            "authors": [],
            "year": null,
            "venue": "Journal of Neuroscience Methods",
            "volume": "192",
            "issn": "1",
            "pages": "152--612",
            "other_ids": {
                "DOI": [
                    "10.1016/j.jneumeth.2010.07.015"
                ]
            }
        },
        "BIBREF10": {
            "ref_id": "b10",
            "title": "D1-614 dependent 4 Hz oscillations and ramping activity in rodent medial frontal cortex during 615 interval timing",
            "authors": [
                {
                    "first": "K",
                    "middle": [
                        "L"
                    ],
                    "last": "Parker",
                    "suffix": ""
                },
                {
                    "first": "K.-H",
                    "middle": [],
                    "last": "Chen",
                    "suffix": ""
                },
                {
                    "first": "J",
                    "middle": [
                        "R"
                    ],
                    "last": "Kingyon",
                    "suffix": ""
                },
                {
                    "first": "J",
                    "middle": [
                        "F"
                    ],
                    "last": "Cavanagh",
                    "suffix": ""
                },
                {
                    "first": "N",
                    "middle": [
                        "S"
                    ],
                    "last": "Narayanan",
                    "suffix": ""
                }
            ],
            "year": 2014,
            "venue": "Journal of Neuroscience",
            "volume": "34",
            "issn": "50",
            "pages": "16774--166783",
            "other_ids": {}
        },
        "BIBREF12": {
            "ref_id": "b12",
            "title": "Medial 618 frontal ∼4-Hz activity in humans and rodents is attenuated in PD patients and in rodents 619 with cortical dopamine depletion",
            "authors": [
                {
                    "first": "K",
                    "middle": [
                        "L"
                    ],
                    "last": "Parker",
                    "suffix": ""
                },
                {
                    "first": "K.-H",
                    "middle": [],
                    "last": "Chen",
                    "suffix": ""
                },
                {
                    "first": "J",
                    "middle": [
                        "R"
                    ],
                    "last": "Kingyon",
                    "suffix": ""
                },
                {
                    "first": "J",
                    "middle": [
                        "F"
                    ],
                    "last": "Cavanagh",
                    "suffix": ""
                },
                {
                    "first": "N",
                    "middle": [
                        "S"
                    ],
                    "last": "Narayanan",
                    "suffix": ""
                }
            ],
            "year": 2015,
            "venue": "Journal of Neurophysiology",
            "volume": "114",
            "issn": "2",
            "pages": "1310--1320",
            "other_ids": {}
        },
        "BIBREF14": {
            "ref_id": "b14",
            "title": "No reuse allowed without permission. (which was not certified by peer review) is the author/funder, who has granted medRxiv a license to display the preprint in perpetuity. The copyright holder for this preprint this version posted",
            "authors": [
                {
                    "first": "F",
                    "middle": [
                        "B R"
                    ],
                    "last": "Elford",
                    "suffix": ""
                },
                {
                    "first": "G",
                    "middle": [],
                    "last": "Escera",
                    "suffix": ""
                },
                {
                    "first": "C",
                    "middle": [],
                    "last": "Andrés",
                    "suffix": ""
                },
                {
                    "first": "P",
                    "middle": [],
                    "last": "Miguel",
                    "suffix": ""
                },
                {
                    "first": "I",
                    "middle": [
                        "S"
                    ],
                    "last": "",
                    "suffix": ""
                }
            ],
            "year": 2008,
            "venue": "Cognition",
            "volume": "106",
            "issn": "1",
            "pages": "623--408",
            "other_ids": {
                "DOI": [
                    "10.1101/2021.06.24.21259502"
                ]
            }
        },
        "BIBREF15": {
            "ref_id": "b15",
            "title": "Cognitive control of involuntary distraction by 625 deviant sounds",
            "authors": [
                {
                    "first": "F",
                    "middle": [
                        "B R"
                    ],
                    "last": "Parmentier",
                    "suffix": ""
                },
                {
                    "first": "M",
                    "middle": [],
                    "last": "Hebrero",
                    "suffix": ""
                }
            ],
            "year": 2013,
            "venue": "Journal of Experimental Psychology: Learning Memory and Cognition",
            "volume": "626",
            "issn": "5",
            "pages": "1635--1641",
            "other_ids": {
                "DOI": [
                    "10.1037/a0032421"
                ]
            }
        },
        "BIBREF16": {
            "ref_id": "b16",
            "title": "The involuntary capture of attention 628 by novel feature pairings: A study of voice-location integration in auditory sensory 629 memory. Attention, Perception, and Psychophysics",
            "authors": [
                {
                    "first": "F",
                    "middle": [
                        "B R"
                    ],
                    "last": "Parmentier",
                    "suffix": ""
                },
                {
                    "first": "M",
                    "middle": [
                        "T"
                    ],
                    "last": "Maybery",
                    "suffix": ""
                },
                {
                    "first": "J",
                    "middle": [],
                    "last": "Elsley",
                    "suffix": ""
                }
            ],
            "year": 2010,
            "venue": "",
            "volume": "71",
            "issn": "",
            "pages": "1439--1459",
            "other_ids": {}
        },
        "BIBREF18": {
            "ref_id": "b18",
            "title": "The VideoToolbox software for visual psychophysics: Transforming 632 numbers into movies",
            "authors": [
                {
                    "first": "D",
                    "middle": [
                        "G"
                    ],
                    "last": "Pelli",
                    "suffix": ""
                }
            ],
            "year": 1997,
            "venue": "Spatial Vision",
            "volume": "10",
            "issn": "",
            "pages": "437--442",
            "other_ids": {}
        },
        "BIBREF20": {
            "ref_id": "b20",
            "title": "Updating P300: An Integrative Theory of P3a and P4b",
            "authors": [
                {
                    "first": "J",
                    "middle": [],
                    "last": "Polich",
                    "suffix": ""
                }
            ],
            "year": 2007,
            "venue": "Neurophysiology",
            "volume": "635",
            "issn": "10",
            "pages": "2128--2148",
            "other_ids": {}
        },
        "BIBREF22": {
            "ref_id": "b22",
            "title": "Cognitive neuroscience: Neural mechanisms for detecting 638 and remembering novel events",
            "authors": [
                {
                    "first": "C",
                    "middle": [],
                    "last": "Ranganath",
                    "suffix": ""
                },
                {
                    "first": "G",
                    "middle": [],
                    "last": "Rainer",
                    "suffix": ""
                }
            ],
            "year": 2003,
            "venue": "Nature Reviews Neuroscience",
            "volume": "4",
            "issn": "3",
            "pages": "193--202",
            "other_ids": {}
        },
        "BIBREF24": {
            "ref_id": "b24",
            "title": "A pilot study of 641 subthalamic theta frequency deep brain stimulation for cognitive dysfunction in Parkinson's 642 disease",
            "authors": [
                {
                    "first": "K",
                    "middle": [
                        "W"
                    ],
                    "last": "Scangos",
                    "suffix": ""
                },
                {
                    "first": "C",
                    "middle": [
                        "S"
                    ],
                    "last": "Carter",
                    "suffix": ""
                },
                {
                    "first": "G",
                    "middle": [],
                    "last": "Gurkoff",
                    "suffix": ""
                },
                {
                    "first": "L",
                    "middle": [],
                    "last": "Zhang",
                    "suffix": ""
                },
                {
                    "first": "K",
                    "middle": [],
                    "last": "Shahlaie",
                    "suffix": ""
                }
            ],
            "year": 2017,
            "venue": "Brain Stimulation",
            "volume": "11",
            "issn": "",
            "pages": "456--458",
            "other_ids": {
                "DOI": [
                    "10.1016/j.brs.2017.11.014"
                ]
            }
        },
        "BIBREF26": {
            "ref_id": "b26",
            "title": "No reuse allowed without permission. (which was not certified by peer review) is the author/funder, who has granted medRxiv a license to display the preprint in perpetuity. The copyright holder for this preprint this version posted",
            "authors": [],
            "year": 2021,
            "venue": "",
            "volume": "",
            "issn": "",
            "pages": "",
            "other_ids": {
                "DOI": [
                    "10.1101/2021.06.24.21259502"
                ]
            }
        },
        "BIBREF27": {
            "ref_id": "b27",
            "title": "Parkinson's disease. Npj Parkinson's Disease",
            "authors": [],
            "year": null,
            "venue": "",
            "volume": "",
            "issn": "",
            "pages": "",
            "other_ids": {}
        },
        "BIBREF29": {
            "ref_id": "b29",
            "title": "Frontal 648 theta and beta oscillations during lower-limb movement in Parkinson's disease",
            "authors": [
                {
                    "first": "A",
                    "middle": [],
                    "last": "Singh",
                    "suffix": ""
                },
                {
                    "first": "R",
                    "middle": [],
                    "last": "Cole",
                    "suffix": ""
                },
                {
                    "first": "A",
                    "middle": [],
                    "last": "Espinoza",
                    "suffix": ""
                },
                {
                    "first": "D",
                    "middle": [],
                    "last": "Brown",
                    "suffix": ""
                },
                {
                    "first": "J",
                    "middle": [],
                    "last": "Cavanagh",
                    "suffix": ""
                },
                {
                    "first": "N",
                    "middle": [],
                    "last": "Narayanan",
                    "suffix": ""
                }
            ],
            "year": 2020,
            "venue": "Clinical",
            "volume": "649",
            "issn": "",
            "pages": "",
            "other_ids": {}
        },
        "BIBREF31": {
            "ref_id": "b31",
            "title": "Mid-frontal theta activity is 651 diminished during cognitive control in Parkinson's disease",
            "authors": [
                {
                    "first": "A",
                    "middle": [],
                    "last": "Singh",
                    "suffix": ""
                },
                {
                    "first": "S",
                    "middle": [],
                    "last": "Richardson",
                    "suffix": ""
                },
                {
                    "first": "N",
                    "middle": [],
                    "last": "Narayanan",
                    "suffix": ""
                },
                {
                    "first": "J",
                    "middle": [],
                    "last": "Cavanagh",
                    "suffix": ""
                }
            ],
            "year": 2018,
            "venue": "Neuropsychologia",
            "volume": "117",
            "issn": "",
            "pages": "652--113",
            "other_ids": {
                "DOI": [
                    "10.1016/j.neuropsychologia.2018.05.020"
                ]
            }
        },
        "BIBREF32": {
            "ref_id": "b32",
            "title": "Higher Nervous Functions: The Orienting Reflex",
            "authors": [
                {
                    "first": "E",
                    "middle": [
                        "N"
                    ],
                    "last": "Sokolov",
                    "suffix": ""
                }
            ],
            "year": 1962,
            "venue": "",
            "volume": "",
            "issn": "",
            "pages": "",
            "other_ids": {}
        },
        "BIBREF34": {
            "ref_id": "b34",
            "title": "Brain oscillations reveal impaired novelty detection from early stages of",
            "authors": [
                {
                    "first": "J",
                    "middle": [],
                    "last": "Garcell",
                    "suffix": ""
                }
            ],
            "year": 2018,
            "venue": "",
            "volume": "",
            "issn": "",
            "pages": "",
            "other_ids": {}
        },
        "BIBREF37": {
            "ref_id": "b37",
            "title": "Two 659 Independent Frontal Midline Theta Oscillations during Conflict Detection and Adaptation in 660 a Simon-Type Manual Reaching Task",
            "authors": [
                {
                    "first": "T",
                    "middle": [],
                    "last": "Töllner",
                    "suffix": ""
                },
                {
                    "first": "Y",
                    "middle": [],
                    "last": "Wang",
                    "suffix": ""
                },
                {
                    "first": "S",
                    "middle": [],
                    "last": "Makeig",
                    "suffix": ""
                },
                {
                    "first": "H",
                    "middle": [
                        "J"
                    ],
                    "last": "Müller",
                    "suffix": ""
                },
                {
                    "first": "T.-P",
                    "middle": [],
                    "last": "Jung",
                    "suffix": ""
                },
                {
                    "first": "K",
                    "middle": [],
                    "last": "Gramann",
                    "suffix": ""
                }
            ],
            "year": 2017,
            "venue": "The Journal of Neuroscience",
            "volume": "37",
            "issn": "9",
            "pages": "2504--2515",
            "other_ids": {}
        },
        "BIBREF40": {
            "ref_id": "b40",
            "title": "Short latency activation of cortex during 664 clinically effective subthalamic deep brain stimulation for Parkinson's disease",
            "authors": [
                {
                    "first": "E",
                    "middle": [],
                    "last": "Montgomery",
                    "suffix": ""
                },
                {
                    "first": "B",
                    "middle": [],
                    "last": "Guthrie",
                    "suffix": ""
                },
                {
                    "first": "R",
                    "middle": [],
                    "last": "Watts",
                    "suffix": ""
                }
            ],
            "year": 2012,
            "venue": "",
            "volume": "",
            "issn": "",
            "pages": "",
            "other_ids": {}
        },
        "BIBREF43": {
            "ref_id": "b43",
            "title": "No reuse allowed without permission. (which was not certified by peer review) is the author/funder, who has granted medRxiv a license to display the preprint in perpetuity. The copyright holder for this preprint this version posted",
            "authors": [],
            "year": 2016,
            "venue": "",
            "volume": "",
            "issn": "",
            "pages": "",
            "other_ids": {
                "DOI": [
                    "10.1101/2021.06.24.21259502"
                ]
            }
        },
        "BIBREF46": {
            "ref_id": "b46",
            "title": "Midline frontal cortex low-frequency activity drives subthalamic 671 nucleus oscillations during conflict",
            "authors": [
                {
                    "first": "A",
                    "middle": [],
                    "last": "Brown",
                    "suffix": ""
                },
                {
                    "first": "P",
                    "middle": [],
                    "last": "",
                    "suffix": ""
                }
            ],
            "year": 2014,
            "venue": "Journal of Neuroscience",
            "volume": "34",
            "issn": "21",
            "pages": "7322--7333",
            "other_ids": {}
        },
        "BIBREF49": {
            "ref_id": "b49",
            "title": "Fronto-subthalamic phase synchronization and cross-675 frequency coupling during conflict processing",
            "authors": [
                {
                    "first": "M",
                    "middle": [],
                    "last": "Aron",
                    "suffix": ""
                },
                {
                    "first": "A",
                    "middle": [
                        "R"
                    ],
                    "last": "Chen",
                    "suffix": ""
                },
                {
                    "first": "R",
                    "middle": [],
                    "last": "",
                    "suffix": ""
                }
            ],
            "year": 2021,
            "venue": "NeuroImage",
            "volume": "238",
            "issn": "",
            "pages": "",
            "other_ids": {}
        },
        "BIBREF51": {
            "ref_id": "b51",
            "title": "Human 678 striatal activation reflects degree of stimulus saliency",
            "authors": [
                {
                    "first": "C",
                    "middle": [
                        "F"
                    ],
                    "last": "Zink",
                    "suffix": ""
                },
                {
                    "first": "G",
                    "middle": [],
                    "last": "Pagnoni",
                    "suffix": ""
                },
                {
                    "first": "J",
                    "middle": [],
                    "last": "Chappelow",
                    "suffix": ""
                },
                {
                    "first": "M",
                    "middle": [],
                    "last": "Martin-Skurski",
                    "suffix": ""
                },
                {
                    "first": "G",
                    "middle": [
                        "S"
                    ],
                    "last": "Berns",
                    "suffix": ""
                }
            ],
            "year": 2006,
            "venue": "NeuroImage",
            "volume": "29",
            "issn": "3",
            "pages": "977--983",
            "other_ids": {}
        },
        "BIBREF54": {
            "ref_id": "b54",
            "title": "Multiple midfrontal thetas revealed by source separation of simultaneous MEG and EEG",
            "authors": [],
            "year": null,
            "venue": "",
            "volume": "",
            "issn": "",
            "pages": "",
            "other_ids": {}
        }
    },
    "ref_entries": {
        "FIGREF0": {
            "text": "86 activity during attentional orienting, conflict, interval timing, and responses to startling stimuli 87 (Cavanagh et al., 2018; K.-H. Chen et al., 2016; Kelley et al., 2018; Lange et al., 2016; Parker et 88 al., 2015; Singh et al., 2018, 2021; Solís-Vivanco et al., 2018). Furthermore, we have found that 89 during interval timing midfrontal ~4-Hz rhythms are coherent with field potentials in the 90 subthalamic nucleus (STN) (Kelley et al., 2018). Notably, Singh and colleagues (2021) found 91 that attenuated ~4-Hz EEG oscillatory activity during interval timing was predictive of cognition 92 as measured by the Montreal Cognitive Assessment (MoCA), suggesting that the recruitment of 93 midfrontal ~4-Hz oscillations reflects general cognitive-control processes. These data lead to the 94",
            "latex": null,
            "type": "figure"
        },
        "FIGREF1": {
            "text": "96 patients and healthy older adult subjects (Andrés et al., 2006; Escera et al., 1998; Parmentier et 97 al., 2008, 2010). In addition, we recorded midfrontal EEG and intracranial STN neurons during 98",
            "latex": null,
            "type": "figure"
        },
        "FIGREF2": {
            "text": "included both an EEG experiment and an intraoperative neurophysiology 111 experiment. For the EEG experiment, we recruited PD patient-volunteers and demographically-112 similar control participants (see",
            "latex": null,
            "type": "figure"
        },
        "FIGREF3": {
            "text": "Disorders clinic at University of Iowa Hospitals and Clinics (UIHC). Healthy older adults were 114 recruited to serve as control participants from either the Seniors Together in Aging Research 115 (STAR) registry or a list of people who previously participated in research in our lab and agreed 116 to be contacted for new research opportunities. Participants were considered healthy if they did 117 not have any neurological and psychological diseases or disorders. Participants were recruited by 118 email or phone and received compensation of $30/hour. All procedures were approved by the 119 University of Iowa (UI) Institutional Review Board (IRB) (#201707828).",
            "latex": null,
            "type": "figure"
        },
        "FIGREF5": {
            "text": "Andrés et al., 2006; Escera et al., 1998; Parmentier et al., 2008, 2010; Parmentier & Hebrero, 136 2013). This task was presented using the PsychToolbox-3 functions (Brainard, 1997; Kleiner et 137 al., 2007; Pelli, 1997, http://psychtoolbox.org/) in MATLAB 2018b on either a Linux or 138 Windows computer. Task-specific audio was played through Dell Rev A01 speakers positioned 139 on either side of the monitor. Responses were made with the left and right index fingers on a 140 standard QWERTY USB-keyboard. In addition to the cross-modal oddball distractor task, 141 participants completed additional cognitive and motor tasks, as well as detailed 142 neuropsychological and neuropsychiatric assessments as part of other protocols (Singh et al., 143 2018, 2021).",
            "latex": null,
            "type": "figure"
        },
        "FIGREF7": {
            "text": "157 described above, 10% contained an unexpected auditory oddball cue (non-repeating, randomly-158 created sine wave that sounded like a birdcall or robotic noise lasting 200 ms in duration) in 159 place of the expected tone, and 10% contained an unexpected visual oddball cue (unique 160 shape/color combination) in place of the green circle. Because visual stimuli were not presented 161 during intraoperative research, only auditory oddball trials were analyzed.",
            "latex": null,
            "type": "figure"
        },
        "FIGREF8": {
            "text": "were performed according to methods described in detail previously(Singh   165    et al., 2020, 2021). Briefly, we used a 64-channel EEG actiCAP (Brain Products GmbH) with a 166 0.1-Hz high-pass filter and a sampling frequency of 500 Hz. We used electrode Pz as reference167    and electrode FPz as the ground. EEG activity was referenced according to the procedures 168 described inSingh et al., (2020Singh et al., ( , 2021. Briefly, an additional channel was recorded at the mid-169 inion region (Iz), and we removed unreliable Fp1, Fp2, FT9, FT10, TP9, and TP10 channels,",
            "latex": null,
            "type": "figure"
        },
        "FIGREF9": {
            "text": "170resulting in 59 channels for pre-and post-processing. Data were epoched around the cues from -171 1000 ms to 2500 ms peri-cue.",
            "latex": null,
            "type": "figure"
        },
        "FIGREF11": {
            "text": "We computed spectral measures by multiplying the fast Fourier transformed (FFT) power 180 spectrum of single-trial EEG data with the FFT power spectrum of a set of complex Morlet 181 wavelets (defined as a Gaussian-windowed complex sine wave: e i2πtf e -t^2/(2xσ^2) , where t=time and 182 f=frequency). Wavelets increased from 1-50 Hz in 50 logarithmically-spaced steps, which 183 defined the width of each frequency band, increasing from 3-10 cycles between 1-50 Hz and 184 taking the inverse FFT (Cohen, 2014). The end result of this process was identical to time-185 domain signal convolution, and it resulted in estimates of instantaneous power (the magnitude of 186 the analytic signal) and phase angle (the arctangent of the analytic signal). We then cut the length 187 of each signal accordingly for each trial (-500 ms to 1000 ms). These short temporal epochs 188 reflect the wavelet-weighted influence of longer time and frequency periods. Power was 189 normalized by converting to a decibel (dB) scale (10*log10(powert/powerbaseline)), allowing us to 190 directly compare the effects across frequency bands. The baseline for each frequency was 191 calculated by averaging power from -300 ms to -200 ms prior to cue onset (Singh et al., 2018, 192 2020, 2021). A 100 ms duration is often used as an effective baseline since pixel-wise time-193 frequency data points have already been resolved over smoothed temporal and frequency 194 dimensions with the wavelets. For plotting purposes only, statistical-cluster-based thresholding 195 All rights reserved. No reuse allowed without permission.",
            "latex": null,
            "type": "figure"
        },
        "FIGREF12": {
            "text": "minimum cluster-size of 500 pixels) was used to visualize areas where temporal-frequency 196 power differed between controls and PD patients (Figure 2D, black contours). Our previous 197 work has focused on diminished midfrontal cue-triggered ~4-Hz rhythms in PD, although we 198 have observed differences across 1-8 Hz depending on the specific demands elicited by the task 199 (e.g. 1-4 Hz novelty vs. 4-8 Hz control-related processes) (K.H. Chen et al., 2016; Kim et al., 200 2017; Narayanan et al., 2013; Singh et al., 2018, 2020, 2021).201 202",
            "latex": null,
            "type": "figure"
        },
        "FIGREF13": {
            "text": "207and does not require a monitor for visual stimuli, 2) it is relatively simple in that it requires a 208 motor response to tones, and 3) several trials can be collected in a few minutes. Similar 3-tone209 designs have been used previously (Debener et al., 2005), in which novelty is probed with novel 210 tones. All stimuli were auditory and presented at an appropriate volume through earbuds or 211 external speaker to be clearly heard over operating room noise. The task and stimuli were 212 presented using PsychToolbox-3 in MATLAB 2018b on a Windows laptop. Responses were 213 made with a Kinesis pedal that the patients held in their hands. Participants pressed buttons with 214 their thumbs to respond.",
            "latex": null,
            "type": "figure"
        },
        "FIGREF15": {
            "text": "221 tones, as patients responded with their right hand for both the standard tones and the novel 222 oddball tones, facilitating a direct comparison of novelty induced motor initiation. Patients 223 practiced the task with 30 trials preoperatively and again on the morning of surgery. The 224 intraoperative experiment was conducted after the clinically-necessary microelectrode recording 225 electrodes were confirmed to be in the STN based on clinical recordings.",
            "latex": null,
            "type": "figure"
        },
        "FIGREF16": {
            "text": "electrodes were implanted sequentially during a single stereotactic procedure.229    Participants received short-acting pain relief and sedative medications such as remifentanil 230 and/or dexmedetomidine; these were stopped >1 hour prior to the task for participants to be231 maximally awake for necessary clinical testing and participation in research. Patients underwent 232 standard bilateral DBS lead implantations using indirect framed stereotactic STN targeting, 233 refined by microelectrode recordings from 0.4 to 0.8 mΩ tungsten electrodes (Alpha-Omega, 234 Inc). Three simultaneous microelectrode recording tracks were used, consisting of anterior, 235 middle, and posterior trajectories, separated by 2 mm center-to-center from an entry point near 236 the coronal suture. STN margins were defined by the functional and electrical properties from 237 these microelectrode recordings, in line with standard clinical practice. Because microelectrode 238recordings were clinically necessary, participants were not exposed to extra electrode 239 penetrations to participate in the study.",
            "latex": null,
            "type": "figure"
        },
        "FIGREF18": {
            "text": "Cadwell Industries, Inc) were placed over frontal locations on the forehead at the hairline with 243 right and left electrodes approximating F1 and F2 and midfrontal lead approximating Fz (Figure 244 4A). A reference electrode was placed on the left mastoid. We recorded EEG because this 245 location indexes midfrontal ~4-Hz rhythms and is in line with prior work (K.-H. Chen et al., 246 2016; Kelley et al., 2018; Narayanan et al., 2013; Singh et al., 2021). EEG recordings were 247 recorded at 24 kHz and subsequently downsampled to 500 Hz. Signal was filtered below 50 Hz 248 with a low-pass filter, followed by a 1-Hz high-pass filter. Microelectrode recordings were 249 sampled at 24 kHz, amplified, and filtered for single neurons (1-8 kHz) and STN local field 250 potentials (<200 Hz). Neurophysiological and behavioral data were acquired simultaneously 251 using a Tucker-Davis Technologies multi-channel data acquisition system. 252 After the experiments, Offline Sorter (Plexon) was used to analyze STN activity and remove 253 artifacts. Spike activity was analyzed for all cells that fired at rates above 0.1 Hz. Principal 254 component analysis (PCA) and waveform shape were used for spike sorting. Single units were 255 defined as those 1) having a consistent waveform shape, 2) being a separable cluster in PCA 256 space, and 3) having a consistent refractory period of at least 2 ms in interspike interval 257 histograms. Isolated STN single units were included for analyses if 1) the recording location was 258confirmed by the neurosurgeon to be in the STN based on clinically-necessary and observable 259 STN firing patterns during surgery, and 2) the unit was held throughout the duration of the task.",
            "latex": null,
            "type": "figure"
        },
        "FIGREF20": {
            "text": "274 mixed-effects model with random intercept for participants' time-frequency power to compare 275 average time-frequency-power between groups. The fixed-effect predictors included group, tone 276 type, MoCA score, and Unified Parkinson's Disease Rating Scale (UPDRS) Part 3 as control 277 variables and time-frequency power from the a priori region of interest (ROI) as the outcome 278 variable. We set our alpha for these analyses at 0.05. The MoCA score was included in the model 279 as a covariate given that it was different between groups. UPDRS Part 3 was included as a 280 covariate for PD subjects in order to account for degree of motor impairment. These analyses 281 were conducted in R. 282 Neuronal modulations were defined via a generalized linear model (GLM) for each neuron, 283 where the outcome variable was firing rate, and the predictor variable was cue or response, 284 consistent with past work (Emmons et al., 2019, 2020). For each neuron, we constructed a model 285 All rights reserved. No reuse allowed without permission.",
            "latex": null,
            "type": "figure"
        },
        "FIGREF21": {
            "text": "Across the ensemble, p values were corrected via Benjamini-Hochberg false-discovery-rate 288 (FDR; Benjamini & Yekutieli, 2001), with p values <0.05 considered significant modulation for 289 each neuron. We also analyzed neuronal patterns using PCA of peri-event histograms around 290 response binned at 0.1 second with kernel-density estimates (bandwidth 0.25). Finally, we 291 analyzed midfrontal EEG-STN coherence with the Neurospec 2.0 coherence toolbox using the 292 sp2a_m1 function with a segment power of 9 and a window size of 250 ms. To compare 293",
            "latex": null,
            "type": "figure"
        },
        "FIGREF23": {
            "text": "Accuracy was high overall (Median (1 st Quartile-3 rd Quartile); Control: standard 99.4% 313 (99%-100%), novel 100% (100%-100%); PD: standard 98.2% (93.3%-99.4%), novel 97.9% (92-314 100%)), although control participants were more accurate than PD patients (F(1,73)=11.1, 315 p=0.001). There was no main effect of tone type (F(1,73)=0.39, p=0.54), and no interaction 316 between group and tone type (F(1,73)=1.61, p=0.21). Regarding response speed, on trials with a 317 distracting novel tone, control subjects responded approximately the same as on trials with a 318 standard tone (Median (1 st Quartile-3 rd Quartile); Control: novel 454 ms (426-514), standard 454 319 ms (426-531 ms)), whereas PD patients responded more slowly compared to trials with a 320 standard tone (PD: novel 505 ms (439-571 ms), standard 462 ms (416-515 ms); Figure 1B). 321 There was a significant main effect of tone type (F(1,73)=22.4 p<0.001), but this appears to be 322 driven by the effect within the PD group. There was no significant effect of Control vs. PD on 323 reaction time (F(1,73)=1.0, p=0.32); however, there was a significant interaction between the 324 effects of group and tone type on reaction time ( F(1,73)=6.0, p=0.02). Post-hoc analyses revealed 325 that within the PD group, there was a significant difference between reaction times for the tone 326 types (t(73)=-6.2, p<0.0001). No other post hoc contrast was significant.",
            "latex": null,
            "type": "figure"
        },
        "FIGREF25": {
            "text": ", top panel)336    and smaller negative deflections around 100 ms and 200 ms for novel tone trials(Figure 2A,337    bottom panel). In all participants, novel tone trials showed a late (>300 ms) positive component 338 compared to the leveling off observed in the standard tone trials (e.g. the \"P3a\"). This positive 339 deflection appeared to be higher for PD subjects than control subjects; however, the possibility 340 of an underlying low-frequency contribution across the entire ERP in PD subjects suggests that 341 time-frequency analysis might be more effective in isolating unique temporal events that differ 342 between groups.343    We examined power from an a priori tf-ROI (4-8 Hz for 300-400 ms post-tones; blue box in 344Figure 2D). Our linear mixed-effects model revealed a significant effect of tone type on this tf-345 ROI (F(1,73)=51.1, p<0.001), with novel trials showing higher 4-8 Hz band power. However, 346 there were no significant main effects of group, MoCA, or UPDRS Part 3, and there was not a 347 significant interaction between group and trial condition (F(1,73)=3.7, p=0.06). We found that 348 there was no significant relationship between midfrontal ~4-Hz power and novelty-related 349 slowing (Spearman r=-0.16, p=0.17), indicating that average ~4-Hz power across novelty trials 350 may not directly translate to performance on this task. Further, ~4-Hz power in our tf-ROI on 351 novel trials did not correlate significantly with MoCA (Spearman r=0.13, p=0.28) or UPDRS 352Part 3 (for PD group only; Spearman r=-0.24, p=0.10), suggesting that midfrontal activity 353 during this task may not be associated with general cognitive functioning or affected by PD 354 All rights reserved. No reuse allowed without permission.",
            "latex": null,
            "type": "figure"
        },
        "FIGREF26": {
            "text": "Participants performed the task with a median accuracy of 87% (Q1-Q3: 82%-92%); there was 362 no difference in median accuracy or reaction time between tone types (accuracy: standard 86% 363 (77%-93%), novel 90% (80%-95%), p=0.21, effect size r=0.71; reaction time: standard 877 ms 364 (721-1024 ms), novel 875 ms (761-936 ms), p=0.99, effect size r=0.71;",
            "latex": null,
            "type": "figure"
        },
        "FIGREF27": {
            "text": "To further characterize the patterns of neuronal activity, we utilized PCA, a proven, data-379 driven technique, to characterize neuronal activity (Chapin & Nicolelis, 1999; Narayanan & 380 Laubach, 2009). We found that the first component (principal component 1; PC1) explained 381",
            "latex": null,
            "type": "figure"
        },
        "FIGREF28": {
            "text": "related STN neurons had low-frequency coherence with midfrontal EEG 392 Finally, we were interested in the relationship between STN neuronal activity with scalp 393 EEG-related modulations. We examined spike-field coherence, through which we could link the 394 activity of midfrontal scalp electrodes to STN spiking (Kim & Narayanan, 2019; Narayanan et 395 al., 2013; Parker et al., 2014, 2015). For some STN neurons, we noticed that spikes fired in-396 phase with low-frequency scalp EEG activity (Figure 7A). Among response-related STN 397 neurons, we noticed significant low-frequency spike-field scalp-STN coherence after the cue 398 around the time of responses",
            "latex": null,
            "type": "figure"
        },
        "FIGREF29": {
            "text": "rank sum p=0.003; effect size r=0.40). These data provide evidence that 402 STN response-related activity could reflect frontal top-down novelty-induced orienting and 403 control. Together, these data support the idea that novelty can trigger midfrontal low-frequency 404 rhythms, which in turn engage subcortical STN circuits involved in response control.",
            "latex": null,
            "type": "figure"
        },
        "FIGREF31": {
            "text": "410 compared to control participants, PD patients had an attenuated midfrontal response ~4-Hz 411 (although this activity was not linked with novelty-related slowing or cognitive status); 2) STN 412 neurons were strongly modulated by novel responses, and 3) STN response-related neurons 413 exhibited low frequency coherence with midfrontal EEG activity. Our findings provide a better 414 understanding of midfrontal-STN cognitive control systems in PD and neuronal responses to 415 novel information. 416 Midfrontal ~4-Hz rhythms are prominently triggered by events that recruit cognitive control 417 such as errors, conflict, feedback, and novelty (Cavanagh & Frank, 2014; Cohen & Donner, 418 2013; Singh et al., 2018). Our past work found that this response is highly conserved in humans 419 and rodents, and cortical dopamine is critical for coupling of cortical neurons with low-frequency 420 oscillations (Narayanan et al., 2013; Parker et al., 2015). Taken together, our data support the 421 All rights reserved. No reuse allowed without permission.",
            "latex": null,
            "type": "figure"
        },
        "FIGREF32": {
            "text": "Our work here is in line with past studies from our group and others showing that PD patients 424 have attenuated midfrontal rhythms between 1-8 Hz (Cavanagh et al., 2018; K.-H. Chen et al., 425 2016; Giller et al., 2020; Singh et al., 2018, 2021; Solís-Vivanco et al., 2018). This line of work 426 includes data from the Simon reaction-time task (Singh et al., 2018), interval timing tasks (Singh 427 et al., 2021), and working memory manipulations (Itthipuripat et al., 2013). Our past work has 428 found that midfrontal 1-4 Hz frequencies are attenuated in PD (Kim et al., 2017; Parker et al., 429 2014) and strongly correlated with cognitive function during an interval timing task (Singh et al., 430 2021), although in the present study, these bands were novelty-specific but not reliably distinct 431 between control and PD patients (Figure 2, bottom panel and 2D). By contrast, we found that 432 novelty-triggered midfrontal 4-8 Hz oscillations were attenuated in PD but did not correlate with 433 novelty-related slowing. There are multiple generators of mid-frontal low-frequency activity 434 (Zuure et al., 2020), and it is possible that lower frequencies (1-4 Hz) are more commonly 435 evoked by an orienting response (Cavanagh et al., 2018; Parker et al., 2015; Wessel et al., 2016), 436 and higher frequencies (5-8 Hz) represent performance-related cognitive control (Cavanagh & 437 Frank, 2014; Cohen & Donner, 2013; Singh et al., 2018; Töllner et al., 2017; Zuure et al., 2020).",
            "latex": null,
            "type": "figure"
        },
        "FIGREF33": {
            "text": ". Our work is consistent with prior studies of STN neural activity; indeed, 440 Bockova and colleagues (2011) found that the STN was modulated by distractor stimuli with a 441 positive ERP peak around 200 ms, and Brittain and colleagues (2012) found that response442",
            "latex": null,
            "type": "figure"
        },
        "FIGREF34": {
            "text": "theta features could couple with lower-frequency (~2 Hz) STN oscillations,447    resulting in a novelty-induced slowing mechanism. This could suggest that the cortex has more 448 sophisticated information integration whereas the STN could more simply carry out reactive449 responses to novelty (e.g. stop & orient). Multiple studies have indirectly demonstrated 450 connectivity between the frontal cortex and the STN in a pathway known as the hyperdirect 451 pathway (Brunenberg et al., 2012; Haynes & Haber, 2013). This pathway was described by 452 Nambu and colleagues (2002) as a cortico-subthalamo-pallidal pathway involved in motor 453 control and output. Intraoperative stimulation studies have demonstrated monosynaptic 454 hyperdirect connectivity (W. Chen et al., 2020; Kelley et al., 2018; Miocinovic et al., 2018; 455 Walker et al., 2012). It is possible that STN-midfrontal spike-field coherence is a result of either 456 hyperdirect connectivity or feed-forward activity via the basal ganglia indirect pathway, or both. 457 Experimentally teasing these contributions apart may require experiments in nonhuman systems 458 in which basal ganglia pathways can be reversibly inactivated while recording from STN 459 neurons. 460 Our data help us understand how PD impacts novelty-related responses. Previous studies have 461 shown that PD patients present with impaired habituation over repeated stimulus presentations, 462 and that attenuated midfrontal theta activity is related to the rate of startle habituation (Cavanagh 463 et al., 2018; K.H. Chen et al., 2016). Importantly, EEG habituation to novelty can effectively 464 classify PD patients (Cavanagh et al., 2018). In our study, PD patients were not as successful as465",
            "latex": null,
            "type": "figure"
        },
        "FIGREF35": {
            "text": "481 STN during novelty. Our findings align with recent work demonstrating clinical relevance of 482 midfrontal ~4-Hz activity in PD (Singh et al., 2021; Solís-Vivanco et al., 2018). Further, small 483 studies have revealed that STN low-frequency (~4-5 Hz) stimulation can beneficially impact 484 conflict (Scangos et al., 2017) and interval timing (Kelley et al., 2018). These findings in humans 485 are further supported by evidence from animal models of PD showing that highly-specific low-486 frequency stimulation can improve interval timing (Kim et al., 2017; Kim & Narayanan, 2019).",
            "latex": null,
            "type": "figure"
        },
        "FIGREF36": {
            "text": "It is possible, though it remains to be demonstrated in humans, that stimulating the STN at 4 Hz 488 resolves impaired midfrontal ~4-Hz oscillatory activity. Restoring behaviorally-relevant ~4-Hz 489 All rights reserved. No reuse allowed without permission.",
            "latex": null,
            "type": "figure"
        },
        "FIGREF37": {
            "text": "493 neurons in the STN are modulated around responses to novelty, and that neurons in the STN and 494 the midfrontal cortex have low-frequency coherence around responses to novelty. Our data 495 illuminate how novelty modulates ~4-Hz rhythms in hyperdirect circuits, which may provide 496 insight into neuronal responses to novelty and PD-related changes in cognitive control. This 497 work may be significant in the development of novel biomarkers or treatments for PD and other 498 brain diseases degrading basal ganglia circuits.",
            "latex": null,
            "type": "figure"
        },
        "TABREF0": {
            "text": "surgery. If they agreed, a researcher separate from the surgical team discussed the research 127 protocols with them, obtained informed consent, and completed a brief practice session of the 128 task. All intraoperative research procedures were approved by the UI IRB (#201402730). All 129 patients were tested on levodopa as our past work has shown that levodopa does not reliably modulate midfrontal ~4 Hz rhythms(Singh et al., 2018(Singh et al.,  , 2021. Levodopa-equivalent doses",
            "latex": null,
            "type": "table"
        },
        "TABREF4": {
            "text": "All data and statistical approaches were reviewed by the UI Biostatistics, Epidemiology, andResearch Design Core at the Institute for Clinical and Translational Science. All code and data are available at narayanan.lab.uiowa.edu. For demographic summary statistics, medians and interquartile ranges were calculated for continuous measures. Counts and percentages were calculated for categorical measures. EEG participant demographics were stratified by group and gender. Intraoperative patient-volunteer demographics were stratified by gender. We used the nonparametric Wilcoxon rank sum test to test for differences in age, education, and MoCA between strata. For behavioral data, we used a linear mixed-effects model with random intercept for participants' response time to capture the effects of predictor variables (tone type: standard vs novel tones and group: PD vs control) on response time. For behavioral data for the 272 intraoperative task, we used the nonparametric Wilcoxon rank sum test to test for differences between different sound stimuli on accuracy and reaction time. For EEG data, we used a linear",
            "latex": null,
            "type": "table"
        },
        "TABREF5": {
            "text": "in which the outcome variable was the firing rate binned at 0.1 seconds, and the predictor variable was either cue or response. Main effects comparisons were made stratified by neuron.",
            "latex": null,
            "type": "table"
        },
        "TABREF6": {
            "text": "shows demographics for the EEG study andTable 2shows demographics for the intraoperative study. For EEG participants, demographic results were stratified by group and gender. Wilcoxon test results showed that the groups were not significantly different in terms of age (p=0.38, effect size r=0.10) or years of education (p=0.09, effect size r=0.20). The MoCA score was higher for the control subjects compared to PD subjects (p<0.01, effect size r=0.36), thus we accounted for MoCA in our analyses.",
            "latex": null,
            "type": "table"
        },
        "TABREF8": {
            "text": "PD patients had attenuated ~4-Hz midfrontal rhythms",
            "latex": null,
            "type": "table"
        },
        "TABREF9": {
            "text": "motor symptoms. These data are convergent with our past work showing that that midfrontal ~4-Hz rhythms signify cues and are distinct in PD, but are not specifically linked with responseHuman single STN neurons were modulated around responses to noveltyTo comprehensively investigate the cortico-striatal pathways underling novelty-modulated responses, we leveraged intraoperative neurophysiology to record from single STN neurons.",
            "latex": null,
            "type": "table"
        },
        "TABREF10": {
            "text": "idea that midfrontal low-frequency rhythms recruit neuronal resources to respond to new",
            "latex": null,
            "type": "table"
        },
        "TABREF12": {
            "text": "The copyright holder for this preprint this version posted June 30, 2021. ; https://doi.org/10.1101/2021.06.24.21259502 doi: medRxiv preprint RC, NN, JFC, and JG conceived and designed experiments; RC and AE recorded EEG data; RC",
            "latex": null,
            "type": "table"
        },
        "TABREF13": {
            "text": "EEG patient-volunteer demographics",
            "latex": null,
            "type": "table"
        }
    },
    "back_matter": [
        {
            "text": "(which was not certified by peer review) is the author/funder, who has granted medRxiv a license to display the preprint in perpetuity. (which was not certified by peer review) is the author/funder, who has granted medRxiv a license to display the preprint in perpetuity. (which was not certified by peer review) is the author/funder, who has granted medRxiv a license to display the preprint in perpetuity. (which was not certified by peer review) is the author/funder, who has granted medRxiv a license to display the preprint in perpetuity.The copyright holder for this preprint this version posted June 30, 2021. ; https://doi.org/10.1101/2021.06.24.21259502 doi: medRxiv preprint All rights reserved. No reuse allowed without permission.(which was not certified by peer review) is the author/funder, who has granted medRxiv a license to display the preprint in perpetuity. tone (10%; of note, 10% of trials used a novel visual stimulus; these trials were not analyzed).",
            "cite_spans": [],
            "ref_spans": [],
            "section": "annex"
        },
        {
            "text": "The arrow required a left \"p\" or right \"q\" key press, based on the direction. B) Reaction time for 697 Control and PD patients; each dot represents an individual's median RT and the thick horizontal 698 bar represents group medians. Novel oddball stimuli disproportionately distracted PD subjects.",
            "cite_spans": [],
            "ref_spans": [],
            "section": "696"
        },
        {
            "text": "Compared to Control participants, PD patients responded more slowly to the arrow on trials 700 when novel distractors were presented relative to a standard tone. * indicates a significant main 701 effect of tone type (standard vs. novel). # indicates a significant interaction between tone type 702 All rights reserved. No reuse allowed without permission.(which was not certified by peer review) is the author/funder, who has granted medRxiv a license to display the preprint in perpetuity. (which was not certified by peer review) is the author/funder, who has granted medRxiv a license to display the preprint in perpetuity. (which was not certified by peer review) is the author/funder, who has granted medRxiv a license to display the preprint in perpetuity. (which was not certified by peer review) is the author/funder, who has granted medRxiv a license to display the preprint in perpetuity. (which was not certified by peer review) is the author/funder, who has granted medRxiv a license to display the preprint in perpetuity. Response-locked peri-event raster of neuronal firing from an exemplar neuron; the top panel is a 748 All rights reserved. No reuse allowed without permission.(which was not certified by peer review) is the author/funder, who has granted medRxiv a license to display the preprint in perpetuity.The copyright holder for this preprint this version posted June 30, 2021. ; https://doi.org/10.1101/2021.06.24.21259502 doi: medRxiv preprint peri-response raster, with each row representing one trial and each tick representing an action 749 potential. The bottom panel represents a peri-event histogram of firing rate around all responses.",
            "cite_spans": [],
            "ref_spans": [],
            "section": "699"
        },
        {
            "text": "All rights reserved. No reuse allowed without permission.(which was not certified by peer review) is the author/funder, who has granted medRxiv a license to display the preprint in perpetuity. (which was not certified by peer review) is the author/funder, who has granted medRxiv a license to display the preprint in perpetuity. (which was not certified by peer review) is the author/funder, who has granted medRxiv a license to display the preprint in perpetuity. (which was not certified by peer review) is the author/funder, who has granted medRxiv a license to display the preprint in perpetuity. Response-modulated neurons (17) Non-response modulated neurons (37) All rights reserved. No reuse allowed without permission.(which was not certified by peer review) is the author/funder, who has granted medRxiv a license to display the preprint in perpetuity.The copyright holder for this preprint this version posted June 30, 2021. ; https://doi.org/10.1101/2021.06.24.21259502 doi: medRxiv preprint confidence-interval for coherence for comparison across neurons. Data from 54 STN neurons in 779 17 PD patient-volunteers.",
            "cite_spans": [],
            "ref_spans": [],
            "section": "751"
        },
        {
            "text": "All rights reserved. No reuse allowed without permission.(which was not certified by peer review) is the author/funder, who has granted medRxiv a license to display the preprint in perpetuity. (which was not certified by peer review) is the author/funder, who has granted medRxiv a license to display the preprint in perpetuity.The copyright holder for this preprint this version posted June 30, 2021. ; https://doi.org/10.1101/2021.06.24.21259502 doi: medRxiv preprint",
            "cite_spans": [],
            "ref_spans": [],
            "section": "781"
        }
    ]
}