{
    "paper_id": "0a19f1ea3897e408a84b3d461e0fc7853b81f087",
    "metadata": {
        "title": "PEER REVIEW HISTORY TITLE (PROVISIONAL) The effect of interventions for the wellbeing, satisfaction and flourishing of general practitioners -A systematic review AUTHORS",
        "authors": [
            {
                "first": "Diana",
                "middle": [
                    ";"
                ],
                "last": "Naehrig",
                "suffix": "",
                "affiliation": {},
                "email": ""
            },
            {
                "first": "Aaron",
                "middle": [
                    ";"
                ],
                "last": "Schokman",
                "suffix": "",
                "affiliation": {},
                "email": ""
            },
            {
                "first": "Jessica",
                "middle": [
                    ";"
                ],
                "last": "Hughes",
                "suffix": "",
                "affiliation": {},
                "email": ""
            },
            {
                "first": "Ronald",
                "middle": [
                    ";"
                ],
                "last": "Epstein",
                "suffix": "",
                "affiliation": {},
                "email": ""
            },
            {
                "first": "Ian",
                "middle": [
                    ";"
                ],
                "last": "Hickie",
                "suffix": "",
                "affiliation": {},
                "email": ""
            },
            {
                "first": "",
                "middle": [],
                "last": "Glozier",
                "suffix": "",
                "affiliation": {},
                "email": ""
            },
            {
                "first": "",
                "middle": [],
                "last": "Nick",
                "suffix": "",
                "affiliation": {},
                "email": ""
            }
        ]
    },
    "abstract": [
        {
            "text": "VERSION 1 -REVIEW",
            "cite_spans": [],
            "ref_spans": [],
            "section": "Abstract"
        },
        {
            "text": "Anne Speckens Radboudumc Instituut voor Wetenschappelijk Onderwijs en Opleidingen, Psychiatry REVIEW RETURNED 27-Dec-2020",
            "cite_spans": [],
            "ref_spans": [],
            "section": "Abstract"
        },
        {
            "text": "This is a systematic review of interventions on wellbeing and related positive outcomes in general practitioners. The authors included 19 studies: 6 RCTs, 3 non-controlled trials and 8 non-controlled studies with a total of 1141 participants. Interventions targeted both individuals and organisations, an included health system policy change. Mindfulness-based interventions were the most common with medium to large within and between group effect sizes for mindfulness outcomes, and small to medium effect sizes for other positive outcomes. The authors conclude that there is remarkably little evidence on how to improve PCP wellbeing beyond using mindfulness interventions, particularly interventions addressing organizational or system factors. A strong point of the review is that its protocol was pre-registered in PROSPERO.",
            "cite_spans": [],
            "ref_spans": [],
            "section": "Abstract"
        },
        {
            "text": "The authors might need to re-check the manuscript for typos. I came across a few of them throughout the paper.",
            "cite_spans": [],
            "ref_spans": [],
            "section": "Abstract"
        },
        {
            "text": "REVIEWER",
            "cite_spans": [],
            "ref_spans": [],
            "section": "Abstract"
        },
        {
            "text": "Katherine Petrie Black Dog Institute",
            "cite_spans": [],
            "ref_spans": [],
            "section": "Abstract"
        },
        {
            "text": "15-Mar-2021",
            "cite_spans": [],
            "ref_spans": [],
            "section": "Abstract"
        },
        {
            "text": "Clearly state all the outcomes (all of them) in the abstract. Provide a definition of each in the outcome measures, as some are quite vague. Mention both quantative and qualitative data was extracted.",
            "cite_spans": [],
            "ref_spans": [],
            "section": "Abstract"
        },
        {
            "text": "Double checking that there was not an Ethics application submitted to cover this project? If not, state this and explain why not in the paper.",
            "cite_spans": [],
            "ref_spans": [],
            "section": "Abstract"
        },
        {
            "text": "Provide PROSPERO registration number.",
            "cite_spans": [],
            "ref_spans": [],
            "section": "Abstract"
        },
        {
            "text": "Provide a separate paragraph in Discussion attending to limitations and strengths of the article. The information box on pg 6 on this is not comprehensive enough.",
            "cite_spans": [],
            "ref_spans": [],
            "section": "Abstract"
        },
        {
            "text": "Overall comment: ensure consistent use of a term, i.e. GP or PCP, from early on in the paper. Use of various terms for the target population is a little confusing, especially given that this is likely to have an international audience who may be familiar with other terms. Set the key term up early and be consistent throughout.",
            "cite_spans": [],
            "ref_spans": [],
            "section": "Abstract"
        },
        {
            "text": "Be consistent in terminology for the group of interestclinician, frontline doctors, GGPS, and PCPs are all mentioned. If GPs are your target group, then perhaps state this clearly in objectives and/or Conclusion too to contextualise findings.",
            "cite_spans": [],
            "ref_spans": [],
            "section": "Abstract"
        },
        {
            "text": "Define what types of outcome measures were eligibleboth validated and non-validated questionnaires, all self-report. State that studies with both positive and negative outcomes will be included, but that the engative outcomes will not be subject to quantitative analysis.",
            "cite_spans": [],
            "ref_spans": [],
            "section": "Abstract"
        },
        {
            "text": "Provide registration number for PROSPERO.",
            "cite_spans": [],
            "ref_spans": [],
            "section": "Abstract"
        },
        {
            "text": "Typo in box title: \"Strengths\"",
            "cite_spans": [],
            "ref_spans": [],
            "section": "Abstract"
        },
        {
            "text": "Add English only articles were included as a limitation.",
            "cite_spans": [],
            "ref_spans": [],
            "section": "Abstract"
        }
    ],
    "body_text": [
        {
            "text": "The authors have chosen to focus only on wellbeing and related positive outcomes and to exclude studies on burnout, distress or mental ill-health. As they mention themselves, good mental health is not a synonym of flourishing, nor is mental ill-health a synonym of languishing. However, the two do have a relationship with each other and as the research on burnout, distress and mental ill-health is more extensive and exists for longer, it seems a pity to have excluded these studies in this review about GPs. Could the authors pay a bit more attention on the relationship between psychological symptoms and well-being in both the introduction and the discussion of their paper, reflecting on the impact of having excluded studies focusing on mental ill-health from their review? Methods I compliment the authors of having consulted a specialist librarian to support their literature search. The protocol in PROSPERO mentions that one reviewer (DNA) would initially review all titles and abstracts while a second reviewer would be consulted. In the manuscript it says that sample screening of titles was performed by two reviewers and showed excellent agreement. Could the authors comment on the number of titles were reviewed by two reviewers and the exact figure of the inter-rater reliability?",
            "cite_spans": [],
            "ref_spans": [],
            "section": "Introduction"
        },
        {
            "text": "In alignment with this, the protocol in PROSPERO and the manuscript mention that two reviewers (DNA and AS) would independently screen the full text articles. What was their inter-rater reliability of in-and exclusion before any disagreements were resolved through discussion? And the same applies to the independent application of the Cochrane RoB2 to RCTs. Any information about the inter-rater reliability before discussion and consensus? Results",
            "cite_spans": [],
            "ref_spans": [],
            "section": "Introduction"
        },
        {
            "text": "The addition of 12 studies through hand search is quite puzzling. Any explanation about why they did not turn up in the systematic search?",
            "cite_spans": [],
            "ref_spans": [],
            "section": "Introduction"
        },
        {
            "text": "The authors mention that none of the studies evaluated flourishing, but that negative outcome measures were often concurrently reported. Sixteen studies employed the Maslach Burnout Inventory or other stress-related measures. I do think it would be interesting if the authors could include the findings on the negative outcome measures, and the possible inter-relationship with flourishing, in their review. Discussion I really appreciate the authors' suggestions for future research. They are well structured, helpful and relevant, particularly the measures that can be taken to reduce bias. I agree with the authors that there needs to be more consensus and clarity of definition regarding \"physician wellness\". On the basis of their review, could they provide a few specific suggestions? The authors mention they endorse an intensified effort to explore organisational interventions to improve wellbeing and satisfaction. It might be interesting for them to refer to the possible impact of mindfulness and meditation on the quality of leadership necessary to achieve this. I have taken the liberty to refer to a few possible sources I know of: How medical specialists experience the effects of a mindful leadership course on their leadership capabilities: a qualitative interview study in the Netherlands. -020-1948-5 . Final report of Understanding and responding to societal demands on corporal responsibility (RESPONSE). Sixth framework programme, priority 7, \"Citizens and Governance in a Knowledge Based Society\". The results of the first field experiments on Corporate Social Responsibility training effectiveness ever attempted, reported in Ch. 9, show that: the standard executive education approach based on engaged discussions and case analyses fails to facilitate managers to shift towards higher probabilities to make socially responsible decisions. On the other hand, coaching programs based on introspection and meditation techniques, without any discussion about Corporate Social Responsibility topics, exhibit a significant impact on both the probability to act in a socially responsible way and on the factors that influence the probability to behave that way At last",
            "cite_spans": [
                {
                    "start": 1309,
                    "end": 1320,
                    "text": "-020-1948-5",
                    "ref_id": null
                }
            ],
            "ref_spans": [],
            "section": "Introduction"
        },
        {
            "text": "Paragraph 1: Define the job role of GPs and mention you will also be referring them as PCPs. Terminology differs internationally so set your definition.",
            "cite_spans": [],
            "ref_spans": [],
            "section": "Introduction"
        },
        {
            "text": "Are there any prevalence studies on wellbeing / job satisfaction with representative samples of GP/doctors? To prove that these outcomes need addressing in and of themselves. Just because stress is high doesn't necessarily mean GP wellbeing is low.",
            "cite_spans": [],
            "ref_spans": [],
            "section": "Introduction"
        },
        {
            "text": "Consider removing subheadings and incorporating them in a topic sentence. Introduction is not long enough to need division.",
            "cite_spans": [],
            "ref_spans": [],
            "section": "Introduction"
        },
        {
            "text": "One subheading in italics, the other is not. Make consistent.",
            "cite_spans": [],
            "ref_spans": [],
            "section": "Introduction"
        },
        {
            "text": "Specify how the ref 24 systematic review was not sufficient in addressing your objectives? Sounds like they had a similar remit. Perhaps specify how this review needs to be extended as rationale for your current study design.",
            "cite_spans": [],
            "ref_spans": [],
            "section": "Introduction"
        },
        {
            "text": "Define the different levels of interventionindividual and organisational.",
            "cite_spans": [],
            "ref_spans": [],
            "section": "Introduction"
        },
        {
            "text": "Specify the dates on which search was undertaken.",
            "cite_spans": [],
            "ref_spans": [],
            "section": "Methods"
        },
        {
            "text": "Consider also hand-screening the included articles of the systematic reviews you have already identified in the Introduction and others that are relevant to your topic that come up on Cochrane. To crosscheck you have found all those that they did, and not missed any.",
            "cite_spans": [],
            "ref_spans": [],
            "section": "Methods"
        },
        {
            "text": "How many titles were sample screened by both reviewers? Provide N.",
            "cite_spans": [],
            "ref_spans": [],
            "section": "Methods"
        },
        {
            "text": "Provide Kappa for agreement rating.",
            "cite_spans": [],
            "ref_spans": [],
            "section": "Methods"
        },
        {
            "text": "Consider using formal rating scale for non-RCT studies, such as the ROBINS-1 tool suggested by Cochrane.",
            "cite_spans": [],
            "ref_spans": [],
            "section": "Methods"
        },
        {
            "text": "Make it clearer that you are extracting qualitative outcomes tooinclude this n the abstract also.",
            "cite_spans": [],
            "ref_spans": [],
            "section": "Methods"
        },
        {
            "text": "Under 'Participants', describe response rate mean and range. Describe settings where the populations worked, and mean (range) sample size. Describe the main roles represented e.g. GPs (40%) Consider running a sensitivity analysis without the outlier with high attrition rate.",
            "cite_spans": [],
            "ref_spans": [],
            "section": "Results"
        },
        {
            "text": "Under 'Intervention type', specify that the two studies from the UK were considered systemic level interventions.",
            "cite_spans": [],
            "ref_spans": [],
            "section": "Results"
        },
        {
            "text": "Summarise how many studies used long term follow-ups, and what the mean/range timeframe for these periods was. Clarify for these studies, what timepoint you used as the data point.",
            "cite_spans": [],
            "ref_spans": [],
            "section": "Results"
        },
        {
            "text": "Under 'Outcomes', consider summarising the most frequently employed outcomes measureswere any used in a number of studies and so could then do a specific quantitative analysis for just that outcome measure?",
            "cite_spans": [],
            "ref_spans": [],
            "section": "Results"
        },
        {
            "text": "Under 'Outcomes', specify how many were validated and how many were non validated scales. With those that are validated, ie the PANAS, include a reference to the tool and a validation study.",
            "cite_spans": [],
            "ref_spans": [],
            "section": "Results"
        },
        {
            "text": "Specify how many studies concurrently reported negative outcomes too. In the discussion, justify why you did not extract and report results for efficacy on these negative outcomes too?",
            "cite_spans": [],
            "ref_spans": [],
            "section": "Results"
        },
        {
            "text": "Consider adding a paragraph discussing qualitive outcomes separatelymay add detail to contextualise what are all quantitative assessments.",
            "cite_spans": [],
            "ref_spans": [],
            "section": "Results"
        },
        {
            "text": "Page 14: You mention a possible small study effectconsider running a post hoc analysis excluding that study ref 42 from the analysis and see whether effects change.",
            "cite_spans": [],
            "ref_spans": [],
            "section": "Discussion"
        },
        {
            "text": "Under 'suggestions for future research': remove all abbreviations of \"don't\" in the manuscript.",
            "cite_spans": [],
            "ref_spans": [],
            "section": "Discussion"
        },
        {
            "text": "Consider that some of the selection of outcome measures explanation might be suited to the introduction instead/as well?",
            "cite_spans": [],
            "ref_spans": [],
            "section": "Discussion"
        },
        {
            "text": "Clarity of definition is clearly important. Also consider emphasising the need for validated assessment tools that apply these clear, consistent definitionsor at least , the need for these to be developed and standardised to allow for consistent assessment of these as outcomes. This seems to be a major limitation of your included studies, and of this field in general.",
            "cite_spans": [],
            "ref_spans": [],
            "section": "Discussion"
        },
        {
            "text": "Under 'organisational and systemic interventions': The main focus here seems to be burnout, but your outcome of interest is wellbeing. Are there any studies of organisational approaches on wellbeing?",
            "cite_spans": [],
            "ref_spans": [],
            "section": "Discuss validity of ES across such varied measures."
        },
        {
            "text": "The discussion seems to be including both negative and positive outcomes, despite the review's aim to focus on wellbeing and other positive outcomes, which is slightly confusing. Consider including more citations of such positive outcomes in doctors or other healthcare workforces.",
            "cite_spans": [],
            "ref_spans": [],
            "section": "Discuss validity of ES across such varied measures."
        },
        {
            "text": "Add a paragraph on limitations and strengths to Discussionneed to include limitations of English only, justify why did not search before 2000, discuss issues around combining different outcomes measures to calculate effect sizes, justify why dual coding of risk of bias was not undertaken, was data extraction in Table 1 undertaken by one person onlyif so, was it verified by another for a random sample? Limitations also inherent in the included studies themselves self report, different settings/countriescultural biases? Consider ",
            "cite_spans": [],
            "ref_spans": [
                {
                    "start": 313,
                    "end": 320,
                    "text": "Table 1",
                    "ref_id": null
                }
            ],
            "section": "Discuss validity of ES across such varied measures."
        },
        {
            "text": "Final word typo: \"premature\".",
            "cite_spans": [],
            "ref_spans": [],
            "section": "Conclusion"
        },
        {
            "text": "• Clearly state all the outcomes (all of them) in the abstract. Provide a definition of each in the outcome measures, as some are quite vague. • Mention both quantitative and qualitative data was extracted.",
            "cite_spans": [],
            "ref_spans": [],
            "section": "Reviewer 2 comments:"
        },
        {
            "text": "• Double checking that there was not an Ethics application submitted to cover this project? If not, state this and explain why not in the paper. • Provide registration number for PROSPERO.",
            "cite_spans": [],
            "ref_spans": [],
            "section": "Reviewer 2 comments:"
        },
        {
            "text": "• Provide a separate paragraph in Discussion attending to limitations and strengths of the article. The information box on page 6 is not comprehensive enough. • Overall comment: ensure consistent use of a term, i.e., GP or PCP, from early on in the paper. Use of various terms for the target population is a little confusing, especially given that this is likely to have an international audience who may be familiar with other terms. Set the key term up early and be consistent throughout. • Be consistent in terminology for the group of interestclinician, frontline doctors, GGPS, and PCPs are all mentioned. If GPs are your target group, then perhaps state this clearly in objectives and/or Conclusion too to contextualise findings. • Define acronym PCP.",
            "cite_spans": [],
            "ref_spans": [],
            "section": "Reviewer 2 comments:"
        },
        {
            "text": "• Define what types of outcome measures were eligibleboth validated and non-validated questionnaires, all self-report. State that studies with both positive and negative outcomes will be included, but that the negative outcomes will not be subject to quantitative analysis • Provide registration number for PROSPERO.",
            "cite_spans": [],
            "ref_spans": [],
            "section": "Reviewer 2 comments:"
        },
        {
            "text": "• Typo in the box title: \"Strengths\" • Add English only articles were included as a limitation.",
            "cite_spans": [],
            "ref_spans": [],
            "section": "Reviewer 2 comments:"
        },
        {
            "text": "Our response:",
            "cite_spans": [],
            "ref_spans": [],
            "section": "Reviewer 2 comments:"
        },
        {
            "text": "Taking the word count limit into consideration we have incorporated reviewer comments where possible in both abstract and the full text.",
            "cite_spans": [],
            "ref_spans": [],
            "section": "Reviewer 2 comments:"
        },
        {
            "text": "• We've consistently used the term General Practitioner (GP) for the abstract (track changes page 3), and have more clearly defined and used terminology in the full text (track changes page 4 and 5). • The information box (article summary) has been updated (page 4).",
            "cite_spans": [],
            "ref_spans": [],
            "section": "Reviewer 2 comments:"
        },
        {
            "text": "• There was no HREC application made, this has been stated and explained under 'ethical considerations' under acknowledgements (track changes page 17).",
            "cite_spans": [],
            "ref_spans": [],
            "section": "Reviewer 2 comments:"
        },
        {
            "text": "Reviewer 1 comments:",
            "cite_spans": [],
            "ref_spans": [],
            "section": "INTRODUCTION"
        },
        {
            "text": "The authors have chosen to focus only on wellbeing and related positive outcomes and to exclude studies on burnout, distress, or mental ill-health. As they mention themselves, good mental health is not a synonym of flourishing, nor is mental ill-health a synonym of languishing. However, the two do have a relationship with each other and as the research on burnout, distress and mental ill-health is more extensive and exists for longer, it seems a pity to have excluded these studies in this review about GPs.",
            "cite_spans": [],
            "ref_spans": [],
            "section": "INTRODUCTION"
        },
        {
            "text": "• Could the authors pay a bit more attention on the relationship between psychological symptoms and well-being in both the introduction and the discussion of their paper, reflecting on the impact of having excluded studies focusing on mental ill-health from their review?",
            "cite_spans": [],
            "ref_spans": [],
            "section": "INTRODUCTION"
        },
        {
            "text": "Reviewer 2 comments:",
            "cite_spans": [],
            "ref_spans": [],
            "section": "INTRODUCTION"
        },
        {
            "text": "• Paragraph 1: Define the job role of GPs and mention you will also be referring them as PCPs. Terminology differs internationally so set your definition. • Are there any prevalence studies on wellbeing / job satisfaction with representative samples of GP/doctors? To prove that these outcomes need addressing in and of themselves. Just because stress is high doesn't necessarily mean GP wellbeing is low. • Consider removing subheadings and incorporating them in a topic sentence. Introduction is not long enough to need division. • One subheading in italics, the other is not. Make consistent.",
            "cite_spans": [],
            "ref_spans": [],
            "section": "INTRODUCTION"
        },
        {
            "text": "• Specify how the ref 24 systematic review was not sufficient in addressing your objectives? Sounds like they had a similar remit. Perhaps specify how this review needs to be extended as rationale for your current study design. • Define the different levels of interventionindividual and organisational.",
            "cite_spans": [],
            "ref_spans": [],
            "section": "INTRODUCTION"
        },
        {
            "text": "Our response:",
            "cite_spans": [],
            "ref_spans": [],
            "section": "INTRODUCTION"
        },
        {
            "text": "We deliberately chose to conduct a systematic review exploring positive outcomes only, as there already is a substantial focus in the medical and psychological literature on negative outcomes such as burnout, distress, mental ill-health. Moreover, general practitioners, are not a priori a clinical population, therefore, we reasoned it may be more beneficial to apply a positive framework and look at the interventions that support and enable wellbeing, satisfaction, and flourishing. In that sense we are taking at most a preventative stance, as opposed to a 'fix what is broken' angle. We do recognise that burnout is a large part of the ongoing conversation in health care, which is why we touched on this both in our introduction and in our discussion.",
            "cite_spans": [],
            "ref_spans": [],
            "section": "INTRODUCTION"
        },
        {
            "text": "So, the main intention of this SR was not to explore negative outcomes, nor was it intended as an indepth exploration of the relationship between positive and negative outcomes. Also, our PROSPERO protocol was not set up for this, and we feel this would constitute a significant digression from the protocol.",
            "cite_spans": [],
            "ref_spans": [],
            "section": "INTRODUCTION"
        },
        {
            "text": "• Bearing this in mind, we have accounted for both reviewers' comments, and explained our rationale more clearly in the introduction (track changes on pages 5 and 6), in the objectives (track changes on page 6), and we have expanded on why we have undertaken this systematic review in the way we did, and which gaps we aimed to address, taking into consideration previously published studies (such as ref 24) (see track changes on page 6).",
            "cite_spans": [],
            "ref_spans": [],
            "section": "INTRODUCTION"
        },
        {
            "text": "• We have now used consistent terminology throughout regarding participants, and have provided an explanation of the terms used to describe participants (track changes on page 4), individual and organisational interventions (track changes on page 5).",
            "cite_spans": [],
            "ref_spans": [],
            "section": "INTRODUCTION"
        },
        {
            "text": "• Formatting has been adapted as requested (see track changes on page 5).",
            "cite_spans": [],
            "ref_spans": [],
            "section": "INTRODUCTION"
        },
        {
            "text": "I compliment the authors of having consulted a specialist librarian to support their literature search.",
            "cite_spans": [],
            "ref_spans": [],
            "section": "Reviewer 1 comments:"
        },
        {
            "text": "The protocol in PROSPERO mentions that one reviewer (DNA) would initially review all titles and abstracts while a second reviewer would be consulted. In the manuscript it says that sample screening of titles was performed by two reviewers and showed excellent agreement.",
            "cite_spans": [],
            "ref_spans": [],
            "section": "Reviewer 1 comments:"
        },
        {
            "text": "• Could the authors comment on the number of titles were reviewed by two reviewers and the exact figure of the inter-rater reliability?",
            "cite_spans": [],
            "ref_spans": [],
            "section": "Reviewer 1 comments:"
        },
        {
            "text": "In alignment with this, the protocol in PROSPERO and the manuscript mention that two reviewers (DNA and AS) would independently screen the full text articles.",
            "cite_spans": [],
            "ref_spans": [],
            "section": "Reviewer 1 comments:"
        },
        {
            "text": "• What was their inter-rater reliability of in-and exclusion before any disagreements were resolved through discussion?",
            "cite_spans": [],
            "ref_spans": [],
            "section": "Reviewer 1 comments:"
        },
        {
            "text": "And the same applies to the independent application of the Cochrane RoB2 to RCTs.",
            "cite_spans": [],
            "ref_spans": [],
            "section": "Reviewer 1 comments:"
        },
        {
            "text": "• Any information about the inter-rater reliability before discussion and consensus?",
            "cite_spans": [],
            "ref_spans": [],
            "section": "Reviewer 1 comments:"
        },
        {
            "text": "Reviewer 2 comments:",
            "cite_spans": [],
            "ref_spans": [],
            "section": "Reviewer 1 comments:"
        },
        {
            "text": "• Specify the dates on which search was undertaken.",
            "cite_spans": [],
            "ref_spans": [],
            "section": "Reviewer 1 comments:"
        },
        {
            "text": "• Consider also hand-screening the included articles of the systematic reviews you have already identified in the Introduction and others that are relevant to your topic that come up on Cochrane. To cross-check you have found all those that they did, and not missed any. • How many titles were sample screened by both reviewers? Provide N.",
            "cite_spans": [],
            "ref_spans": [],
            "section": "Reviewer 1 comments:"
        },
        {
            "text": "• Provide Kappa for agreement rating.",
            "cite_spans": [],
            "ref_spans": [],
            "section": "Reviewer 1 comments:"
        },
        {
            "text": "• Consider using formal rating scale for non-RCT studies, such as the ROBINS-1 tool suggested by Cochrane. • Make it clearer that you are extracting qualitative outcomes tooinclude this n the abstract also.",
            "cite_spans": [],
            "ref_spans": [],
            "section": "Reviewer 1 comments:"
        },
        {
            "text": "Our response:",
            "cite_spans": [],
            "ref_spans": [],
            "section": "Reviewer 1 comments:"
        },
        {
            "text": "We have responded to reviewer comments.",
            "cite_spans": [],
            "ref_spans": [],
            "section": "Reviewer 1 comments:"
        },
        {
            "text": "• The search date has been provided.",
            "cite_spans": [],
            "ref_spans": [],
            "section": "Reviewer 1 comments:"
        },
        {
            "text": "• Thank you for the suggestions of hand-screening of systematic reviews included in the introduction, this has been done. • A repeat cross-check of Cochrane reviews on 17/05/2021 identified a recent and relevant publication on interventions to improve resilience in health care professionals more broadly (4). This publication was hand searched without identifying any further articles for inclusion. • We have clarified the description of our screening process and provided inter-rater reliability for abstract and for full text article screening (see track changes on page 7). • Whilst doing our SR we researched different risk of bias tools, and deemed the Cochrane Risk of Bias tool best suited. • We have clarified the description of our risk of bias assessment (see track changes on page 8). • Extraction of quantitative and qualitative outcomes was added (see track changes page 7).",
            "cite_spans": [],
            "ref_spans": [],
            "section": "Reviewer 1 comments:"
        },
        {
            "text": "• The addition of 12 studies through hand search is quite puzzling. Any explanation about why they did not turn up in the systematic search? • The authors mention that none of the studies evaluated flourishing, but that negative outcome measures were often concurrently reported. Sixteen studies employed the Maslach Burnout Inventory or other stress-related measures. I do think it would be interesting if the authors could include the findings on the negative outcome measures, and the possible interrelationship with flourishing, in their review.",
            "cite_spans": [],
            "ref_spans": [],
            "section": "Reviewer 1 comments:"
        },
        {
            "text": "• Under 'Participants', describe response rate mean and range. Describe settings where the populations worked, and mean (range) sample size. Describe the main roles represented e.g., GPs (40%) • Consider running a sensitivity analysis without the outlier with high attrition rate. • Under 'Intervention type', specify that the two studies from the UK were considered systemic level interventions. • Summarise how many studies used long term follow-ups, and what the mean/range timeframe for these periods was. Clarify for these studies, what timepoint you used as the data point. • Under 'Outcomes', consider summarising the most frequently employed outcomes measures were any used in a number of studies and so could then do a specific quantitative analysis for just that outcome measure? • Under 'Outcomes', specify how many were validated and how many were non validated scales. With those that are validated, i.e., the PANAS, include a reference to the tool and a validation study. • Specify how many studies concurrently reported negative outcomes too. In the discussion, justify why you did not extract, and report results for efficacy on these negative outcomes too? • Consider adding a paragraph discussing qualitive outcomes separatelymay add detail to contextualise what are all quantitative assessments.",
            "cite_spans": [],
            "ref_spans": [],
            "section": "Reviewer 2 comments:"
        },
        {
            "text": "The relationship between burnout and positive aspects of mental health such as flourishing, or wellbeing is indeed an interesting one. There is a large literature on this in the psychological field (5-9), and conceptual disaggregation was not the aim of the SR. Before commencing the SR, we deliberately chose not to include negative outcome measures, nor did we intend to explore the interrelationship of positive outcomes and negative outcomes as these have been done before in other samples (7, 8) . We aimed to adhere to our previously published PROSPERO protocol as closely as possible and would rightly have been criticised for undertaking a substantially different review.",
            "cite_spans": [
                {
                    "start": 494,
                    "end": 497,
                    "text": "(7,",
                    "ref_id": null
                },
                {
                    "start": 498,
                    "end": 500,
                    "text": "8)",
                    "ref_id": null
                }
            ],
            "ref_spans": [],
            "section": "Reviewer 2 comments:"
        },
        {
            "text": "• We have, however, expanded our discussion section on why we chose not to report results on efficacy of the negative outcome measures, and added a few additional thoughts (see track changes on page 9).",
            "cite_spans": [],
            "ref_spans": [],
            "section": "Reviewer 2 comments:"
        },
        {
            "text": "• The 12 additional studies identified through hand-search include: articles identified through a hand-search of previously published systematic reviews (see above), hand search of articles included in this SR, and follow-up of published conference abstracts by directly contacting of authors. We have clarified this in the manuscript text (track changes on page 8).",
            "cite_spans": [],
            "ref_spans": [],
            "section": "Reviewer 2 comments:"
        },
        {
            "text": "• We have actioned suggestions where feasible, and added mean sample size, and range for participants in the text (track changes on page 8). Further details on study populations are included in table 1. • We have also added information on long term follow-up including mean time span and range (track changes page 9). • We did not run any further analysis of the data, as the data quality and reporting are not optimal to start with, and we felt more granular analysis would likely not further contribute, or allow for any more robust conclusions. • As stated above, the aim was not to look at negative outcomes, which is why we did not calculate their effect sizes (see track changes on page 9). • We added information on the positive outcome measures and their validity (see track changes on page 9).",
            "cite_spans": [],
            "ref_spans": [],
            "section": "Reviewer 2 comments:"
        },
        {
            "text": "I really appreciate the authors' suggestions for future research. They are well structured, helpful, and relevant, particularly the measures that can be taken to reduce bias.",
            "cite_spans": [],
            "ref_spans": [],
            "section": "Reviewer 1 comments:"
        },
        {
            "text": "I agree with the authors that there needs to be more consensus and clarity of definition regarding \"physician wellness\".",
            "cite_spans": [],
            "ref_spans": [],
            "section": "Reviewer 1 comments:"
        },
        {
            "text": "• On the basis of their review, could they provide a few specific suggestions?",
            "cite_spans": [],
            "ref_spans": [],
            "section": "Reviewer 1 comments:"
        },
        {
            "text": "The authors mention they endorse an intensified effort to explore organisational interventions to improve wellbeing and satisfaction.",
            "cite_spans": [],
            "ref_spans": [],
            "section": "Reviewer 1 comments:"
        },
        {
            "text": "• It might be interesting for them to refer to the possible impact of mindfulness and meditation on the quality of leadership necessary to achieve this.",
            "cite_spans": [],
            "ref_spans": [],
            "section": "Reviewer 1 comments:"
        },
        {
            "text": "Reviewer 2 comments:",
            "cite_spans": [],
            "ref_spans": [],
            "section": "Reviewer 1 comments:"
        },
        {
            "text": "• Page 14: You mention a possible small study effectconsider running a post hoc analysis excluding that study ref 42 from the analysis and see whether effects change. • Under 'suggestions for future research': remove all abbreviations of \"don't\" in the manuscript.",
            "cite_spans": [],
            "ref_spans": [],
            "section": "Reviewer 1 comments:"
        },
        {
            "text": "• Consider that some of the selection of outcome measures explanation might be suited to the introduction instead/as well? • Clarity of definition is clearly important. Also consider emphasising the need for validated assessment tools that apply these clear, consistent definitionsor at least, the need for these to be developed and standardised to allow for consistent assessment of these as outcomes. This seems to be a major limitation of your included studies, and of this field in general. • Discuss validity of ES across such varied measures.",
            "cite_spans": [],
            "ref_spans": [],
            "section": "Reviewer 1 comments:"
        },
        {
            "text": "• Under 'organisational and systemic interventions': The main focus here seems to be burnout, but your outcome of interest is wellbeing. Are there any studies of organisational approaches on wellbeing? The discussion seems to be including both negative and positive outcomes, despite the review's aim to focus on wellbeing and other positive outcomes, which is slightly confusing. Consider including more citations of such positive outcomes in doctors or other healthcare workforces. • Add a paragraph on limitations and strengths to Discussionneed to include limitations of English only, justify why did not search before 2000, discuss issues around combining different outcomes measures to calculate effect sizes, justify why dual coding of risk of bias was not undertaken, was data extraction in Table 1 undertaken by one person onlyif so, was it verified by another for a random sample? Limitations also inherent in the included studies themselvesself report, different settings/countriescultural biases? Consider other Cochrane strengths/limitations. In defining wellbeing we draw on the well-established existing frameworks and definitions in the psychological literature, such as differentiating psychological wellbeing (Ryff, (10)), from subjective wellbeing (Diener, (11)) or flourishing (Seligman's PERMA, (12)). In terms of tools, for subjective wellbeing measures such as the validated Warwick Edinburgh Mental Wellbeing Scale (WEMWBS, (13, 14)) or 16) , and for Job satisfaction the Warr Cook Wall scale (WCW-JS, (17, 18)) could be useful.",
            "cite_spans": [
                {
                    "start": 1461,
                    "end": 1464,
                    "text": "16)",
                    "ref_id": null
                }
            ],
            "ref_spans": [
                {
                    "start": 799,
                    "end": 806,
                    "text": "Table 1",
                    "ref_id": null
                }
            ],
            "section": "Reviewer 1 comments:"
        },
        {
            "text": "• We have added this in the discussion (see track changes on page 15).",
            "cite_spans": [],
            "ref_spans": [],
            "section": "Reviewer 1 comments:"
        },
        {
            "text": "We very much appreciate the literature suggestions on mindful leadership courses in medical specialists by reviewer 1. And similarly, the excellent suggestion of reviewer 2 to discuss organisational interventions in health care populations, that might then also be applied within the context of general practice. We agree, that both approaches could proactively create an environment at work that is conducive to the wellbeing of GPs, but we can only review what has been published.",
            "cite_spans": [],
            "ref_spans": [],
            "section": "Reviewer 1 comments:"
        },
        {
            "text": "• We have added these considerations to our discussion (see track changes on page 14).",
            "cite_spans": [],
            "ref_spans": [],
            "section": "Reviewer 1 comments:"
        }
    ],
    "bib_entries": {
        "BIBREF0": {
            "ref_id": "b0",
            "title": "Thank you for the suggestion of doing a post hoc analysis to try and evaluate a very minor observation about intragroup and intergroup effect size differences in one of the outcomes (see original",
            "authors": [],
            "year": null,
            "venue": "",
            "volume": "13",
            "issn": "",
            "pages": "",
            "other_ids": {}
        },
        "BIBREF1": {
            "ref_id": "b1",
            "title": "As described above, we feel it would not add any more robustness to the systematic review and there is no explanation in the study",
            "authors": [],
            "year": null,
            "venue": "",
            "volume": "",
            "issn": "",
            "pages": "",
            "other_ids": {}
        }
    },
    "ref_entries": {
        "FIGREF0": {
            "text": "Under 'quality and risk of bias', specify more detailed recommendations of how to overcome the • Suggest some organisational and systemic interventions that might be implemented with GPs based on existing evidence with other health care workforces, or best practice modelsif there are limited studies of these, what are some examples that could be suggested based on your knowledge in this area? • Add paragraph on areas for Future Research Our response:",
            "latex": null,
            "type": "figure"
        },
        "TABREF0": {
            "text": "Vreeling K, Kersemaekers W, Cillessen L, van Dierendonck D, Speckens A.Vreeling K, et al. BMJ Open. 2019 Dec 15;9(12):e031643. doi: 10.1136/bmjopen-2019-031643. Effectiveness and feasibility of a mindful leadership course for medical specialists: a pilot study. Kersemaekers WM, Vreeling K, Verweij H, van der Drift M, Cillessen L, van Dierendonck D, Speckens AEM.Kersemaekers WM, et al. BMC Med Educ. 2020 Feb 4;20(1):34. doi: 10.1186/s12909",
            "latex": null,
            "type": "table"
        },
        "TABREF1": {
            "text": "other Cochrane strengths/limitations. Under 'quality and risk of bias', specify more detailed recommendations of how to overcome the Suggest some organisational and systemic interventions that might be implemented with GPsbased on existing evidence with other health care workforces, or best practice modelsif there are limited studies of these, what are some examples that could be suggested based on your knowledge in this area? Add paragraph on areas for Future Research",
            "latex": null,
            "type": "table"
        }
    },
    "back_matter": [
        {
            "text": "We fully agree that validated outcome tools specific to the construct being measured need to be implemented to improve the quality, reproducibility, and comparability of future trials.• We have now emphasised this more strongly in suggestions for future research (see track changes on page 15).• A paragraph on limitations has been added (see track changes on page 14).",
            "cite_spans": [],
            "ref_spans": [],
            "section": "annex"
        },
        {
            "text": "The authors might need to re-check the manuscript for typos. I came across a few of them throughout the paper.",
            "cite_spans": [],
            "ref_spans": [],
            "section": "Reviewer 1 comments:"
        },
        {
            "text": "Final word type: 'premature'.Our response:Spell-check has been completed.",
            "cite_spans": [],
            "ref_spans": [],
            "section": "Reviewer 2 comments:"
        },
        {
            "text": "28-May-2021",
            "cite_spans": [],
            "ref_spans": [],
            "section": "REVIEW RETURNED"
        },
        {
            "text": "The authors have addressed my comments to my full satisfaction and I am happy to recommend the revised paper to be accepted.",
            "cite_spans": [],
            "ref_spans": [],
            "section": "GENERAL COMMENTS"
        },
        {
            "text": "Katherine Petrie Black Dog Institute REVIEW RETURNED 11-Jun-2021",
            "cite_spans": [],
            "ref_spans": [],
            "section": "REVIEWER"
        },
        {
            "text": "Editing and modifications have been undertaken in a comprehensive manner and as such, the recommendation is to accept the article for publication.",
            "cite_spans": [],
            "ref_spans": [],
            "section": "GENERAL COMMENTS"
        }
    ]
}