{
    "paper_id": "0a281a09a22b7cdb23d837c146ebb448999a6007",
    "metadata": {
        "title": "Developing Acid-Responsive Glyco-Nanoplatform Based Vaccines for Enhanced Cytotoxic T-lymphocyte Responses Against Cancer and SARS-CoV-2",
        "authors": [
            {
                "first": "Yanan",
                "middle": [],
                "last": "Gao",
                "suffix": "",
                "affiliation": {},
                "email": ""
            },
            {
                "first": "Qingyu",
                "middle": [],
                "last": "Zhao",
                "suffix": "",
                "affiliation": {},
                "email": ""
            },
            {
                "first": "Huiling",
                "middle": [],
                "last": "Dong",
                "suffix": "",
                "affiliation": {},
                "email": ""
            },
            {
                "first": "Min",
                "middle": [],
                "last": "Xiao",
                "suffix": "",
                "affiliation": {},
                "email": ""
            },
            {
                "first": "Xuefei",
                "middle": [],
                "last": "Huang",
                "suffix": "",
                "affiliation": {},
                "email": ""
            },
            {
                "first": "Xuanjun",
                "middle": [],
                "last": "Wu",
                "suffix": "",
                "affiliation": {},
                "email": ""
            }
        ]
    },
    "abstract": [
        {
            "text": "In vivo CTL activity studies of AcDEX-(imine)-Sp-R NPs 14, 15 or 24 against SARS-CoV-2 protein S13 S5",
            "cite_spans": [],
            "ref_spans": [],
            "section": "Abstract"
        },
        {
            "text": "Materials OVAp (SIINFEKL) and OVAp FITC (FITC-SIINFEKL, Scheme S1) were acquired from NJPeptide Company (Nanjing, China) using solid-phase peptide synthesis (SPPS) from the Wang resins. The SARS-CoV-2 peptide Sp1 with the sequence of SYGFQPTNGVGYQPY was acquired from our previous study. [1] Chlorophenol red--D-galactopyranoside (CPRG) was purchased from J&K Scientific. LysoTracker Red was purchased from Beyotime. SARS-CoV-2 (2019-nCoV) spike S1+S2 ECD-His recombinant protein (Cat: 40589-V08B1), SARS-CoV-2 (2019-nCoV) nucleocapsid-His recombinant protein (Cat: 40588-V08B), and SARS-CoV-2 (2019-nCoV) spike pseudovirus (Cat: PSV001) were purchased from Sino Biological. PE-labeled anti-mouse H-2K b bound to SIINFEKL (H-2K b /SIINFEKL) antibody (Clone 25-D1.16) and FITC-labeled anti-mouse CD8 antibody (Clone 53-6.7) were purchased from Biolegend. FITC-labeled anti-mouse IgG2a (κ isotype control), FITC-labeled anti-mouse H-2K b antibody (AF6-88.5.5.3), FITC-labeled anti-mouse CD4 antibody (RM4-5), FITC-labeled anti-mouse CD86 antibody (GL1), and APC-labeled anti-CD45RO antibody (UCHL1) were purchased from eBioscience. Mouse TNF-α ELISA Kit (Cat: SEKM-0034) and mouse IFN-γ ELISA Kit (Cat: SEKM-0031) were purchased from Solarbio. QuickSwitch TM Custom MHC Tetramer Kit from MBL Beijing Biotech CO., LTD was used for the preparation of PE-labeled TSAPDTRPAP-MHC-I tetramer according to the manufacturer's instructions. Other chemicals were purchased from Sigma-Aldrich. EL4 lymphoma cells from the American Type Culture Collection (ATCC) were cultured in Roswell Park Memorial Institute (RPMI) 1640 medium containing 10% fetal bovine serum (FBS), 100 U mL −1 penicillin and 100 g mL −1 streptomycin, 2 mM L-glutamine, 1 mM sodium pyruvate. B3Z cells were cultured in RPMI 1640 medium with 10% FBS, 100 U mL −1 penicillin and 100 g mL −1 streptomycin, 2 mM L-glutamine, 1 mM sodium S6 pyruvate,50 M 2-mercaptoethanol. B16-MUC1 cells (from Cell Resource Center, Institute of Basic Medicine, Chinese Academy of Medical Sciences) were cultured in DMEM containing 10% fetal bovine serum (FBS), 100 U mL −1 penicillin and 100 g mL −1 streptomycin, 2 mM L-glutamine, 1 mM sodium pyruvate and 0.3 mg mL −1 G418. The cells were cultured at 37 ℃ in a 5% CO 2 /air incubator. Mouse bone marrow cells were generated and cultured in the presence of granulocyte-macrophage colony-stimulating factor (GM-CSF) for one week to generate BMDCs. [2] Confocal microscopic images were performed on Leica SP8 using the following filters: λex@488 nm and λem@500−530 nm for OVAp FITC ; λex@543 nm and λem@555-600 nm for LysoTracker Red. In vivo CTL studies were performed on a BD Accuri™ C6 Plus Flow Cytometer. C57BL/6 female mice aged 6−10 weeks from Shandong University Laboratory Animal Center were used for all studies. All animal experiments were conducted by the guidelines of the Animal Care and Use Committee of Shandong University.",
            "cite_spans": [],
            "ref_spans": [],
            "section": "Abstract"
        },
        {
            "text": "Dextran (2.5 g, Mw: 9 000−11 000 g mol −1 ) from Leuconostoc mesenteroides was dissolved in 10 mL of MilliQ-water. Sodium periodate (0.55 g, 2.6 mmol) was added to the solution. The reaction was stirred for 5 h at rt. Next, the product was purified by dialysis against MilliQ-water. After changing the water five times, the sample was lyophilized to afford a white powder (2 g), which was characterized by 1 H-NMR spectroscopy. 1 H-NMR (600 MHz, D 2 O): δ 4.95 (d, J = 3.6 Hz, 1H), 3.99 -3.86 (m, 2H), 3.75 -3.70 (m, 1H), 3.69",
            "cite_spans": [],
            "ref_spans": [],
            "section": "Abstract"
        },
        {
            "text": "(d, J = 9.3 Hz, 1H), 3.55 (dd, J = 9.8, 3.8 Hz, 1H), 3.50 (t, J = 9.7 Hz, 1H). The degree of oxidation was determined using a microplate bicinchoninic acid assay (please see Figure   S2 ). [3] ",
            "cite_spans": [
                {
                    "start": 189,
                    "end": 192,
                    "text": "[3]",
                    "ref_id": null
                }
            ],
            "ref_spans": [
                {
                    "start": 174,
                    "end": 185,
                    "text": "Figure   S2",
                    "ref_id": null
                }
            ],
            "section": "Abstract"
        }
    ],
    "body_text": [
        {
            "text": "Synthesis of partially oxidized acetalated dextran (Ox-AcDEX) polymer S6",
            "cite_spans": [],
            "ref_spans": [],
            "section": "Synthesis of partially oxidized dextran (Ox-DEX) polymer S6"
        },
        {
            "text": "The release profiles of Mp and R837 from AcDEX-(imine)-Mp-R NPs 6 and 12 S10",
            "cite_spans": [],
            "ref_spans": [],
            "section": "Quantification of CTLp and R837 in the NPs S9"
        },
        {
            "text": "In vivo CTL activity studies of AcDEX-(imine)-Mp-R NPs S10",
            "cite_spans": [],
            "ref_spans": [],
            "section": "Quantification of CTLp and R837 in the NPs S9"
        },
        {
            "text": "In vivo immunotherapy of tumor by AcDEX-(imine)-Mp-R NPs S11",
            "cite_spans": [],
            "ref_spans": [],
            "section": "Evaluation of antibody responses elicited by AcDEX-(imine)-Mp1-R NPs 6 S11"
        },
        {
            "text": "In vivo CTL activity studies of AcDEX-(imine)-Sp-R NPs 14 and 15 against SARS-CoV-2 spike pseudovirus S13 Scheme S1. The structure of OVAp FITC . S14 Figure S1 . 1 H-NMR spectra of dextran (DEX), partially oxidized dextran (Ox-DEX), and partially oxidized acetalated dextran (Ox-AcDEX) polymers. S15 Figure S2 . Standard curve of glucose by BCA Assay. S16 Figure S3 . FTIR spectrum of Ox-AcDEX NPs 1 as compared to acetalated dextran (AcDEX)",
            "cite_spans": [
                {
                    "start": 162,
                    "end": 163,
                    "text": "1",
                    "ref_id": null
                }
            ],
            "ref_spans": [
                {
                    "start": 150,
                    "end": 159,
                    "text": "Figure S1",
                    "ref_id": null
                },
                {
                    "start": 300,
                    "end": 309,
                    "text": "Figure S2",
                    "ref_id": "FIGREF9"
                },
                {
                    "start": 356,
                    "end": 365,
                    "text": "Figure S3",
                    "ref_id": "FIGREF5"
                }
            ],
            "section": "S3"
        },
        {
            "text": "NPs. S16 Figure S4 . The calibration curve was plotted using areas of integration from HPLC chromatograms over the amounts of OVAp. S17 Table S1 . The quantity of OVAp peptide or/and R837 in the NPs determined by HPLC. S17 Figure S5 . Detection of OVAp presented by MHC-I of bone marrow dendritic cells (BMDCs). S18 Figure S6 . Calibration curves were plotted using areas of integration from HPLC chromatograms over the amounts of MUC1 peptides (a) Mp1 and (b) Mp2. S19 Figure S7 . The calibration curve was plotted using areas of integration from HPLC chromatograms over the amounts of R837. S19 Table S2 . The quantity of Mp peptide or/and R837 in the NPs determined by HPLC. S20 Table S3 . Design of CTL epitopes from SARS-CoV-2. S25 Figure S13 . Calibration curves were plotted using areas of integration from HPLC chromatograms over the amounts of SARS-CoV-2 peptides (a-k) Sp1-Sp11. S27 Table S4 . The quantity of Sp and R837 in the NPs 14−24 determined by HPLC. Flow cytometry plots and (e) quantification of CD86 + cells in the spleen. S28 Figure S15 . Quantification of (a,b) CD8 + CD45RO + memory T cells, (c) CD8 + cells, (d,e)",
            "cite_spans": [],
            "ref_spans": [
                {
                    "start": 9,
                    "end": 18,
                    "text": "Figure S4",
                    "ref_id": null
                },
                {
                    "start": 136,
                    "end": 144,
                    "text": "Table S1",
                    "ref_id": "TABREF3"
                },
                {
                    "start": 223,
                    "end": 232,
                    "text": "Figure S5",
                    "ref_id": null
                },
                {
                    "start": 316,
                    "end": 325,
                    "text": "Figure S6",
                    "ref_id": "FIGREF6"
                },
                {
                    "start": 470,
                    "end": 479,
                    "text": "Figure S7",
                    "ref_id": null
                },
                {
                    "start": 597,
                    "end": 605,
                    "text": "Table S2",
                    "ref_id": null
                },
                {
                    "start": 682,
                    "end": 690,
                    "text": "Table S3",
                    "ref_id": "TABREF4"
                },
                {
                    "start": 737,
                    "end": 747,
                    "text": "Figure S13",
                    "ref_id": "FIGREF5"
                },
                {
                    "start": 893,
                    "end": 901,
                    "text": "Table S4",
                    "ref_id": "TABREF5"
                },
                {
                    "start": 1048,
                    "end": 1058,
                    "text": "Figure S15",
                    "ref_id": "FIGREF16"
                }
            ],
            "section": "S3"
        },
        {
            "text": "CD4 + CD45RO + memory T cells, and (f) CD4 + cells in the spleen. S30 Figure S16 . Detection of sera TNF-α and IFN-. S31",
            "cite_spans": [],
            "ref_spans": [
                {
                    "start": 70,
                    "end": 80,
                    "text": "Figure S16",
                    "ref_id": "FIGREF6"
                }
            ],
            "section": "S3"
        },
        {
            "text": "References S45",
            "cite_spans": [],
            "ref_spans": [],
            "section": "Characterization of peptides S32"
        },
        {
            "text": "S7 1 g of Ox-DEX polymer was added to a fried flask with 10 mL of DMSO. Pyridinium ptoluenesulfonate (15.6 mg, 0.062 mmol) and 2-methoxypropene (3.4 mL, 37 mmol) were then added to the flask under nitrogen protection. After 3 h, triethylamine (1 mL, 7 mmol) was added to stop the reaction. After precipitating in 100 mL of MilliQ-water, the precipitate was centrifuged at 12000 rpm for 20 min, washed with MilliQ-water (50 mL, × 2), and dried by lyophilization to obtain Ox-AcDEX polymer, which was characterized by 1 H-NMR (see Figure S1 ). 1 ",
            "cite_spans": [
                {
                    "start": 542,
                    "end": 543,
                    "text": "1",
                    "ref_id": null
                }
            ],
            "ref_spans": [
                {
                    "start": 529,
                    "end": 538,
                    "text": "Figure S1",
                    "ref_id": null
                }
            ],
            "section": "Characterization of peptides S32"
        },
        {
            "text": "Ox-AcDEX NPs 1 were synthesized by a double emulsion-evaporation technology. [4] In brief, the Ox-AcDEX polymer (20 mg) was dissolved in 1 mL of dichloromethane (DCM).",
            "cite_spans": [
                {
                    "start": 77,
                    "end": 80,
                    "text": "[4]",
                    "ref_id": null
                }
            ],
            "ref_spans": [],
            "section": "Synthesis of Ox-AcDEX NPs 1"
        },
        {
            "text": "The solution was emulsified by sonicating for 1 min (4 s on, 2 s off) on ice with an ultrasonicator (Xinzhi JY96-IIN, with a duty cycle of 50%), affording the primary emulsion, which was then added to poly(vinyl alcohol) (PVA, Mw: 13−23 kg mol −1 , 2 mL) aqueous solution (3% w/w in MilliQ-water). By sonicating on ice for 1 min, the resulting emulsion was poured to 0.3% (w/w) PVA aqueous solution in MilliQ-water (10 mL) and stirred for 3 h.",
            "cite_spans": [],
            "ref_spans": [],
            "section": "Synthesis of Ox-AcDEX NPs 1"
        },
        {
            "text": "Then, the NPs were isolated by centrifugation (12000 rpm, 20 min), washed with MilliQwater (3 × 20 mL), and lyophilized to produce Ox-AcDEX NPs 1, which were characterized by TEM and FTIR spectroscopy.",
            "cite_spans": [],
            "ref_spans": [],
            "section": "Synthesis of Ox-AcDEX NPs 1"
        },
        {
            "text": "2 mg of OVAp with the sequence of SIINFEKL or 2 mg of OVAp FITC with the sequence of FITC-SIINFEKL (Scheme S1) in 20 l of DMSO was added to 10 mg of Ox-AcDEX NPs S8 the mixture was purified by centrifugal filtration (MWCO 30 kDa) against MilliQ-water. The product was lyophilized to afford AcDEX-(imine)-OVAp NPs 2 and AcDEX-(imine)-OVAp FITC NPs 4. In parallel, OVAp-AcDEX NPs 3 and OVAp FITC -AcDEX NPs 5 were prepared by the double emulsion-evaporation technology, as described elsewhere. [5] Determination of OVAp presentation on MHC-I by BMDCs",
            "cite_spans": [
                {
                    "start": 493,
                    "end": 496,
                    "text": "[5]",
                    "ref_id": null
                }
            ],
            "ref_spans": [],
            "section": "OVAp FITC NPs 4, and OVAp FITC -AcDEX NPs 5"
        },
        {
            "text": "BMDCs (5 × 10 5 ) were cultured overnight and incubated with free OVAp, AcDEX-(imine)-OVAp NPs 2 or OVAp-AcDEX NPs 3 containing 100 ng of OVAp. After washing with phosphate-buffered saline (PBS) containing1% fetal bovine serum (FBS) and 0.1% NaN 3 (referred to as the buffer), the cells were stained with PE-labeled anti-mouse H-2K b /SIINFEKL antibody for 30 min in the buffer on ice, washed with the buffer, and then analyzed by flow cytometry (see Figure S5a ). ",
            "cite_spans": [],
            "ref_spans": [
                {
                    "start": 451,
                    "end": 461,
                    "text": "Figure S5a",
                    "ref_id": null
                }
            ],
            "section": "OVAp FITC NPs 4, and OVAp FITC -AcDEX NPs 5"
        },
        {
            "text": "The MUC1 peptides Mp1 (TSAPDTRPAP) and Mp2 (SAPDNRPAL) were synthesized from the Wang resin using Fmoc chemistry. The N-terminal protecting group Fmoc was deprotected by 20% piperidine in DMF. The amino acid coupling was conducted with Fmoc S9 amino acids (5 eq.) using 2-(1H-benzotriazole-1-yl)-1,1,3,3-tetramethylaminium tetrafluoroborate (TBTU)/hydroxybenzotriazole (HOBt) (4.9 eq.) and DIPEA (10 eq). After the peptide was assembled, the N-terminal Fmoc group was removed. Afterward, the peptides were cleaved from resins by TFA/TIPS/H 2 O = 95/2.5/2.5 for 2 h. The excess TFA was evaporated. The peptides were precipitated by diethyl ether and centrifuged to pellet the solid.",
            "cite_spans": [],
            "ref_spans": [],
            "section": "Synthesis of MUC1 peptides Mp1 and Mp2"
        },
        {
            "text": "The crude peptides were purified on a Shimadzu HPLC. The purified peptides Mp1 and Mp2",
            "cite_spans": [],
            "ref_spans": [],
            "section": "Synthesis of MUC1 peptides Mp1 and Mp2"
        },
        {
            "text": "were characterized by HPLC and ESI HRMS (see pages S33 and S34). NPs 13 did not contain R837 were made in the same manner as above omitting R837.",
            "cite_spans": [],
            "ref_spans": [],
            "section": "Synthesis of MUC1 peptides Mp1 and Mp2"
        },
        {
            "text": "The amounts of conjugated CTLp (OVAp, Mp1, Mp2) or/and R837 in the AcDEX NPs was quantified by HPLC analysis after hydrolyzing various NPs (2 mg) in 1 mL of 0.5% trifluoroacetic acid (TFA) aqueous solution for 8 h with the standard curves of CTLp (see Figures S4, S6 ) and R837 (see Figure S7 ) for calculation.",
            "cite_spans": [],
            "ref_spans": [
                {
                    "start": 252,
                    "end": 266,
                    "text": "Figures S4, S6",
                    "ref_id": "FIGREF6"
                },
                {
                    "start": 283,
                    "end": 292,
                    "text": "Figure S7",
                    "ref_id": null
                }
            ],
            "section": "S10"
        },
        {
            "text": "To test the release profiles of Mp and R837, AcDEX-(imine)-Mp1-R NPs 6 or AcDEX- Then the pellets were hydrolyzed in 1 mL of 0.5% TFA aqueous solution for 8 h, followed by HPLC determination.",
            "cite_spans": [],
            "ref_spans": [],
            "section": "The release profiles of Mp and R837 from AcDEX-(imine)-Mp-R NPs 6 and 12"
        },
        {
            "text": "For the study of the NPs bearing Mp1, C57BL/6 mice were administrated under the scruff by weekly injections with free Mp1, AcDEX-(imine)-Mp1-R NPs 6, AcDEX-(imine)-Mp1 NPs 7, or AcDEX-(imine)-Mp1 NPs 7 + AcDEX-(imine)-R NPs 8. For the study of the NPs bearing Mp2, C57BL/6 mice were administrated under the scruff by weekly injections with free Mp2, AcDEX-(imine)-Mp2-R NPs 12, AcDEX-(imine)-Mp2 NPs 13, or AcDEX-(imine)-Mp2 NPs 13 + AcDEX-(imine)-R NPs 8. 14-day (two injections of days 0 and 7) or 21-day later (three injections of days 0, 7, and 14), splenocytes from untreated mice were harvested. Half of splenocytes (2 × 10 7 , 2 mL) were incubated with 1 M of CFSE (referred to as CFSE low ). Half of splenocytes (2 × 10 7 , 2 mL) were incubated with 10 M of carboxyfluorescein succinimidyl ester (referred to as CFSE high ) and then pulsed with 1 g mL −1 of Mp for 1 h. Afterward, a mixture of peptide-free CFSE low and Mp-pulsed CFSE high splenocytes (1:1, 0.1 mL, 2 × 10 6 cells) was injected intravenously to non-treated, Mp, or the NPs immunized mice. 24 h later, their splenocytes were prepared for FACS analysis. The S11 changes in the ratio of CFSE high to CFSE low were analyzed from the FITC-SSC plot to evaluate target cell viability.",
            "cite_spans": [],
            "ref_spans": [],
            "section": "In vivo CTL activity studies of AcDEX-(imine)-Mp-R NPs"
        },
        {
            "text": "To test the ELISA for antibody responses against MUC1 peptide Mp1, the 96-well microtiter plates (Nunc MaxiSorp) were coated with BSA-Mp1 conjugate (1 μg per well) in ",
            "cite_spans": [],
            "ref_spans": [],
            "section": "Evaluation of antibody responses elicited by AcDEX-(imine)-Mp1-R NPs 6"
        },
        {
            "text": "Tumor volume was calculated with the formula: Volume (mm 3 ) = 1/2 (length × width × height). [6] Synthesis of SARS-CoV-2 peptides Sp1-Sp11",
            "cite_spans": [
                {
                    "start": 94,
                    "end": 97,
                    "text": "[6]",
                    "ref_id": null
                }
            ],
            "ref_spans": [],
            "section": "S12"
        },
        {
            "text": "The SARS-CoV-2 peptides Sp1 (SYGFQPTNGVGYQPY), Sp2 (SIIAYTMSL), Sp3",
            "cite_spans": [],
            "ref_spans": [],
            "section": "S12"
        },
        {
            "text": "(SALWEIQQV), Sp8 (YYHTTDPSF), Sp9 (NALAYYNTT), Sp10 (DAYKTFPPT) and Sp11",
            "cite_spans": [],
            "ref_spans": [],
            "section": "S12"
        },
        {
            "text": "(LALLLLDRL) designed in Table S2 were synthesized from the Wang-resins using the same SPPS method as MUC1 peptide. The resulting peptides Sp1-Sp11 were characterized by HPLC and ESI HRMS (see pages S35-S44). Figure S13 ) and R837 (see Figure S7 ) for calculation.",
            "cite_spans": [],
            "ref_spans": [
                {
                    "start": 24,
                    "end": 32,
                    "text": "Table S2",
                    "ref_id": null
                },
                {
                    "start": 208,
                    "end": 218,
                    "text": "Figure S13",
                    "ref_id": "FIGREF5"
                },
                {
                    "start": 235,
                    "end": 244,
                    "text": "Figure S7",
                    "ref_id": null
                }
            ],
            "section": "S12"
        },
        {
            "text": "C57BL/6 mice were immunized with free Sp (Sp1-Sp11) or AcDEX-(imine)-Sp-R NPs ",
            "cite_spans": [],
            "ref_spans": [],
            "section": "In vivo CTL activity studies of AcDEX-(imine)-Sp-R NPs 14−24"
        }
    ],
    "bib_entries": {
        "BIBREF0": {
            "ref_id": "b0",
            "title": "On day 10, the spleen was collected. (a,b) The percentages of MHC-I + cells present in the spleen were determined by FITC-labeled anti-mouse H-2K b antibody staining. (c) FITC-labeled anti-mouse IgG2a (κ isotype control) was used for negative staining. (d,e) The percentages of CD86 + cells present in the spleen were respectively determined by FITC-labeled anti-mouse CD86 + antibody staining",
            "authors": [],
            "year": null,
            "venue": "Flow cytometry plots and (e) quantification of CD86 + cells in the spleen. C57BL/6 female mice were subcutaneously immunized on days 0, 7 under the scruff with Sp1",
            "volume": "2",
            "issn": "",
            "pages": "",
            "other_ids": {}
        },
        "BIBREF1": {
            "ref_id": "b1",
            "title": "01, *** p < 0.001. ns = no significant difference. The results showed that vaccination of AcDEX-(imine)-Sp-R NPs 14 and 15 significantly upregulated MHC-I and CD86 levels on splenic immune cells",
            "authors": [],
            "year": null,
            "venue": "GraphPad Prism. * p < 0.05, ** p < 0",
            "volume": "",
            "issn": "",
            "pages": "",
            "other_ids": {}
        }
    },
    "ref_entries": {
        "FIGREF0": {
            "text": "AcDEX-(imine)-Mp1-R NPs 6 vaccination induced Mp1-specific CTLs (TSAPDTRPAP-MHC-I + CD8 + cells) in splenocytes. AcDEX-(imine)-Mp1-R NPs 6 vaccination activates lymph nodes. ELISA curves of sera from mice immunized with free Mp1, AcDEX-(imine)-Mp1-R NPs 6 or AcDEX-(imine)-Mp1 NPs 7. S22 The effect of the ratio between Mp1/R837 of AcDEX NPs on CTL activation in vivo. B16-MUC1 tumor growth. S24",
            "latex": null,
            "type": "figure"
        },
        "FIGREF1": {
            "text": "(a) Flow cytometry plots and (b) quantification of MHC-I + cells in the spleen. (d)",
            "latex": null,
            "type": "figure"
        },
        "FIGREF2": {
            "text": "EL4 cells or BMDCs (5 × 10 4 ) were respectively pulsed with free OVAp, AcDEX-(imine)-OVAp NPs 2 or OVAp-AcDEX NPs 3 containing 0−1 g of OVAp. After 18 h, B3Z T cells (3 × 10 5 ) were added and then cultured for 16 h. Afterward, the medium was gently removed by centrifugation at 2500 rpm for 5 min. Then, 100 μL of CPRG solution (90 mg of MgCl 2 , 9.1 mg of CPRG, and 0.125 mg of NP40 in 100 mL PBS) was added. 6 h later, UVvisible absorbance at 595 nm was recorded (see Figures2b, S5b). The assay was performed in three replicates.",
            "latex": null,
            "type": "figure"
        },
        "FIGREF3": {
            "text": "Synthesis of AcDEX-(imine)-Mp-R NPs, AcDEX-(imine)-Mp NPs, and AcDEX-(imine)-R NPs 2 mg of MUC1 peptide Mp1 and 2 mg of R837 in 20 l of DMSO were added to 10 mg of Ox-AcDEX NPs 1 in 200 l of DMSO. The reaction was kept in an Eppendorf tube at rt overnight. Afterward, the mixture was purified by centrifugal filtration (MWCO 30 kDa) against MilliQ-water. The product was lyophilized to afford AcDEX-(imine)-Mp1-R NPs 6. For comparison, AcDEX-(imine)-Mp1 NPs 7 did not contain R837 were made in the same manner as above omitting R837. Furthermore, AcDEX-(imine)-R NPs 8 did not have Mp1 were made in the same manner as above omitting Mp1. AcDEX-(imine)-Mp1-R NPs 9−11 were prepared in the same method as AcDEX-(imine)-Mp1-R NPs 6, by conjugating Ox-AcDEX NPs 1 with 2:1 of Mp1/R837 (for 9: 2 mg Mp1 and 1 mg R837), 4:1 of Mp1/R837 (for 10: 2 mg Mp1 and 0.5 mg R837), or 20:1 of Mp1/R837 (for 11: 2 mg Mp1 and 0.1 mg R837). Furthermore, AcDEX-(imine)-Mp2-R NPs 12 were prepared in the same way as AcDEX-(imine)-Mp1-R NPs 6 using Mp2 instead of Mp1. For comparison, AcDEX-(imine)-Mp2",
            "latex": null,
            "type": "figure"
        },
        "FIGREF4": {
            "text": "and kept at 37 ℃. The suspension was centrifuged at selected time intervals (6−48 h).",
            "latex": null,
            "type": "figure"
        },
        "FIGREF5": {
            "text": "Na 2 CO 3 buffer (0.05 M, pH 9.6) containing NaN 3 (0.02 %) by incubation at 4 ℃ overnight. After antigen coating, the plates were washed with PBS/0.5% Tween-20 (PBST) and blocked with 1 % BSA in PBS at rt for 1 h. The plates were washed with PBST and incubated with serial dilutions of sera from Mp1, AcDEX-(imine)-Mp1-R NPs 6 or AcDEX-(imine)-Mp1 NPs 7 immunized mice in 0.1 % BSA/PBS. The plates were incubated for 2 h at 37 °C and washed with PBST. Then, a 1:2000 dilution of HRP-conjugated goat anti-mouse IgG (Abcam) in 0.1% BSA/PBS was added. Next, the plates were incubated for 1 h at 37 °C and washed with PBST. A solution of the enzymatic substrate 3,3',5,5'-tetramethylbenzidine (TMB, 200 µL) was added to the plates (for one plate: 5 mg TMB, 2 mL DMSO, 18 mL citric acid buffer and 20 μL H 2 O 2 ). The color was developed for 15 min and quenched by the addition of 50 μL of 0.5 M H 2 SO 4 . The absorbance was measured at 450 nm using a microplate reader. All samples were performed in triplicate.",
            "latex": null,
            "type": "figure"
        },
        "FIGREF6": {
            "text": "AcDEX-(imine)-Mp2-R NPs 12 or a mixture of 6 and 12. All vaccines injected have the same dose of Mp (30 μg). Then, a total of 5 injections with 0.1 mL of PBS, Mp1, Mp2, 6,",
            "latex": null,
            "type": "figure"
        },
        "FIGREF7": {
            "text": "of SARS-CoV-2 peptide Sp (Sp1-Sp11, respectively) and 2 mg of R837 in 20 l of DMSO were added to 10 mg of Ox-AcDEX NPs 1 in 200 l of DMSO. The reaction was kept in an Eppendorf tube at rt overnight. Afterward, the mixture was purified by centrifugal filtration (MWCO 30 kDa) against MilliQ-water. The product was lyophilized to afford AcDEX-(imine)-Sp-R NPs 14−24. The amounts of conjugated Sp (Sp1-Sp11) and R837 in the NPs were quantified by HPLC analysis after hydrolyzing various NPs (2 mg) in 1 mL of 0.5% trifluoroacetic acid (TFA) aqueous solution for 8 h with the standard curves of Sp (see",
            "latex": null,
            "type": "figure"
        },
        "FIGREF8": {
            "text": "In vivo CTL activity studies of AcDEX-(imine)-Sp-R NPs 14, 15 or 24 against SARS-CoV-2 proteinC57BL/6 mice were subcutaneously immunized with AcDEX-(imine)-Sp1-R NPs 14, AcDEX-(imine)-Sp2-R NPs 15, or AcDEX-(imine)-Sp11-R NPs 24 under the scruff by two injections (days 0 and 7). On day 14, splenocytes from untreated mice were harvested, and half of splenocytes (2 × 10 7 , 2 mL) were incubated with 1 M of CFSE low . Half of splenocytes (2 × 10 7 , 2 mL) were incubated with 10 M of CFSE high and pulsed with 2 g mL −1 of the S protein (SARS-CoV-2 spike (S1+S2) recombinant protein) for 1 h. Then, a mixture of S protein-free CFSE low and S protein-pulsed CFSE high splenocytes (1:1, 0.1 mL, 2 × 10 6 cells) was injected intravenously to untreated or immunized mice. 24 h later, their splenocytes were prepared for FACS analysis. For evaluating CTL activities of AcDEX-(imine)-Sp11-R NPs 24 towards SARS-CoV-2 N protein, the SARS-CoV-2 nucleocapsid recombinant protein from Sino Biological (Cat: 40588-V08B) were used for in vivo CTL assay.In vivo CTL activity studies of AcDEX-(imine)-Sp-R NPs 14 and 15 against SARS-CoV-S14C57BL/6 mice were subcutaneously immunized with AcDEX-(imine)-Sp1-R NPs 14 or AcDEX-(imine)-Sp2-R NPs 15 under the scruff by three injections (days 0, 7 and 14). On day 21, splenocytes from untreated mice were harvested, and half of the cells (2 × 10 7 , 2 mL) were incubated with 1 M of CFSE low as pseudovirus-free splenocytes. Half of the cells (2 × 10 7 , 2 mL) were incubated with 10 M of CFSE high and then incubated with 100 l of the SARS-CoV-2 (2019-nCoV) spike pseudovirus (Cat: PSV001, 10 10 virus copies mL −1 ) for 4 h.Afterward, a mixture of pseudovirus-free CFSE low and pseudovirus-pulsed CFSE high splenocytes (1:1, 0.1 mL, 2 × 10 6 cells) was injected intravenously to untreated or immunized mice. 24 h later, their splenocytes were prepared for FACS analysis.Scheme S1. The structure of OVAp FITC . S15 1 H-NMR spectrum of partially oxidized dextran (Ox-DEX) polymer 1 H-NMR spectrum of partially oxidized acetalated dextran (Ox-AcDEX) polymer S16Figure S1.1 H-NMR spectra of partially oxidized dextran (Ox-DEX) and partially oxidized acetalated dextran (Ox-AcDEX) polymers.",
            "latex": null,
            "type": "figure"
        },
        "FIGREF9": {
            "text": "Standard curve of glucose by BCA Assay. The degree of oxidation was determined colorimetrically (UV absorption at 562 nm) using a microplate reductometric bicinchoninic acid assay (Micro BCA Protein Assay Kit, Pierce, USA) according to the manufacturer's protocol and glucose monohydrate for calibration. The standard curve was used to quantify the aldehyde content on Ox-DEX polymer. The result showed that it contained 8 mol of aldehyde functions per 100 mol of anhydroglucose units.",
            "latex": null,
            "type": "figure"
        },
        "FIGREF10": {
            "text": "FTIR spectrum of Ox-AcDEX NPs 1 as compared to acetalated dextran (AcDEX) NPs. FTIR spectroscopy analysis revealed the occurrence of a signal at 1737 cm −1 in Ox-The calibration curve was plotted using areas of integration from HPLC chromatograms over the amounts of OVAp. Known quantities of OVAp were injected into the HPLC column (XAqua C18 column, 100Å, 5 μm, 4.6 mm × 250 mm) and the areas corresponding to the desired peaks were determined through integration. This calibration curve was used to quantify the amounts of OVAp released from AcDEX-(imine)-OVAp NPs 2 and OVAp-AcDEX NPs 3.",
            "latex": null,
            "type": "figure"
        },
        "FIGREF11": {
            "text": "NPs g peptide/per mg NP g R837/per mg NP AcDEX-(imine)Detection of OVAp presented by MHC-I of bone marrow dendritic cells (BMDCs). (a) BMDCs (5 × 10 5 ) were incubated with either free OVAp, AcDEX-(imine)-OVAp NPs 2 or OVAp-AcDEX NPs 3 for 6 h. The cells were spiked with PE-labeled antimouse H-2K b /SIINFEKL antibody for 0.5 h and analyzed by flow cytometry. (b) MHC-I antigen presentation (B3Z assay) by BMDCs. In vitro CTL activation study of B3Z T cells co-cultured with BMDCs following incubation with free OVAp, AcDEX-(imine)-OVAp NPs 2 or OVAp-AcDEX NPs 3. The error bars show s.e.m. of three replicates. The p values are analyzed by (a) a two-tailed unpaired Student's t-test or (b) two-way ANOVA with GraphPad Prism. * p < 0.05, ** p < 0.01, **** p < 0.0001. The result showed that incubation of AcDEX-(imine)-OVAp NPs 2 with BMDCs led to enhanced OVAp presentation Calibration curves were plotted using areas of integration from HPLC chromatograms over the amounts of MUC1 peptides (a) Mp1 and (b) Mp2. Known amounts of Mp1 or Mp2 were injected into the HPLC column (XAqua C18 column, 100Å, 5 μm, 4.6 mm × 250 mm) and the areas corresponding to the desired peaks were determined through integration. This calibration curve was used to quantify the amounts of Mp1 or Mp2 released from AcDEX-(imine)-Mp1-R NPs 6, 9−11, AcDEX-(imine)-Mp1 NPs 7, AcDEX-(imine)-Mp2-R NPs 12, and AcDEX-(imine)-Mp2 NPs 13.",
            "latex": null,
            "type": "figure"
        },
        "FIGREF12": {
            "text": "The calibration curve was plotted using areas of integration from HPLC chromatograms over the amounts of R837. Known amounts of R837 were injected into the HPLC column (XAqua C18 column, 100Å, 5 μm, 4.6 mm × 250 mm) and the areas corresponding to the desired peaks were determined through integration. This calibration curve was used to quantify the amounts of R837 released from the NPs conjugating R837. The quantity of Mp peptide or/and R837 in the NPs determined by HPLC.NPsg peptide/per mg NP g R837/per mg NP AcDEX-(imine)-Mp1-R NPs 6 vaccination induced Mp1-specific CTLs(TSAPDTRPAP-MHC-I + CD8 + cells) in splenocytes. (a) Flow cytometry plots and (b) quantification of TSAPDTRPAP-MHC-I + CD8 + cells in splenocytes. C57BL/6 female mice were subcutaneously immunized on days 0, 3 under the scruff with Mp1, AcDEX-(imine)-Mp1 NPs 7 or AcDEX-(imine)-Mp1-R NPs 6. On day 6, lymph nodes were collected. The percentage of Mp1-MHC-I + CD8 + cells present in splenocytes was determined by staining splenocytes with PE-labeled TSAPDTRPAP-MHC-I tetramer prepared by QuickSwitch TM Tetramer Kit and FITC-labeled anti-mouse CD8 antibody. (n = 3 mice for each group). A two-tailed unpaired Student's t-test analyzes the p values with GraphPad Prism. ** p < 0.01. ns = no significant difference. The results showed that AcDEX-(imine)-Mp1-R NPs 6 vaccination effectively induced Mp1-specific CTLs.",
            "latex": null,
            "type": "figure"
        },
        "FIGREF13": {
            "text": "AcDEX-(imine)-Mp1-R NPs 6 vaccination activates lymph nodes. (a) Flow cytometry plots and (b) quantification of CD8 + cells in lymph nodes. (c) Flow cytometry On day 6, lymph nodes were collected. (a,b) The percentage of CD8 + cells present in lymph nodes was determined by FITC-labeled anti-mouse CD8 + antibody staining. (c,d) The percentage of MHC-I + cells present in lymph nodes was determined by FITC-labeled anti-mouse H-2K b antibody staining. (n = 3 mice for each group). A two-tailed unpaired Student's t-test analyzes the p values with GraphPad Prism. * p < 0.05. ns = no significant difference. The results showed that AcDEX-(imine)-Mp1-R NPs 6 vaccination upregulated CD8 and MHC-I levels on lymph node immune cells, indicating that AcDEX-(imine)-Mp1-R NPs 6 vaccination activated lymph nodes.",
            "latex": null,
            "type": "figure"
        },
        "FIGREF14": {
            "text": "ELISA curves of pre-immune mouse sera (negative sera), sera from mice immunized with free Mp1, AcDEX-(imine)-Mp1-R NPs 6, or AcDEX-(imine)-Mp1 NPs 7.The error bars represent the standard deviation (SD) of three replicates. The effect of the ratio between Mp1/R837 of AcDEX NPs on CTL activation in vivo. On days 0 and 7, mice were immunized subcutaneously by injections of AcDEX-(imine)-Mp1-R NPs 6, 9−11, respectively. On day 10, a mixture of CFSE high labeled Mp1 pulsed splenocytes and CFSE low labeled control cells with a ratio of 1:1 was injected into the immunized and non-treated mice, respectively. One day after injection, their splenocytes wereanalyzed by FACS. (n = 3 for non-treated and n = 2 for other groups). A two-tailed unpaired Student's t-test analyzes the p values with GraphPad Prism. * p < 0.05, ** p < 0.01. The results showed that the higher R837 level in a particle contributes to enhanced CTL activation. B16-MUC1 tumor growth. C57BL/6 female mice were injected with 3 × 10 4 B16-MUC1 tumor cells on day 0. Starting from day 1, a total of three subcutaneous injections with PBS, Mp1, Mp2, AcDEX-(imine)-Mp1-R NPs 6, AcDEX-(imine)-Mp2-R NPs 12 or a mixture of 6 and 12, were given three injections on days 1, 7 and 14 with a dose of 30 μg of MUC1. (a) Growth curves of tumors in mice. (b) Photographs of the dissected tumors after 19-day immunotherapy in each treated group. (c) Weight of the tumors collected after killing the mice on day 19. (d) Average body weight of tumor-bearing mice. The p value was obtained by two-way ANOVA Bonferroni post-test by GraphPad Prism. *** p < 0.001, **** p < 0.0001. ns: no significant difference. The error bars represent the SEM of n = 6 mice for each group.",
            "latex": null,
            "type": "figure"
        },
        "FIGREF15": {
            "text": "Calibration curves were plotted using areas of integration from HPLC chromatograms over the amounts of SARS-CoV-2 peptides (a-k) Sp1-Sp11. Known amounts mm) and the areas corresponding to the desired peaks were determined through integration. This calibration curve was used to quantify the amounts of Sp released from AcDEX-(imine)-Sp-R NPs 14−24.",
            "latex": null,
            "type": "figure"
        },
        "FIGREF16": {
            "text": "NPs g peptide/per mg NP g R837/per mg NP Figure S14. (a) Flow cytometry plots and (b) quantification of MHC-I + cells in the spleen. (d) FITC-labeled anti-mouse H--labeled anti-mouse IgG2a, κ isotype control FITC-labeled anti-mouse CD86 antibody Quantification of (a,b) CD8 + CD45RO + memory T cells, (c) CD8 + cells, (d,e) CD4 + CD45RO + memory T cells, and (f) CD4 + cells in the spleen. C57BL/6 female mice were subcutaneously immunized on days 0, 7 under the scruff with Sp1, Sp2, AcDEX-(imine)-Sp1-R NPs 14 or AcDEX-(imine)-Sp2-R NPs 15. On day 10, the spleen was collected. (a,b) The percentages of CD8 + CD45RO + memory T cells present in the spleen were determined by costaining of FITC-labeled anti-mouse CD8 + antibody and APC-labeled anti-CD45RO antibody. (d.e) The percentages of CD4 + CD45RO + memory T cells present in the spleen were determined by co-staining of FITC-labeled anti-mouse CD4 antibody and APC-labeled anti-for each group). A two-tailed unpaired Student's t-test analyzes the p values with GraphPad Prism. * p < 0.05. It was found that vaccination of AcDEX-(imine)-Sp-R NPs 14 and 15 increased CD8 and CD4 levels on splenic immune cells. Importantly, vaccination of AcDEX-(imine)-Sp-R NPs 14 and 15 significantly increased the percentages of CD8 + CD45RO + memory T cells in the spleen. Meanwhile, vaccination of AcDEX-(imine)-Sp-R NPs 14 also significantly increased the percentages of CD4 + CD45RO + memory T cells in the spleen. Collectively, AcDEX-(imine)-Sp-R NPs were demonstrated to induce effective immune memory.",
            "latex": null,
            "type": "figure"
        },
        "FIGREF17": {
            "text": "Detection of sera TNF-α and IFN-. Standard curves of (a) TNF- and (b) IFN-. C57BL/6 female mice were subcutaneously immunized on days 0, 7, 14 under the scruff with PBS, AcDEX-(imine)-Sp1-R NPs 14, or AcDEX-(imine)-Sp2-R NPs 15. On day 21, sera were collected and analyzed by TNF-α and IFN- ELISA kits. By incubating the undiluted sera from 14 or 15 immunized mice, a negative signal was detected. This indicated the levels of TNF-α and IFN- induced by 14 and 15 were lower than the detection limit of 15 pg mL −1 . Thus, AcDEX-(imine)-Sp-R NPs 14 and 15 can induce strong anti-SARS-CoV-2 CTL immune responses without generating a harmful cytokine storm.",
            "latex": null,
            "type": "figure"
        },
        "TABREF0": {
            "text": "",
            "latex": null,
            "type": "table"
        },
        "TABREF2": {
            "text": "14−24, respectively, under the scruff by two injections on days 0 and 7. On day 14, splenocytes from non-treated mice were harvested. Half of splenocytes (2 × 10 7 , 2 mL) were S13 incubated with 1 M of CFSE (referred to as CFSE low ). Half of splenocytes (2 × 10 7 , 2 mL) were incubated with 10 M of carboxyfluorescein succinimidyl ester (referred to as CFSE high ) and then pulsed with 1 g mL −1 of peptide Sp for 1 h. Afterward, a mixture of Sp-free CFSE low and Sp-pulsed CFSE high splenocytes (1:1, 0.1 mL, 2 × 10 6 cells) was injected intravenously to non-treated, Sp, or the NPs immunized mice. 24 h later, their splenocytes were prepared for FACS analysis. The changes in the ratio of CFSE high to CFSE low were analyzed from the FITC-SSC plot to evaluate target cell viability.",
            "latex": null,
            "type": "table"
        },
        "TABREF3": {
            "text": "The quantity of OVAp peptide or/and R837 in the NPs determined by HPLC.",
            "latex": null,
            "type": "table"
        },
        "TABREF4": {
            "text": "Design of CTL epitopes Sp1-Sp11 from SARS-CoV-2. To obtain better CTL activity in mice, we use IEDB analysis to appropriately adjust the sequence of predicted",
            "latex": null,
            "type": "table"
        },
        "TABREF5": {
            "text": "The quantity of Sp and R837 in the NPs 14−24 determined by HPLC.",
            "latex": null,
            "type": "table"
        }
    },
    "back_matter": []
}