{
    "paper_id": "0a2d826b09708aac6d86d5d01ea363737c8212e6",
    "metadata": {
        "title": "COVID-19 Vaccine-Associated Cerebral Venous Thrombosis in Germany",
        "authors": [
            {
                "first": "Jörg",
                "middle": [
                    "B"
                ],
                "last": "Schulz",
                "suffix": "",
                "affiliation": {
                    "laboratory": "Vaccination Study Group †",
                    "institution": "RWTH Aachen University",
                    "location": {
                        "addrLine": "Pauwelsstraße 30",
                        "postCode": "D-52074",
                        "settlement": "Aachen",
                        "country": "Germany"
                    }
                },
                "email": "jschulz@ukaachen.de†"
            },
            {
                "first": "Peter",
                "middle": [],
                "last": "Berlit",
                "suffix": "",
                "affiliation": {},
                "email": ""
            },
            {
                "first": "Hans-Christoph",
                "middle": [],
                "last": "Diener",
                "suffix": "",
                "affiliation": {
                    "laboratory": "",
                    "institution": "University of Duisburg-Essen",
                    "location": {
                        "settlement": "Essen",
                        "country": "Germany"
                    }
                },
                "email": ""
            },
            {
                "first": "Christian",
                "middle": [],
                "last": "Gerloff",
                "suffix": "",
                "affiliation": {},
                "email": ""
            },
            {
                "first": "Andreas",
                "middle": [],
                "last": "Greinacher",
                "suffix": "",
                "affiliation": {
                    "laboratory": "",
                    "institution": "University Medical Center Greifswald",
                    "location": {
                        "settlement": "Greifswald",
                        "country": "Germany"
                    }
                },
                "email": ""
            },
            {
                "first": "Christine",
                "middle": [],
                "last": "Klein",
                "suffix": "",
                "affiliation": {},
                "email": ""
            },
            {
                "first": "Gabor",
                "middle": [
                    "C"
                ],
                "last": "Petzold",
                "suffix": "",
                "affiliation": {
                    "laboratory": "",
                    "institution": "University Hospital Bonn",
                    "location": {
                        "settlement": "Bonn",
                        "country": "Germany"
                    }
                },
                "email": ""
            },
            {
                "first": "Marco",
                "middle": [],
                "last": "Piccininni",
                "suffix": "",
                "affiliation": {
                    "laboratory": "",
                    "institution": "Charité -Universitätsmedizin Berlin",
                    "location": {
                        "settlement": "Berlin",
                        "country": "Germany"
                    }
                },
                "email": ""
            },
            {
                "first": "Sven",
                "middle": [],
                "last": "Poli",
                "suffix": "",
                "affiliation": {
                    "laboratory": "",
                    "institution": "University of Tübingen",
                    "location": {
                        "settlement": "Tübingen",
                        "country": "Germany"
                    }
                },
                "email": ""
            },
            {
                "first": "Rainer",
                "middle": [],
                "last": "Röhrig",
                "suffix": "",
                "affiliation": {
                    "laboratory": "",
                    "institution": "RWTH Aachen University",
                    "location": {
                        "settlement": "Aachen",
                        "country": "Germany;"
                    }
                },
                "email": ""
            },
            {
                "first": "Helmuth",
                "middle": [],
                "last": "Steinmetz",
                "suffix": "",
                "affiliation": {
                    "laboratory": "",
                    "institution": "University Hospital Frankfurt",
                    "location": {
                        "settlement": "Frankfurt",
                        "country": "Germany"
                    }
                },
                "email": ""
            },
            {
                "first": "Thomas",
                "middle": [],
                "last": "Thiele",
                "suffix": "",
                "affiliation": {
                    "laboratory": "",
                    "institution": "University Medical Center Greifswald",
                    "location": {
                        "settlement": "Greifswald",
                        "country": "Germany"
                    }
                },
                "email": ""
            },
            {
                "first": "Tobias",
                "middle": [],
                "last": "Kurth",
                "suffix": "",
                "affiliation": {
                    "laboratory": "",
                    "institution": "Charité -Universitätsmedizin Berlin",
                    "location": {
                        "settlement": "Berlin",
                        "country": "Germany"
                    }
                },
                "email": ""
            }
        ]
    },
    "abstract": [
        {
            "text": "Objective: We aimed to estimate the incidence of cerebral sinus and venous thrombosis (CVT) within 1 month from first dose administration and the frequency of vaccine-induced immune thrombotic thrombocytopenia (VITT) as the underlying mechanism after vaccination with BNT162b2, ChAdOx1, and mRNA-1273, in Germany. Methods: A web-based questionnaire was e-mailed to all departments of neurology. We requested a report of cases of CVT occurring within 1 month of a COVID-19 vaccination. Other cerebral events could also be reported. Incidence rates of CVT were calculated by using official statistics of 9 German states. Results: A total of 45 CVT cases were reported. In addition, 9 primary ischemic strokes, 4 primary intracerebral hemorrhages, and 4 other neurological events were recorded. Of the CVT patients, 35 (77.8%) were female, and 36 (80.0%) were younger than 60 years. Fifty-three events were observed after vaccination with ChAdOx1 (85.5%), 9 after BNT162b2 (14.5%) vaccination, and none after mRNA-1273 vaccination. After 7,126,434 first vaccine doses, the incidence rate of CVT within 1 month from first dose administration was 0.55 (95% confidence interval [CI] = 0.38-0.78) per 100,000 personmonths (which corresponds to a risk of CVT within the first 31 days of 0.55 per 100,000 individuals) for all vaccines and 1.52 (95% CI = 1.00-2.21) for ChAdOx1 (after 2,320,535 ChAdOx1 first doses). The adjusted incidence rate ratio was 9.68 (95% CI = 3.46-34.98) for ChAdOx1 compared to mRNA-based vaccines and 3.14 (95% CI = 1.22-10.65) for females compared to non-females. In 26 of 45 patients with CVT (57.8%), VITT was graded highly probable. Interpretation: Given an incidence of 0.02 to 0.15 per 100,000 person-months for CVT in the general population, these findings point toward a higher risk for CVT after ChAdOx1 vaccination, especially for women. ANN NEUROL 2021;00:1-13 View this article online at wileyonlinelibrary.com.",
            "cite_spans": [],
            "ref_spans": [],
            "section": "Abstract"
        }
    ],
    "body_text": [
        {
            "text": "A major breakthrough in managing the COVID-19 pandemic was the development and administration of vaccines against SARS-CoV-2, namely BNT162b2 (BioNTech/Pfizer), mRNA-1273 (Moderna), Ad26.COV2.S (Johnson & Johnson), and ChadOx1 (AstraZeneca). Typical side effects of these vaccines were reported in clinical trials, with several thousand volunteers but without evidence of a vaccine-associated increase in thromboembolic events. [1] [2] [3] [4] [5] As of April 2021, several vaccines had been approved and administered to millions of people. In Germany, 16, 428, 425 persons received the first and 5,517,282 the second dose of a vaccine as of April 18, 2021 . 6 These included about 16.2 million BNT162b2 doses, 1.2 million mRNA-1273 doses, and 4.6 million ChAdOx1 doses.",
            "cite_spans": [
                {
                    "start": 428,
                    "end": 431,
                    "text": "[1]",
                    "ref_id": "BIBREF0"
                },
                {
                    "start": 432,
                    "end": 435,
                    "text": "[2]",
                    "ref_id": "BIBREF1"
                },
                {
                    "start": 436,
                    "end": 439,
                    "text": "[3]",
                    "ref_id": "BIBREF2"
                },
                {
                    "start": 440,
                    "end": 443,
                    "text": "[4]",
                    "ref_id": "BIBREF3"
                },
                {
                    "start": 444,
                    "end": 447,
                    "text": "[5]",
                    "ref_id": "BIBREF4"
                },
                {
                    "start": 553,
                    "end": 556,
                    "text": "16,",
                    "ref_id": "BIBREF15"
                },
                {
                    "start": 557,
                    "end": 561,
                    "text": "428,",
                    "ref_id": null
                },
                {
                    "start": 562,
                    "end": 565,
                    "text": "425",
                    "ref_id": null
                }
            ],
            "ref_spans": [],
            "section": ""
        },
        {
            "text": "Outside of the context of COVID-19 vaccination, cerebral venous thrombosis is a very rare disease with an incidence of about 0.22 to 1.75 per 100.00 person-years, based on data from several European countries, Australia, Iran, and Hong Kong. [7] [8] [9] Well-known risk factors are female sex, pregnancy, infections, and hypercoagulability. 10 Within hypercoagulability, hormone-related and genetic prothrombotic disorders are the most frequent causes. 11 Until the end of March 2021, the majority of persons vaccinated with ChAdOx1 in Germany were younger than 60 years. 6 ChAdOx1 was initially only recommended in Germany for persons younger than 65 years due to insufficient data on efficacy and safety among the elderly. In several European countries, cases of cerebral venous thrombosis were reported in temporal relationship with ChAdOx1 vaccine administration. An immune-mediated mechanism termed vaccineinduced thrombocytopenic thrombosis (VITT) has been suggested to underlie these serious adverse events. [12] [13] [14] At the beginning of March 2021, 30 venous thromboembolic events were reported to the European Medical Agency out of about 5 million persons who had received the ChAdOx1 vaccine. 15 At that time, the Danish National Patient Registry did not report a higher incidence of thromboembolic events in the Danish population but excluded cases of sinus-venous thrombosis from their analysis because of low incidence. 16 The aim of this report is to describe reported cases of cerebrovascular events in temporal relation to COVID-19 vaccination in Germany until April 14, 2021, based on a retrospective survey. We further aim at providing an incidence estimate of cerebral venous thrombosis within 31 days from first vaccine dose administration by vaccine type, age, and sex for 9 German states.",
            "cite_spans": [
                {
                    "start": 242,
                    "end": 245,
                    "text": "[7]",
                    "ref_id": "BIBREF6"
                },
                {
                    "start": 246,
                    "end": 249,
                    "text": "[8]",
                    "ref_id": "BIBREF7"
                },
                {
                    "start": 250,
                    "end": 253,
                    "text": "[9]",
                    "ref_id": "BIBREF8"
                },
                {
                    "start": 1015,
                    "end": 1019,
                    "text": "[12]",
                    "ref_id": "BIBREF11"
                },
                {
                    "start": 1020,
                    "end": 1024,
                    "text": "[13]",
                    "ref_id": "BIBREF12"
                },
                {
                    "start": 1025,
                    "end": 1029,
                    "text": "[14]",
                    "ref_id": "BIBREF13"
                }
            ],
            "ref_spans": [],
            "section": ""
        },
        {
            "text": "We designed a web-based questionnaire which was e-mailed to all departments of neurology of university (n = 40) and nonuniversity (n = 251) hospitals in Germany on April 6, 2021. Data collection was closed on April 14, 2021 (24:00). The survey focused on the report of cerebral sinus-venous thrombosis and cerebral venous thrombosis events that had occurred within 31 days after COVID-19 vaccination in 2021. However, the questionnaire also allowed the reporting of other cerebrovascular events in possible temporal relationship with a COVID-19 vaccination. We combined cerebral sinus-venous thrombosis and cerebral venous thrombosis without the involvement of the vena cerebri magnahereafter referred to as cerebral sinus and/or venous thrombosis (CVT). Thirty-seven (93%) neurology departments at university hospitals (tertiary centers) and 75 (30%) neurology departments of nonuniversity hospitals responded (Fig 1) . We recorded information about the type of vaccination, symptoms, coagulation parameters, clinical course, and clinical outcomes. We developed a written protocol for data collection (see Table S2 ). The protocol was approved by the ethics committee (Vote-No. 142/21, Ethics Committee of the Medical Faculty at RWTH Aachen University). Data protection and privacy compliance have been confirmed by the Data Protection Officer and the Information Security Officer of RWTH Aachen University Hospital. Coagulation parameters were also collected from the respective local laboratories. For a subgroup of patients, anti-heparin/platelet factor 4 (PF4) antibody/ polyanion-immunoglobulin G enzyme immunoassay and a platelet activation assay were performed in the laboratory of the Institute for Immunology and Transfusion Medicine at the University of Greifswald as described. 13 For the PF4 antibody results, we used information from the central laboratory in Greifswald, and only if it was missing, we considered test results if positive from the respective local hospitals.",
            "cite_spans": [],
            "ref_spans": [
                {
                    "start": 911,
                    "end": 918,
                    "text": "(Fig 1)",
                    "ref_id": "FIGREF0"
                },
                {
                    "start": 1107,
                    "end": 1115,
                    "text": "Table S2",
                    "ref_id": "TABREF2"
                }
            ],
            "section": "Data Collection"
        },
        {
            "text": "Based on the first reported cases, 12, 13 we devised a grading system using the following criteria to classify each event according to its likelihood of being associated with COVID-19 vaccination: (1) time from last vaccine shot administration between 1 and 16 days, (2) thrombocytopenia (<150/nl) or relative thrombocytopenia (drop of thrombocytes of at least 50%), (3) positive enzyme-linked immunosorbent assay to detect PF4-polyanion antibodies, and (4) positive modified (PF4-enhanced) platelet-activation assay (VITT function test). 13 Each criterion loaded the score with 1 point. All cases were evaluated in depth by 4 members of the Task Force. Cases that fulfilled criteria 1 and 2, but with no test results available for criteria 3 and 4, were rated with a score of 2+ to contrast them with those cases with negative results for criteria 3 and 4. A score of 2+ and higher was considered a high grade (highly probable VITT).",
            "cite_spans": [
                {
                    "start": 35,
                    "end": 38,
                    "text": "12,",
                    "ref_id": "BIBREF11"
                }
            ],
            "ref_spans": [],
            "section": "Data Collection"
        },
        {
            "text": "We formulated the following a priori research hypotheses: 4. VITT-mediated neurological events are not restricted to vaccine-induced CVTs but may also result in cerebrovascular arterial thrombotic events.",
            "cite_spans": [],
            "ref_spans": [],
            "section": "Research Hypotheses"
        },
        {
            "text": "Characteristics of the reported cerebrovascular cases were summarized as frequency and percentage or mean, standard deviation, median, and range for qualitative and quantitative variables, respectively. Descriptive statistics were reported for the overall cases and by subgroups.",
            "cite_spans": [],
            "ref_spans": [],
            "section": "Statistical Analysis"
        },
        {
            "text": "To compute the incidence rate of CVT within 1 month from first vaccine shot administration, we divided the number of cases that occurred within 31 days from first vaccine shot administration by the overall amount of person-time spent at risk during the time window of interest.",
            "cite_spans": [],
            "ref_spans": [],
            "section": "Statistical Analysis"
        },
        {
            "text": "We obtained CC-BY licensed data from the Robert Koch Institute (the German National Institute of Public Health) about the number of vaccine shots administered by calendar week, age group, vaccine type, and state separately for only females and for everyone (numbers for non-females were obtained by the difference). The number of vaccine shots administered within these subgroups was only available for 9 German states, and no distinction was possible between first and second doses.",
            "cite_spans": [],
            "ref_spans": [],
            "section": "Statistical Analysis"
        },
        {
            "text": "Therefore, we restricted our estimation of the incidence to the area of the 9 German states (Baden-Wuerttemberg, Bremen, Hamburg, Mecklenburg-Western Pomerania, Lower Saxony, North Rhine-Westphalia, Rhineland-Palatinate, Saarland, and Schleswig-Holstein). We assumed that a case originated in this area if the hospital recording it was located in one of the 9 states. We only considered cases occurring within 31 days from the first vaccine dose administration. For cases occurring after the second shot, we computed the time from first dose assuming that the second dose was administered 10 weeks, 21 days, and 14 days after the first dose for ChAdOx1, BNT162b2, and mRNA-1273, respectively.",
            "cite_spans": [],
            "ref_spans": [],
            "section": "Statistical Analysis"
        },
        {
            "text": "Within every stratum of state, age group (<60, 60+ years), sex (female, non-female), and vaccine type (ChAdOx1, BNT162b2, and mRNA-1273), we approximated the number of first and second doses administered every calendar week. We assumed individuals receiving their second dose in a given week were the same who had received their first dose a fixed number of weeks before (10 for ChAdOx1, 3 for BNT162b2, and 2 for mRNA-1273). If the number of attributed second doses in a week was higher than the total registered number of administered doses, the remaining doses were attributed to the following week (and so on, iteratively). The number of first doses was obtained by the difference between the total number of doses and the estimated number of second doses administered in the week.",
            "cite_spans": [],
            "ref_spans": [],
            "section": "Statistical Analysis"
        },
        {
            "text": "The number of person-months each vaccinated individual spent at risk during the time window of interest (1 month from first vaccine shot administration) was computed as the number of days between the day of the first dose administration (assumed to be in the middle of Wednesday) and the 31st day after the first dose administration or the end of the study period (April 14, 2021), whichever occurred first, divided by 31. We only considered the time contributed by individuals who received their first dose between December 28, 2020, and April 11, 2021.",
            "cite_spans": [],
            "ref_spans": [],
            "section": "Statistical Analysis"
        },
        {
            "text": "Overall and group-specific incidence rates were expressed as number of cases per 100,000 person-months and reported along with their 95% exact Poisson confidence intervals (CIs). Under some assumptions, 17 these rates approximate the risk of CVT within 1 month per 100,000 individuals.",
            "cite_spans": [],
            "ref_spans": [],
            "section": "Statistical Analysis"
        },
        {
            "text": "Our approach relies on the assumptions that no individual moved from a state-age-sex-vaccine group to another during the 31 days following first dose administration, that no competing events occurred during this time window, and that everyone received a second dose of the vaccine according to the abovespecified schedule.",
            "cite_spans": [],
            "ref_spans": [],
            "section": "Statistical Analysis"
        },
        {
            "text": "We fitted a Poisson log-linear regression model with the logarithm of the person-months as offset to investigate the association between age group (<60, 60+ years), sex (female, nonfemale), vaccine class (ChAdOx1, mRNA-based vaccines), and the CVT incidence rate within 1 month from first dose administration. No interaction terms were included. We tested the model assumption of equidispersion against the alternative of overdispersion or underdispersion with both linear and quadratic formulation. 18 As a sensitivity analysis, we also fitted a negative Second shot 3 (6.7%) 0 (0.0%) 0 (0.0%) 0 (0.0%) 3 (4.8%) binomial regression and a zero-inflated Poisson regression with intercept-only zero-inflation model to evaluate robustness of the results to different distributional assumptions. Probability values lower than or equal to 0.05 were considered statistically significant. All analyses were performed using R version 4.0.3 and RStudio 1.1.456. Commands dispersiontest (AER package), glm.nb (MASS package), and zeroinfl (pscl package) were used for modeling and testing the count data.",
            "cite_spans": [],
            "ref_spans": [],
            "section": "Statistical Analysis"
        },
        {
            "text": "A total of 291 departments of neurology were contacted, of which 112 reported back (see Fig 1) . After excluding duplicates and cases without cerebrovascular outcomes, 62 patients with a cerebral event were reported in close temporal proximity to the vaccination against COVID-19 (see Fig 1) , of which 45 were CVTs. Reported cases had a mean age of 46.7 years, and 75.8% were female. Six of 52 (11.5%) cases were smokers, 3 of 59 cases (5.1%) were obese, and 1 of 59 (1.7%) reported a previous thrombosis event (Table 1) .",
            "cite_spans": [],
            "ref_spans": [
                {
                    "start": 88,
                    "end": 94,
                    "text": "Fig 1)",
                    "ref_id": "FIGREF0"
                },
                {
                    "start": 285,
                    "end": 291,
                    "text": "Fig 1)",
                    "ref_id": "FIGREF0"
                },
                {
                    "start": 512,
                    "end": 521,
                    "text": "(Table 1)",
                    "ref_id": "TABREF0"
                }
            ],
            "section": "Results"
        },
        {
            "text": "All reported cases occurred after vaccination with ChAdOx1 (85.5%) and BNT162b2 (14.5%). No cases were reported with mRNA-1273. No other vaccines were used in Germany during the study period. The initial diagnosis of CVT was confirmed by magnetic resonance (MR) and MR-venography or computed tomography (CT) and CT-venography in all cases. We identified 37 CVT cases after ChAdOx1 and 8 after BNT162b2. Of the 45 patients with CVT, 35 (77.8%) were female, and 36 (80.0%) were younger than 60 years (see Table 1 ). Primary intracerebral hemorrhages were observed in FIGURE 2: Days from first ChAdOx1 dose administration to neurological symptoms onset for cerebral sinus and/or venous thrombosis (CVT) and non-CVT events. 4 cases, and 9 patients had primary cerebral ischemia (see Table 1 ). In addition, a total of 4 patients were reported with other diagnoses (1 transient global amnesia, 1 spinal artery ischemia, and 2 nausea, 1 of them with headache).",
            "cite_spans": [],
            "ref_spans": [
                {
                    "start": 503,
                    "end": 510,
                    "text": "Table 1",
                    "ref_id": "TABREF0"
                },
                {
                    "start": 779,
                    "end": 786,
                    "text": "Table 1",
                    "ref_id": "TABREF0"
                }
            ],
            "section": "Results"
        },
        {
            "text": "Two of 62 patients (3.2%) presented with dermal petechia, 2 of 62 (3.2%) with subdermal hematoma, and 2 of 62 (3.2%) with bleedings in other territories. A total of 59 (95.2%) events occurred after the first dose administration of a vaccine and 3 (4.8%) after the second dose administration (all 3 BNT162b2; see Table 1 ). Fortytwo (93.3%) and 3 (6.7%) CVT events occurred after first and second dose administration, respectively (see Table 1 ). Sixty-one cases (98.4%) experienced first neurological symptoms within 31 days from the first vaccine shot (approximated value for cases that occurred after BNT162b2 second shot) administration. All events after ChAdOx1 occurred after the first dose, but very few people in Germany received a second dose during the study period (as it is recommended to be administered 10-12 weeks after the first one). Days from first ChAdOx1 shot to neurological symptoms' onset are presented in Figure  2 . The median time interval from last administered vaccine shot to neurological symptoms was 9 days (range = 1-25) for CVT events. None of the cases had a previously confirmed SARS-CoV-2-infection.",
            "cite_spans": [],
            "ref_spans": [
                {
                    "start": 312,
                    "end": 319,
                    "text": "Table 1",
                    "ref_id": "TABREF0"
                },
                {
                    "start": 435,
                    "end": 442,
                    "text": "Table 1",
                    "ref_id": "TABREF0"
                },
                {
                    "start": 928,
                    "end": 937,
                    "text": "Figure  2",
                    "ref_id": null
                }
            ],
            "section": "Results"
        },
        {
            "text": "With the prespecified VITT risk grading, we qualitatively investigated the adherence of the reported cerebrovascular events with the recently described syndrome of a vaccine-induced immunological syndrome leading to thrombocytopenia followed by thrombotic events. Overall, 4 (6.5%) had a risk score of 0, 24 (38.7%) had 1, 1 (1.6%) had 2, 5 (8.1%) had 2+, 4 (6.5%) had 3, and 24 (38.7%) had a score of 4 ( Table 2 ). CVTs with a VITT risk score higher than 2 only occurred after vaccination with ChAdOx1. Among CVT cases, 20 (44.4%) scored 4 points, fulfilling all predefined criteria for the likelihood of vaccine association, and in 26 (57.8%) VITT was graded highly probable (see Table 2 ). In 3 patients, PF4 antibodies were positive, but the VITT function test was negative. All 28 patients with positive PF4 antibodies had received ChAdOx1 between 3 and 15 days before neurological symptoms. Among CVT cases, 22 of 31 (71.0%) had positive PF4 antibodies, 20 of 31 (64.5%) had positive VITT function test, 2 of 43 (4.7%) had relative thrombocytopenia, 26 of 43 (60.5%) had thrombocytopenia, and 23 of 33 (69.7%) had D-dimer levels of >500μg/l (see Table 2 ).",
            "cite_spans": [],
            "ref_spans": [
                {
                    "start": 406,
                    "end": 413,
                    "text": "Table 2",
                    "ref_id": "TABREF2"
                },
                {
                    "start": 683,
                    "end": 690,
                    "text": "Table 2",
                    "ref_id": "TABREF2"
                },
                {
                    "start": 1153,
                    "end": 1160,
                    "text": "Table 2",
                    "ref_id": "TABREF2"
                }
            ],
            "section": "Results"
        },
        {
            "text": "In addition to the CVT patients, 9 cases with ischemic stroke were reported in this survey, 8 (88.9%) of whom had received ChAdOx1 and 1 (11.1%) BNT162b2. Five (55.6%) of the 9 ischemic cases had a high (>2) VITT risk grade. Three (33.3%) fulfilled all 4 criteria of the VITT risk score (see Table 2 ). In 1 of the 2 other cases with a score of 3, the VITT function test was negative despite positive PF4 antibodies. In the second case with a score of 3 the thrombocytes were reduced to 152/nl but not below the threshold of 150/nl. Four patients with primary intracerebral bleeding without imaging signs of CVT were also reported, all after ChAdOx1 vaccination. One patient fulfilled all 4 predefined criteria of the VITT risk score (see Table 2 ). In one other patient with primary intracerebral bleeding, PF4 antibodies and VITT function tests were not available, but severe thrombocytopenia and the typical time interval to the ChAdOx1 vaccination suggested a causal relationship.",
            "cite_spans": [],
            "ref_spans": [
                {
                    "start": 292,
                    "end": 299,
                    "text": "Table 2",
                    "ref_id": "TABREF2"
                },
                {
                    "start": 739,
                    "end": 746,
                    "text": "Table 2",
                    "ref_id": "TABREF2"
                }
            ],
            "section": "Results"
        },
        {
            "text": "Treatment was performed in 2 of 61 (3.3%) patients with plasmapheresis, 20 of 61 (32.8%) with intravenous high-dose immunoglobulins, and 4 of 61 (6.6%) with corticosteroids (Table 3) . Anticoagulation was provided with heparin in 12 of 61 (19.7%), nadroparin in 1 of 61 (1.6%), argatroban in 18 of 61 (29.5%), vitamin K antagonist in 6 of 61 (9.8%), and direct oral anticoagulants in 9 of 61 (14.8%) cases. Eleven patients of 60 (18.3%) died, of whom 9 had been vaccinated with ChAdOx1, and 2 had been vaccinated with BNT162b2. The distribution of the last available score (at discharge, death, or last available information if still hospitalized) on the modified Rankin Scale by VITT risk score category is presented in Table 4 .",
            "cite_spans": [],
            "ref_spans": [
                {
                    "start": 173,
                    "end": 182,
                    "text": "(Table 3)",
                    "ref_id": "TABREF4"
                },
                {
                    "start": 721,
                    "end": 728,
                    "text": "Table 4",
                    "ref_id": "TABREF5"
                }
            ],
            "section": "Results"
        },
        {
            "text": "In total, we estimated an incidence rate of CVT within 1 month from first dose administration of 0.55 (95% CI = 0.38-0.78) per 100,000 person-months. This incidence rate was 1.52 (95% CI = 1.00-2.21) per 100,000 person-months for ChAdOx1, 0.11 (95% CI = 0.03-0.29) per 100,000 person-months for BNT162b2, and 0.00 (95% CI = 0.00-1.48) per 100,000 person-months for mRNA-1273. The incidence rate of CVT within 1 month from first ChAdOx1 dose administration was 2.00 (95% CI = 1.28-2.97) per 100,000 person-months for females and 0.52 (95% CI = 0.11-1.53) per 100,000 person-months for nonfemales. Incidence rates by age group, sex, and vaccine are reported in Table 5 and Figure 3 .",
            "cite_spans": [],
            "ref_spans": [
                {
                    "start": 659,
                    "end": 666,
                    "text": "Table 5",
                    "ref_id": "TABREF6"
                },
                {
                    "start": 671,
                    "end": 679,
                    "text": "Figure 3",
                    "ref_id": "FIGREF2"
                }
            ],
            "section": "Results"
        },
        {
            "text": "In the Poisson model for CVT incidence within 1 month from first dose administration jointly considering age group, vaccine class, and sex, we estimated an adjusted incidence rate ratio of 9.68 (95% CI = 3.46-34.98, p < 0.001) for ChAdOx1 compared to a mRNA-based vaccine, 3.14 (95% CI = 1.22-10.65, p = 0.03) for females compared to non-females, and 2.14 (95% CI = 0.83-6.78, p = 0.15) for those aged <60 years compared with those aged ≥60 years.",
            "cite_spans": [],
            "ref_spans": [],
            "section": "Results"
        },
        {
            "text": "No evidence of overdispersion or underdispersion was found in testing with either linear (p = 0.37) or quadratic (p = 0.79) formulation. In the sensitivity analysis, the negative binomial regression adjusted rate ratios for age group (<60 vs ≥60 years), sex (female vs non-female), and vaccine class (ChAdOx1 vs mRNA-based vaccines) were 2.71 (95% CI = 0.86-9.69, p = 0.09), 3.96 (95% CI = 1.19-16.30, p = 0.026), and 12.87 (95% CI = 3.96-51.14, p < 0.001), respectively. In the zero-inflated Poisson regression, the adjusted rate ratios were 2.14 (95% CI = 0.76-6.03, p = 0.15), 3.14 (95% CI = 1.09-9.00, p = 0.03), and 9.68 (95% CI = 3.12-30.07, p < 0.001). This demonstrated the robustness of our results to different distributional assumptions.",
            "cite_spans": [],
            "ref_spans": [],
            "section": "Results"
        },
        {
            "text": "Our descriptive study from Germany identified 62 vascular cerebrovascular adverse events in close temporal relationship with a COVID-19 vaccination, of which 45 cases were CVT. We estimated an incidence rate of CVT within 1 month from first dose administration of 1.52 per 100,000 person-months for the ChAdOx1 vaccine and 0.11 per 100,000 person-months for BNT162b2. Before the COVID-19 pandemic, the incidence rate of CVT has been estimated between 0.22-1.75 per 100,000 personyears, corresponding to 0.02-0.15 per 100,000 personmonths, in 4 European countries, Australia, Iran, and Hong Kong. [7] [8] [9] This corresponds to a >10-fold higher CVT incidence rate in patients who received a first ChAdOx1 vaccine shot compared with the highest estimate of CVT incidence rate from empirical data. A recent study using information from patient management software of general practitioners estimated that, in the period of 2017-2019, the incidence rate of CVT in Germany was 0.5 per 100,000 person-years, corresponding to 0.04 per 100,000 person-months. 19 In this article, we presented the frequency of CVT in terms of incidence rate. This choice was made to account for some individuals being at risk for <31 days due to administrative censorship, and to provide values comparable to published CVT incidence estimates in the general population. Summarizing the incidence with this metric also has limitations, namely, the assumption of a constant intensity of the phenomenon over time and a lower interpretability. To overcome the issue of limited interpretability, we would like to point out that under some assumptions the incidence rates approximate risks. For example, the reported incidence rate of 1.52 per 100,000 person-months after ChAdOx1 vaccination approximately corresponds to a risk of CVT within 1 month from first ChAdOx1 administration of 1.52 per 100,000 individuals.",
            "cite_spans": [
                {
                    "start": 596,
                    "end": 599,
                    "text": "[7]",
                    "ref_id": "BIBREF6"
                },
                {
                    "start": 600,
                    "end": 603,
                    "text": "[8]",
                    "ref_id": "BIBREF7"
                },
                {
                    "start": 604,
                    "end": 607,
                    "text": "[9]",
                    "ref_id": "BIBREF8"
                }
            ],
            "ref_spans": [],
            "section": "Discussion"
        },
        {
            "text": "The incidence rate of a CVT event after first dose COVID-19 vaccination was statistically significantly higher for ChAdOx1 (rate ratio = 9.68, 95% CI = 3.46-34.98) compared to mRNA-based vaccines and for females (3.14, 95% CI = 1.22-10.65) compared to nonfemales. In our data, the association between age group (60+, <60 years) and CVT incidence was not statistically significant after accounting for sex and vaccine class.",
            "cite_spans": [],
            "ref_spans": [],
            "section": "Discussion"
        },
        {
            "text": "Although these associations should not be interpreted as causal effect estimates, they provide useful information to target individuals at higher risk of CVT.",
            "cite_spans": [],
            "ref_spans": [],
            "section": "Discussion"
        },
        {
            "text": "Comparisons with other countries and settings are challenging, as the probability of receiving a specific vaccination differs by age, sex, profession, and other factors. The number of people diagnosed in the United Kingdom with CVT after receiving the ChAdOx1 vaccine was reported by the UK Medicines & Healthcare products Regulatory Agency (MHR) as 22 cases among 18 million people who have received the vaccine. 20 However, these numbers were updated by the MHR by April 28, 2021. Now, 242 cases of major thromboembolic events with concurrent thrombocytopenia following vaccination with ChAdOx1 have been reported, including 93 cases of CVT. 21 Up to the same time point, 22.6 million people in the United Kingdom had received their first dose and 5.9 million their second dose of ChAdOx1. Of the 242 cases, 161 occurred in the age group younger and 67 in the age group older than 60 years. In 14 cases, the age remained unknown.",
            "cite_spans": [],
            "ref_spans": [],
            "section": "Discussion"
        },
        {
            "text": "A population-based cohort study using data from 281,264 individuals vaccinated with ChAdOx1 in Denmark and Norway reported a standardized morbidity ratio for cerebral venous thrombosis of 20.25, corresponding to 7 observed events versus 0.3 expected ones and an excess of 2.5 events per 100,000 vaccinations. 22 Although there was no overall increase in the arterial event group, the rate of intracerebral hemorrhage was increased, with a standardized morbidity ratio of 2.33. 22 CVT is a very rare disease, and it is unlikely that the higher incidence rate among vaccinated individuals is purely the product of chance. The identification of antibodies against thrombocytes in a high percentage of our patients in whom the test results were available is another strong argument for a causal relationship. Understandably, the recommended treatment of CVT beyond anticoagulation is the use of intravenous immunoglobulin or plasmapheresis.",
            "cite_spans": [],
            "ref_spans": [],
            "section": "Discussion"
        },
        {
            "text": "Although our survey focused on collecting information about CVT cases in temporal relationship with COVID-19 vaccination, our questionnaire also allowed the reporting of other neurological diagnoses. Interestingly, 5 cases with embolic ischemic stroke and a VITT score of >2 without signs of CVT were reported. In 4 of them, thrombotic occlusion of the middle cerebral artery or internal carotid artery, and/or recurrent thrombotic material in duplex ultrasound were reported. This is similar to heparin-induced thrombopenia, in which arterial thrombosis occurs as well, and at a ratio of 1:4.3 compared with venous thrombosis. 23 In addition, 2 primary intracranial hemorrhages with a VITT risk score > 2 without a detectable sign of CVT were reported.",
            "cite_spans": [],
            "ref_spans": [],
            "section": "Discussion"
        },
        {
            "text": "The conclusions with respect to our hypotheses are as follows:",
            "cite_spans": [],
            "ref_spans": [],
            "section": "Discussion"
        },
        {
            "text": "1. Individuals in Germany were vaccinated with ChAdOx1, mRNA-1273, and BNT162b2. In our study, CVTs with a VITT risk score > 2 only occurred after vaccination with ChAdOx1. Our results suggest that VITT-induced antibodies against PF4 do not cross-react with the spike protein of SARS-CoV-2. 24 A recent report of an individual who developed a CVT associated with severe thrombopenia at 14 days after immunization with Ad26.COV2.S suggests that VITT-associated thrombotic events may be associated with adenovirus vector-based vaccines directed against the SARS-CoV-2 spike protein. 25 2. We confirm that CVT within 1 month from first dose administration occurs at a higher rate in females compared to non-females, accounting for age group and vaccine class. However, the rate of CVT occurring within 1 month from first dose administration, taking into account sex and vaccine class, did not differ statistically significantly between individuals younger than 60 years and individuals who are 60 years or older. 3. We confirm that most of the patients with a CVT at 1 to 16 days after vaccination with ChAdOx1, who have thrombocytopenia, also have VITT. 4. VITT-mediated cerebral vascular events (VITT risk score > 2) were not restricted to CVT but were also observed in cases of primary cerebral ischemia (n = 5) and intracerebral hemorrhage (n = 2).",
            "cite_spans": [],
            "ref_spans": [],
            "section": "Discussion"
        },
        {
            "text": "Currently, several questions remain unanswered. First, it is unclear how many patients develop antibodies against PF4 after vaccination with ChAdOx1 (and potentially Ad26.COV2.S) without thrombotic complications. Therefore, the risk of re-exposure to the vaccine in conjunction with the second vaccination cannot be estimated. Second, although the platelet activation of VITT is heparin-independent, it is unknown whether heparin therapy aggravates VITT in analogy to the clinical syndrome of autoimmune heparin-induced thrombocytopenia. Hence, nonheparin anticoagulants are recommended for the treatment of VITT-related CVT. Although venous and less common arterial thromboses have also been reported outside the central nervous system in VITT, 12, 13 it remains unclear why vessels of the central nervous system are primarily affected.",
            "cite_spans": [
                {
                    "start": 746,
                    "end": 749,
                    "text": "12,",
                    "ref_id": "BIBREF11"
                }
            ],
            "ref_spans": [],
            "section": "Discussion"
        },
        {
            "text": "Our data cannot serve and should not be interpreted as a recommendation for the vaccination strategy to be implemented. Although we believe this article provides important information to inform such a decision, we only quantified the incidence of cerebral venous thrombosis following vaccination by sex, age group, and vaccine type in 9 German states. It needs to be emphasized that VITT is a very rare event and that the risk-benefit ratio of vaccination against SARS-CoV-2 needs to be considered. Other factors to be taken into account for estimating an overall risk-benefit ratio include the risk of cerebral blood clots from COVID-19 disease. 26, 27 A recent study using US data reported a CVT incidence of 42.8 per million people in the first 2 weeks after COVID-19, which then decreased by one fourth in the following 2 weeks. It also demonstrated that COVID-19 patients have a 2-week risk of CVT, which is 6 times higher than that of matched individuals vaccinated with a first dose of mRNA vaccines. 26 The decision on which vaccination strategy is best in a specific context depends not only on the risks of the vaccination but also on its benefits, with respect to possible and available alternative strategies.",
            "cite_spans": [
                {
                    "start": 647,
                    "end": 650,
                    "text": "26,",
                    "ref_id": "BIBREF25"
                }
            ],
            "ref_spans": [],
            "section": "Discussion"
        },
        {
            "text": "Strengths of our study include the standardized collection of patient data with cerebral outcomes within a reasonable time period after COVID-19 vaccination from almost all departments of neurology of German university hospitals (which represent the tertiary care centers in Germany). As of March 31, 2021, a total of 31 cases of CVT after ChAdOx1 vaccination in the whole country have been reported. 28 In our study, we reported 37 confirmed CVT cases after ChAdOx1 vaccination as of April 15, suggesting a high level of coverage in the case ascertainment. Another strength of the study is that each case was evaluated by 4 neurologists and 1 coagulation specialist, who discussed all aspects of the provided clinical information. To approximate the incidences, we used official data of vaccinated people in Germany and had information on the age, sex, and vaccine type distribution from 9 of the 16 states in Germany.",
            "cite_spans": [],
            "ref_spans": [],
            "section": "Discussion"
        },
        {
            "text": "Limitations of our study include that we only collected information from neurological departments, and patients may have been treated at other departments or died without reaching a hospital. This would lead to an underestimation of the CVT incidence. We could not collect the brain imaging data to validate the diagnosis of CVT and other cerebral events. Moreover, our main disease of interest was CVT after COVID-19 vaccination. Although we can be confident, also thanks to public discussions about CVT as a consequence of the ChAdOx1 vaccine, that we have high coverage for this disease, this does not hold true for the other cerebral diseases. Almost certainly, the cases of ischemic stroke or cerebral hemorrhage reported in this survey represented a very selected subset of all cases, probably reported because of a strong suspicion of a link with the COVID-19 vaccination. We did not have data on the age, sex, and vaccine type distribution of vaccinated people from all of Germany but only from 9 of its 16 states. Furthermore, we had to compute the overall number of person-months spent at risk by subgroup, relying on a crude approximation of the number of first doses administered. Lastly, we cannot exclude that in this retrospective survey some transferred data were misclassified or differentially missing.",
            "cite_spans": [],
            "ref_spans": [],
            "section": "Discussion"
        },
        {
            "text": "While this paper was under review, an article appeared online that made similar observations of excess occurrence of CVT within 1 month after vaccination with adenovirus-based SARS-Cov-2 vaccines in US and UK populations. 29 The confirmation of this response in 3 countries supports the concept that these vaccines are causative for this excess of observed events.",
            "cite_spans": [],
            "ref_spans": [],
            "section": "Discussion"
        },
        {
            "text": "Two of the cases included in this report were also presented in the first description of VITT by Greinacher and colleagues. 13 Interpretations Findings of our study imply further careful considerations in the administration of ChAdOx1, especially for women, and risk-benefit considerations when considering this vector-based vaccination by age. In addition, continued registration of all cerebrovascular events after vaccination and all rare cerebral venous thromboses in a standardized and validated manner is important for properly evaluating the risk of these events after COVID-19 vaccination.",
            "cite_spans": [],
            "ref_spans": [],
            "section": "Discussion"
        }
    ],
    "bib_entries": {
        "BIBREF0": {
            "ref_id": "b0",
            "title": "Safety and immunogenicity of ChAdOx1 nCoV-19 vaccine administered in a prime-boost regimen in young and old adults (COV002): a single-blind, randomised, controlled, phase 2/3 trial",
            "authors": [
                {
                    "first": "M",
                    "middle": [
                        "N"
                    ],
                    "last": "Ramasamy",
                    "suffix": ""
                },
                {
                    "first": "A",
                    "middle": [
                        "M"
                    ],
                    "last": "Minassian",
                    "suffix": ""
                },
                {
                    "first": "K",
                    "middle": [
                        "J"
                    ],
                    "last": "Ewer",
                    "suffix": ""
                }
            ],
            "year": 2021,
            "venue": "Lancet",
            "volume": "396",
            "issn": "",
            "pages": "1979--1993",
            "other_ids": {}
        },
        "BIBREF1": {
            "ref_id": "b1",
            "title": "Safety and efficacy of the BNT162b2 mRNA Covid-19 vaccine",
            "authors": [
                {
                    "first": "F",
                    "middle": [
                        "P"
                    ],
                    "last": "Polack",
                    "suffix": ""
                },
                {
                    "first": "S",
                    "middle": [
                        "J"
                    ],
                    "last": "Thomas",
                    "suffix": ""
                },
                {
                    "first": "N",
                    "middle": [],
                    "last": "Kitchin",
                    "suffix": ""
                }
            ],
            "year": 2020,
            "venue": "N Engl J Med",
            "volume": "383",
            "issn": "",
            "pages": "2603--2615",
            "other_ids": {}
        },
        "BIBREF2": {
            "ref_id": "b2",
            "title": "Efficacy and safety of the mRNA-1273 SARS-CoV-2 vaccine",
            "authors": [
                {
                    "first": "L",
                    "middle": [
                        "R"
                    ],
                    "last": "Baden",
                    "suffix": ""
                },
                {
                    "first": "Hme",
                    "middle": [],
                    "last": "Sahly",
                    "suffix": ""
                },
                {
                    "first": "B",
                    "middle": [],
                    "last": "Essink",
                    "suffix": ""
                }
            ],
            "year": 2020,
            "venue": "N Engl J Med",
            "volume": "384",
            "issn": "",
            "pages": "403--416",
            "other_ids": {}
        },
        "BIBREF3": {
            "ref_id": "b3",
            "title": "Safety and efficacy of the ChAdOx1 nCoV-19 vaccine (AZD1222) against SARS-CoV-2: an interim analysis of four randomised controlled trials in Brazil, South Africa, and the UK",
            "authors": [
                {
                    "first": "M",
                    "middle": [],
                    "last": "Voysey",
                    "suffix": ""
                },
                {
                    "first": "Sac",
                    "middle": [],
                    "last": "Clemens",
                    "suffix": ""
                },
                {
                    "first": "S",
                    "middle": [
                        "A"
                    ],
                    "last": "Madhi",
                    "suffix": ""
                }
            ],
            "year": 2021,
            "venue": "Lancet",
            "volume": "397",
            "issn": "",
            "pages": "99--111",
            "other_ids": {}
        },
        "BIBREF4": {
            "ref_id": "b4",
            "title": "Safety and efficacy of singledose Ad26.COV2.S vaccine against Covid-19",
            "authors": [
                {
                    "first": "J",
                    "middle": [],
                    "last": "Sadoff",
                    "suffix": ""
                },
                {
                    "first": "G",
                    "middle": [],
                    "last": "Gray",
                    "suffix": ""
                },
                {
                    "first": "A",
                    "middle": [],
                    "last": "Vandebosch",
                    "suffix": ""
                }
            ],
            "year": 2021,
            "venue": "N Engl J Med",
            "volume": "384",
            "issn": "",
            "pages": "2187--2201",
            "other_ids": {}
        },
        "BIBREF5": {
            "ref_id": "b5",
            "title": "Table with reported vaccinations by federal state and vaccination rates by age group",
            "authors": [
                {
                    "first": "Robert",
                    "middle": [],
                    "last": "Koch Institute",
                    "suffix": ""
                }
            ],
            "year": 2021,
            "venue": "",
            "volume": "",
            "issn": "",
            "pages": "",
            "other_ids": {}
        },
        "BIBREF6": {
            "ref_id": "b6",
            "title": "Cerebral venous thrombosis: Finnish nationwide trends",
            "authors": [
                {
                    "first": "J",
                    "middle": [
                        "O"
                    ],
                    "last": "Ruuskanen",
                    "suffix": ""
                },
                {
                    "first": "V",
                    "middle": [],
                    "last": "Kytö",
                    "suffix": ""
                },
                {
                    "first": "J",
                    "middle": [
                        "P"
                    ],
                    "last": "Posti",
                    "suffix": ""
                }
            ],
            "year": 2021,
            "venue": "Stroke",
            "volume": "52",
            "issn": "",
            "pages": "335--338",
            "other_ids": {}
        },
        "BIBREF7": {
            "ref_id": "b7",
            "title": "Incidence and mortality of cerebral venous thrombosis in a Norwegian population",
            "authors": [
                {
                    "first": "E",
                    "middle": [
                        "S"
                    ],
                    "last": "Kristoffersen",
                    "suffix": ""
                },
                {
                    "first": "C",
                    "middle": [
                        "E"
                    ],
                    "last": "Harper",
                    "suffix": ""
                },
                {
                    "first": "K",
                    "middle": [
                        "G"
                    ],
                    "last": "Vetvik",
                    "suffix": ""
                }
            ],
            "year": 2020,
            "venue": "Stroke",
            "volume": "51",
            "issn": "",
            "pages": "3023--3029",
            "other_ids": {}
        },
        "BIBREF8": {
            "ref_id": "b8",
            "title": "Cerebral vein and dural sinus thrombosis in Portugal: 1980-1998",
            "authors": [
                {
                    "first": "J",
                    "middle": [
                        "M"
                    ],
                    "last": "Ferro",
                    "suffix": ""
                },
                {
                    "first": "M",
                    "middle": [],
                    "last": "Correia",
                    "suffix": ""
                },
                {
                    "first": "C",
                    "middle": [],
                    "last": "Pontes",
                    "suffix": ""
                }
            ],
            "year": 2001,
            "venue": "Cerebrovasc Dis",
            "volume": "11",
            "issn": "",
            "pages": "177--182",
            "other_ids": {}
        },
        "BIBREF9": {
            "ref_id": "b9",
            "title": "Cerebral venous thrombosis: a comprehensive review",
            "authors": [
                {
                    "first": "P",
                    "middle": [
                        "S"
                    ],
                    "last": "Idiculla",
                    "suffix": ""
                },
                {
                    "first": "D",
                    "middle": [],
                    "last": "Gurala",
                    "suffix": ""
                },
                {
                    "first": "M",
                    "middle": [],
                    "last": "Palanisamy",
                    "suffix": ""
                }
            ],
            "year": 2020,
            "venue": "Eur Neurol",
            "volume": "83",
            "issn": "",
            "pages": "369--379",
            "other_ids": {}
        },
        "BIBREF10": {
            "ref_id": "b10",
            "title": "Genes associated with adult cerebral venous thrombosis",
            "authors": [
                {
                    "first": "T",
                    "middle": [],
                    "last": "Marjot",
                    "suffix": ""
                },
                {
                    "first": "S",
                    "middle": [],
                    "last": "Yadav",
                    "suffix": ""
                },
                {
                    "first": "N",
                    "middle": [],
                    "last": "Hasan",
                    "suffix": ""
                }
            ],
            "year": 2011,
            "venue": "Stroke",
            "volume": "42",
            "issn": "",
            "pages": "913--918",
            "other_ids": {}
        },
        "BIBREF11": {
            "ref_id": "b11",
            "title": "Thrombosis and thrombocytopenia after ChAdOx1 nCoV-19 vaccination",
            "authors": [
                {
                    "first": "N",
                    "middle": [
                        "H"
                    ],
                    "last": "Schultz",
                    "suffix": ""
                },
                {
                    "first": "I",
                    "middle": [
                        "H"
                    ],
                    "last": "Sørvoll",
                    "suffix": ""
                },
                {
                    "first": "A",
                    "middle": [
                        "E"
                    ],
                    "last": "Michelsen",
                    "suffix": ""
                }
            ],
            "year": 2021,
            "venue": "N Engl J Med",
            "volume": "384",
            "issn": "",
            "pages": "2124--2130",
            "other_ids": {}
        },
        "BIBREF12": {
            "ref_id": "b12",
            "title": "Thrombotic thrombocytopenia after ChAdOx1 nCov-19 vaccination",
            "authors": [
                {
                    "first": "A",
                    "middle": [],
                    "last": "Greinacher",
                    "suffix": ""
                },
                {
                    "first": "T",
                    "middle": [],
                    "last": "Thiele",
                    "suffix": ""
                },
                {
                    "first": "T",
                    "middle": [
                        "E"
                    ],
                    "last": "Warkentin",
                    "suffix": ""
                }
            ],
            "year": 2021,
            "venue": "N Engl J Med",
            "volume": "384",
            "issn": "",
            "pages": "2092--2101",
            "other_ids": {}
        },
        "BIBREF13": {
            "ref_id": "b13",
            "title": "Pathologic antibodies to platelet factor 4 after ChAdOx1 nCoV-19 vaccination",
            "authors": [
                {
                    "first": "M",
                    "middle": [],
                    "last": "Scully",
                    "suffix": ""
                },
                {
                    "first": "D",
                    "middle": [],
                    "last": "Singh",
                    "suffix": ""
                },
                {
                    "first": "R",
                    "middle": [],
                    "last": "Lown",
                    "suffix": ""
                }
            ],
            "year": 2021,
            "venue": "N Engl J Med",
            "volume": "384",
            "issn": "",
            "pages": "2202--2211",
            "other_ids": {}
        },
        "BIBREF14": {
            "ref_id": "b14",
            "title": "Covid-19: European countries suspend use of Oxford-AstraZeneca vaccine after reports of blood clots",
            "authors": [
                {
                    "first": "J",
                    "middle": [],
                    "last": "Wise",
                    "suffix": ""
                }
            ],
            "year": 2021,
            "venue": "BMJ",
            "volume": "372",
            "issn": "",
            "pages": "",
            "other_ids": {}
        },
        "BIBREF15": {
            "ref_id": "b15",
            "title": "Thromboembolism and the Oxford-AstraZeneca COVID-19 vaccine: side-effect or coincidence?",
            "authors": [
                {
                    "first": "S",
                    "middle": [
                        "D"
                    ],
                    "last": "Østergaard",
                    "suffix": ""
                },
                {
                    "first": "M",
                    "middle": [],
                    "last": "Schmidt",
                    "suffix": ""
                },
                {
                    "first": "E",
                    "middle": [],
                    "last": "Horv Ath-Puh O",
                    "suffix": ""
                }
            ],
            "year": 2021,
            "venue": "Lancet",
            "volume": "397",
            "issn": "",
            "pages": "1441--1443",
            "other_ids": {}
        },
        "BIBREF16": {
            "ref_id": "b16",
            "title": "Modern epidemiology",
            "authors": [
                {
                    "first": "K",
                    "middle": [
                        "J"
                    ],
                    "last": "Rothman",
                    "suffix": ""
                },
                {
                    "first": "S",
                    "middle": [],
                    "last": "Greenland",
                    "suffix": ""
                },
                {
                    "first": "T",
                    "middle": [
                        "L"
                    ],
                    "last": "Lash",
                    "suffix": ""
                }
            ],
            "year": 2008,
            "venue": "",
            "volume": "",
            "issn": "",
            "pages": "",
            "other_ids": {}
        },
        "BIBREF17": {
            "ref_id": "b17",
            "title": "Regression-based tests for overdispersion in the Poisson model",
            "authors": [
                {
                    "first": "A",
                    "middle": [
                        "C"
                    ],
                    "last": "Cameron",
                    "suffix": ""
                },
                {
                    "first": "P",
                    "middle": [
                        "K"
                    ],
                    "last": "Trivedi",
                    "suffix": ""
                }
            ],
            "year": 1990,
            "venue": "J Econom",
            "volume": "46",
            "issn": "",
            "pages": "347--364",
            "other_ids": {}
        },
        "BIBREF18": {
            "ref_id": "b18",
            "title": "Background rates of five thrombosis with thrombocytopenia syndromes of special interest for COVID-19 vaccine safety surveillance: incidence between 2017 and 2019 and patient profiles from 20.6 million people in six European countries",
            "authors": [
                {
                    "first": "E",
                    "middle": [],
                    "last": "Burn",
                    "suffix": ""
                },
                {
                    "first": "X",
                    "middle": [],
                    "last": "Li",
                    "suffix": ""
                },
                {
                    "first": "K",
                    "middle": [],
                    "last": "Kostka",
                    "suffix": ""
                }
            ],
            "year": null,
            "venue": "",
            "volume": "",
            "issn": "",
            "pages": "",
            "other_ids": {}
        },
        "BIBREF19": {
            "ref_id": "b19",
            "title": "Coronavirus vaccine-weekly summary of Yellow Card reporting",
            "authors": [],
            "year": 2021,
            "venue": "Medicines & Healthcare products Regulatory Agency",
            "volume": "",
            "issn": "",
            "pages": "",
            "other_ids": {}
        },
        "BIBREF20": {
            "ref_id": "b20",
            "title": "Coronavirus vaccine-weekly summary of Yellow Card reporting",
            "authors": [],
            "year": 2021,
            "venue": "Medicines & Healthcare products Regulatory Agency",
            "volume": "",
            "issn": "",
            "pages": "",
            "other_ids": {}
        },
        "BIBREF21": {
            "ref_id": "b21",
            "title": "Arterial events, venous thromboembolism, thrombocytopenia, and bleeding after vaccination with Oxford-AstraZeneca ChAdOx1-S in Denmark and Norway: population based cohort study",
            "authors": [
                {
                    "first": "A",
                    "middle": [],
                    "last": "Pottegård",
                    "suffix": ""
                },
                {
                    "first": "L",
                    "middle": [
                        "C"
                    ],
                    "last": "Lund",
                    "suffix": ""
                },
                {
                    "first": "Ø",
                    "middle": [],
                    "last": "Karlstad",
                    "suffix": ""
                }
            ],
            "year": 2021,
            "venue": "BMJ",
            "volume": "373",
            "issn": "",
            "pages": "",
            "other_ids": {}
        },
        "BIBREF22": {
            "ref_id": "b22",
            "title": "A 14-year study of heparin-induced thrombocytopenia",
            "authors": [
                {
                    "first": "T",
                    "middle": [
                        "E"
                    ],
                    "last": "Warkentin",
                    "suffix": ""
                },
                {
                    "first": "J",
                    "middle": [
                        "G"
                    ],
                    "last": "Kelton",
                    "suffix": ""
                }
            ],
            "year": 1996,
            "venue": "Am J Med",
            "volume": "101",
            "issn": "",
            "pages": "502--507",
            "other_ids": {}
        },
        "BIBREF23": {
            "ref_id": "b23",
            "title": "Anti-platelet factor 4 antibodies causing VITT do not cross-react with SARS-CoV-2 spike protein",
            "authors": [
                {
                    "first": "A",
                    "middle": [],
                    "last": "Greinacher",
                    "suffix": ""
                },
                {
                    "first": "K",
                    "middle": [],
                    "last": "Selleng",
                    "suffix": ""
                },
                {
                    "first": "J",
                    "middle": [],
                    "last": "Mayerle",
                    "suffix": ""
                }
            ],
            "year": null,
            "venue": "",
            "volume": "",
            "issn": "",
            "pages": "",
            "other_ids": {
                "DOI": [
                    "10.1182/blood.2021012938"
                ]
            }
        },
        "BIBREF24": {
            "ref_id": "b24",
            "title": "Thrombotic thrombocytopenia after Ad26.COV2.S vaccination",
            "authors": [
                {
                    "first": "K-L",
                    "middle": [],
                    "last": "Muir",
                    "suffix": ""
                },
                {
                    "first": "A",
                    "middle": [],
                    "last": "Kallam",
                    "suffix": ""
                },
                {
                    "first": "S",
                    "middle": [
                        "A"
                    ],
                    "last": "Koepsell",
                    "suffix": ""
                },
                {
                    "first": "K",
                    "middle": [],
                    "last": "Gundabolu",
                    "suffix": ""
                }
            ],
            "year": 2021,
            "venue": "N Engl J Med",
            "volume": "384",
            "issn": "",
            "pages": "1964--1965",
            "other_ids": {}
        },
        "BIBREF25": {
            "ref_id": "b25",
            "title": "Cerebral venous thrombosis and portal vein thrombosis: A retrospective cohort study of 537,913 COVID-19 cases",
            "authors": [
                {
                    "first": "M",
                    "middle": [],
                    "last": "Taquet",
                    "suffix": ""
                },
                {
                    "first": "M",
                    "middle": [],
                    "last": "Husain",
                    "suffix": ""
                },
                {
                    "first": "J",
                    "middle": [
                        "R"
                    ],
                    "last": "Geddes",
                    "suffix": ""
                }
            ],
            "year": 2021,
            "venue": "EClinicalMedicine",
            "volume": "39",
            "issn": "",
            "pages": "",
            "other_ids": {
                "DOI": [
                    "10.1016/j.eclinm.2021.101061"
                ]
            }
        },
        "BIBREF26": {
            "ref_id": "b26",
            "title": "Covid-19: risk of cerebral blood clots from disease is 10 times that from vaccination, study finds",
            "authors": [
                {
                    "first": "I",
                    "middle": [],
                    "last": "Torjesen",
                    "suffix": ""
                }
            ],
            "year": 2021,
            "venue": "BMJ",
            "volume": "373",
            "issn": "",
            "pages": "",
            "other_ids": {}
        },
        "BIBREF27": {
            "ref_id": "b27",
            "title": "Covid-19: EMA defends AstraZeneca vaccine as Germany and Canada halt rollouts",
            "authors": [
                {
                    "first": "O",
                    "middle": [],
                    "last": "Dyer",
                    "suffix": ""
                }
            ],
            "year": 2021,
            "venue": "BMJ",
            "volume": "373",
            "issn": "",
            "pages": "",
            "other_ids": {}
        },
        "BIBREF28": {
            "ref_id": "b28",
            "title": "Cerebral venous sinus thrombosis in the US population, after adenovirus-based SARS-CoV-2 vaccination, and after COVID-19",
            "authors": [
                {
                    "first": "B",
                    "middle": [],
                    "last": "Bikdeli",
                    "suffix": ""
                },
                {
                    "first": "S",
                    "middle": [],
                    "last": "Chatterjee",
                    "suffix": ""
                },
                {
                    "first": "S",
                    "middle": [],
                    "last": "Arora",
                    "suffix": ""
                }
            ],
            "year": 2021,
            "venue": "J Am Coll Cardiol",
            "volume": "78",
            "issn": "",
            "pages": "408--411",
            "other_ids": {}
        }
    },
    "ref_entries": {
        "FIGREF0": {
            "text": "Study flow chart.",
            "latex": null,
            "type": "figure"
        },
        "FIGREF2": {
            "text": "Incidence rates with 95% confidence intervals of cerebral sinus and/or venous thrombosis (CVT) within 1 month (31 days) from first dose administration of vaccine against SARS-CoV-2 by vaccine type, sex, and age group.",
            "latex": null,
            "type": "figure"
        },
        "TABREF0": {
            "text": "Vaccine-induced CVTs are restricted to COVID-19",
            "latex": null,
            "type": "table"
        },
        "TABREF1": {
            "text": "Characteristics of Included Cases with Cerebral and Central Nervous System Events within 31 days from Covid-19 Vaccination",
            "latex": null,
            "type": "table"
        },
        "TABREF2": {
            "text": "VITT Grading Score and Relevant Clinical Parameters of included Cases with Cerebral and Central Nervous System Events within 31 days from Covid-19 Vaccination",
            "latex": null,
            "type": "table"
        },
        "TABREF4": {
            "text": "IVIG = intravenous high-dose immunoglobulins, sc = subcutaneous, iv = intravenous, DOAC = direct oral anticoagulants.",
            "latex": null,
            "type": "table"
        },
        "TABREF5": {
            "text": "Modified Rankin scale of included Cases with Cerebral and Central Nervous System Events within 31 days from Covid-19 Vaccination by VITT Risk Group",
            "latex": null,
            "type": "table"
        },
        "TABREF6": {
            "text": "",
            "latex": null,
            "type": "table"
        }
    },
    "back_matter": [
        {
            "text": "We thank the Robert Koch Institute for providing data on administered vaccine shots in Germany. There was no specific funding for this study. Open Access funding enabled and organized by Projekt DEAL. ",
            "cite_spans": [],
            "ref_spans": [],
            "section": "Acknowledgments"
        },
        {
            "text": "There was no specific funding for this study. H.-C.D., S.P., and T.T. report having received personal compensation for contribution to advisory boards and oral presentations from Pfizer and/or AstraZeneca, both manufacturers of SARS-Cov2 vaccines. A.G. reports holding a pending patent for a modified SARS-CoV-2 vaccine. The other authors have nothing to report.",
            "cite_spans": [],
            "ref_spans": [],
            "section": "Potential Conflicts of Interests"
        },
        {
            "text": "Due to agreements required for ethics, data protection, and privacy in this survey, we will not be able to share data that contain identifying information, including medical center, age, or sex of the subjects.",
            "cite_spans": [],
            "ref_spans": [],
            "section": "Data Availability"
        }
    ]
}