{
    "paper_id": "0a2f5832b522bc36a0d95189a42eb7debaa413c0",
    "metadata": {
        "title": "Viral transport media for COVID-19 testing-NC-ND license ( http://creativecommons.org/licenses/by-nc-nd/4.0/ ) 2",
        "authors": [
            {
                "first": "Matthew",
                "middle": [
                    "J"
                ],
                "last": "Mears",
                "suffix": "",
                "affiliation": {
                    "laboratory": "",
                    "institution": "The Ohio State University",
                    "location": {
                        "settlement": "Columbus",
                        "region": "OH",
                        "country": "USA"
                    }
                },
                "email": ""
            },
            {
                "first": "Michael",
                "middle": [
                    "J"
                ],
                "last": "Wallace",
                "suffix": "",
                "affiliation": {
                    "laboratory": "",
                    "institution": "The Ohio State University",
                    "location": {
                        "settlement": "Columbus",
                        "region": "OH",
                        "country": "USA"
                    }
                },
                "email": ""
            },
            {
                "first": "Jacob",
                "middle": [
                    "S"
                ],
                "last": "Yount",
                "suffix": "",
                "affiliation": {
                    "laboratory": "",
                    "institution": "The Ohio State University",
                    "location": {
                        "settlement": "Columbus",
                        "region": "OH",
                        "country": "USA"
                    }
                },
                "email": ""
            },
            {
                "first": "Lorri",
                "middle": [
                    "A"
                ],
                "last": "Fowler",
                "suffix": "",
                "affiliation": {
                    "laboratory": "",
                    "institution": "The Ohio State University",
                    "location": {
                        "settlement": "Columbus",
                        "region": "OH",
                        "country": "USA"
                    }
                },
                "email": ""
            },
            {
                "first": "Penny",
                "middle": [
                    "S"
                ],
                "last": "Jones",
                "suffix": "",
                "affiliation": {
                    "laboratory": "",
                    "institution": "The Ohio State University",
                    "location": {
                        "settlement": "Columbus",
                        "region": "OH",
                        "country": "USA"
                    }
                },
                "email": ""
            },
            {
                "first": "Peter",
                "middle": [
                    "J"
                ],
                "last": "Mohler",
                "suffix": "",
                "affiliation": {
                    "laboratory": "",
                    "institution": "The Ohio State University",
                    "location": {
                        "settlement": "Columbus",
                        "region": "OH",
                        "country": "USA"
                    }
                },
                "email": ""
            },
            {
                "first": "Loren",
                "middle": [
                    "E"
                ],
                "last": "Wold",
                "suffix": "",
                "affiliation": {
                    "laboratory": "",
                    "institution": "The Ohio State University",
                    "location": {
                        "settlement": "Columbus",
                        "region": "OH",
                        "country": "USA"
                    }
                },
                "email": "loren.wold@osumc.edu"
            },
            {
                "first": "M",
                "middle": [
                    "J"
                ],
                "last": "Mears",
                "suffix": "",
                "affiliation": {},
                "email": ""
            },
            {
                "first": "M",
                "middle": [
                    "J"
                ],
                "last": "Wallace",
                "suffix": "",
                "affiliation": {},
                "email": ""
            },
            {
                "first": "J",
                "middle": [
                    "S"
                ],
                "last": "Yount",
                "suffix": "",
                "affiliation": {},
                "email": ""
            }
        ]
    },
    "abstract": [
        {
            "text": "Precautionary measures of physical isolation, social distancing, and masks have all aided in controlling the spread of COVID-19. However, detection of the virus is crucial to implement isolation of infected individuals. This paper presents the innovative repurposing of lab materials, workspace, and personnel in response to the COVID-19induced shutdown and consequential shortage of commercially made virus transport media (VTM). This method for VTM production highlights the ability of standard research labs to fulfill the needs of those affected by the pandemic and potential recurrence of outbreaks. Further, the collaboration of the various entities at The Ohio State University Wexner Medical Center (OSUWMC) allowed for efficient production and distribution of VTM tubes to facilitate mass COVID-19 testing. We propose that implementation of this process by university research labs would enable quicker interventions, potentially better outcomes, and prevention of further spread of disease.",
            "cite_spans": [],
            "ref_spans": [],
            "section": "Abstract"
        }
    ],
    "body_text": [
        {
            "text": "Controlling the spread of COVID-19 caused by severe acute respiratory syndrome coronavirus 2 (SARS-CoV-2) requires precautionary measures such as physical isolation, social distancing, and masks, but it should be noted that under-detection of the virus poses a problem even when precautionary measures are taken into account [1] . Cases of asymptomatic or subclinical COVID-19 infections are often unreported and may not accurately reflect what stage of the pandemic a particular area [2] . To control the spread of disease, it is essential to have abundant testing, contact tracing, and data for the prediction of possible hotspot areas [3] . Following the initial outbreak of COVID-19 in March 2020, and resulting state-wide lockdown, The Ohio State University Wexner Medical Center (OSUWMC) implemented a reduction in research in order to prevent workplace infections. During this time, like other areas across the world, the State of Ohio wrestled to meet COVID-19 testing kit needs as most commercially sold virus transport media (VTM) was unavailable. In order to meet the demands of testing for the state of Ohio, researchers at OSUWMC developed a custom VTM recipe and a protocol to produce COVID-19 test kits with the available research space in the Dorothy M. Davis Heart and Lung Research Institute (DHLRI) and the Biomedical Research Tower (BRT).",
            "cite_spans": [
                {
                    "start": 325,
                    "end": 328,
                    "text": "[1]",
                    "ref_id": "BIBREF0"
                },
                {
                    "start": 485,
                    "end": 488,
                    "text": "[2]",
                    "ref_id": "BIBREF1"
                },
                {
                    "start": 638,
                    "end": 641,
                    "text": "[3]",
                    "ref_id": "BIBREF2"
                }
            ],
            "ref_spans": [],
            "section": "Introduction"
        },
        {
            "text": "Shortly after the COVID-19 shutdown was implemented, a group of investigators, administrators and staff worked to oversee the repurposing of research lab space and personnel for the production of COVID-19 test kit virus transport media tubes (VTM or Buckeye Media Test Kits). Collaborators in OSUWMC were quickly able to establish a method to produce a stock solution of VTM that was quickly approved by the FDA. Initial production of VTM tubes for testing kits were manufactured by the volunteer research staff and students of OSUWMC, and quickly progressed from 1,700 kits/day to 10,0 0 0 kits/day.",
            "cite_spans": [],
            "ref_spans": [],
            "section": "Introduction"
        },
        {
            "text": "Collaboration with supply chain staff at 610 Ackerman and the Ohio Department of Health (ODH) allowed the OSUWMC to distribute 326,099 of the 386,993 VTM tubes made throughout the State of Ohio. The conversion of DHLRI space, personnel, and on-hand supplies, including those graciously donated by the Ohio Department of Health, was able to fulfill the needs of COVID-19 testing within the Ohio State University as well as assist hospital networks throughout Ohio until commercially sold kits became available in September of 2020. The first day of VTM filling was April 7, 2020 and the last day was February 24, 2021. Outlined below are the processes for producing the parent stock of VTM, aliquots for testing kits, and descriptions of personnel and daily/weekly outputs throughout the timespan of this operation.",
            "cite_spans": [],
            "ref_spans": [],
            "section": "Introduction"
        },
        {
            "text": "All production of parent stock VTM solution and VTM aliquots was conducted in a standard biosafety cabinet (hood). Hood airflow was turned on with UV light for 15 min. Latex gloves were worn and sterilized with 70% ethanol before conducting work in the hood. Hoods were sanitized by spraying 10% bleach on the interior surface, wiped down with kimwipes, sprayed with 70% ethanol, and wiped down with kimwipes. All materials (i.e., packages of sterilized tubes, parent stock VTM, serological pipette and tips) were sterilized with 70% ethanol before placing inside hood and opened within the hood.",
            "cite_spans": [],
            "ref_spans": [],
            "section": "Biosafety cabinet (Hood) aseptic technique"
        },
        {
            "text": "VTM was produced by combining 10 mL heat inactivated FBS (Atlas Biologicals cat. #0500-D), 1 mL 250 μg/mL Amphotericin B (Sigma premade solution, Sigma cat. #A2942-100 mL), and 1 mL 50 mg/mL Gentamicin (Gibco premade solution, Fischer Scientific cat. #15750078) in 500 mL HBSS (Gibco premade, Life Technologies cat. #24020117). Mixed VTM solution ( Table 1a ) was then passed through disposable 500 mL sterile 0.2 μm filter units using an air vacuum into a sterile 500 mL bottle. Table 1b lists all reagents and reagent alternatives. VTM stock solutions were labelled with the fill date and expiration date (1 year from date of filling) and stored at 4 °C.",
            "cite_spans": [],
            "ref_spans": [
                {
                    "start": 347,
                    "end": 359,
                    "text": "( Table 1a )",
                    "ref_id": "TABREF1"
                },
                {
                    "start": 480,
                    "end": 488,
                    "text": "Table 1b",
                    "ref_id": null
                }
            ],
            "section": "Parent stock VTM production"
        },
        {
            "text": "Conical tubes (15 mL, various vendors) were filled with 3 mL of VTM from the parent stock solution. Filled VTM tubes were then labelled with printed pharmacy labels (Brain and Spine Hospital, 12 th floor) that contained information regarding the filling location, fill date, and expiration date of VTM used. VTM tubes were bundled into groups of 10 and stored at 4 °C until use.",
            "cite_spans": [],
            "ref_spans": [],
            "section": "VTM test kit aliquots"
        },
        {
            "text": "From April 2020-May 2020, volunteers from numerous OSUWMC-associated research laboratories, alongside students from the Ohio State University College of Medicine, worked full time to produce 254,791 VTM testing tubes ( Table 2 and Fig. 1 ) for dissemination throughout the State of Ohio.",
            "cite_spans": [],
            "ref_spans": [
                {
                    "start": 217,
                    "end": 226,
                    "text": "( Table 2",
                    "ref_id": "TABREF2"
                },
                {
                    "start": 231,
                    "end": 239,
                    "text": "Fig. 1 )",
                    "ref_id": null
                }
            ],
            "section": "Results"
        },
        {
            "text": "In early June, OSUWMC allowed partial resumption of research activities. Many volunteers from April and May returned full-time to research and education. From mid-June to mid-September, 82 total volunteers from OSUWMC-associated research labs, DHLRI administrators, undergraduate students, and graduate students at the Ohio State University volunteered to help produce VTM and assemble into test kits. All volunteers completed an hour-long hands-on training session to ensure the quality of the final product. Graduate students and OSUWMC research staff with biosafety cabinet aseptic technique experience controlled the VTM pipetting operation, while undergraduate students and administrative staff labeled the sealed conical tubes with manufacture, expiration, and ingredient information. Test kit production continued under this model from June to mid-September. During this timeframe, the team produced and distributed 91,648 VTM tubes. OSUWMC hired 6 part-time undergraduate student employees in late September, 2020 to allow for consistent schedules and production. As COVID-19 positivity rates increased to the highest point of the pandemic, consistent employees reduced person-to-person contact while also ensuring maintenance of a high-quality final product. These students were able to produce 27,395 test kits before the conclusion of the process in February 2021.",
            "cite_spans": [],
            "ref_spans": [],
            "section": "Results"
        },
        {
            "text": "In total, 386,993 VTM tubes were created and 326,099 VTM tubes have been distributed throughout the State of Ohio. Total VTM produced in the DHLRI was 1,474 L, and 337 L of bulk media were distributed by OSUWMC to Ohio Department of Health (ODH) for similar pipetting operations around the Central Ohio area. Recipients of the Buckeye Media Test Kits included ODH (for VTM test kit distribution around the state) and various hospitals and testing facilities associated with OSUWMC. At the moment, 60,894 internally filled tubes remain in storage at OSU and available for dispatch.",
            "cite_spans": [],
            "ref_spans": [],
            "section": "Results"
        },
        {
            "text": "During the initial phases of the COVID-19 outbreak in the United States in March 2020, The Ohio State University Wexner Medical Center opted to pause most on-site basic research activities to prevent workplace spread of the virus. Many researchers were forced to put all data collection on hold. As infection rates soared in Ohio and worldwide, the lack of COVID-19 test kits swiftly became a potential bottleneck for population-wide COVID-19 testing. With commercial test kits in high demand globally, OSUWMC was forced to find new solutions to meet the COVID-19 testing demand. With nearly all basic research staff working from home, OSUWMC elected to rely on their researchers and students to assist the medical center with test kit preparation.",
            "cite_spans": [],
            "ref_spans": [],
            "section": "Discussion"
        },
        {
            "text": "Researchers at OSUWMC examined published VTM compositions, as well as World Health Organization guidance, to identify fundamental components needed for effective VTM. These included physiologically balanced isotonic buffered solution at neutral pH, a stabilizing protein component, and antibacterial and antifungal agents. Indeed, the CDC has since issued a protocol (CDC SOP# DSR-052-05) for production of VTM similar to that prepared by OSUWMC [5] . Starting with this custom VTM recipe that could be prepared in bulk with available high quality research reagents, along with leftover research supplies (15 mL conical tubes, serological pipettes, etc.), OSUWMC was able to create an effective yet unusual FDA-approved COVID-19 virus transport test kit. Within weeks of initial production, the volunteering research staff and students were able to produce up to 10,0 0 0 test kits per day. Daily output and overall rates of production varied between individuals depending on experience and focus. On average, lab staff produced about 125 test kits per hour per person. The COVID-19 test kit production continued in OSUWMC research space at some capacity throughout the initial year of the pandemic. During this time, the OSUWMC volunteers sacrificed their work, and potentially their own health, in order to supplement the supply of COVID-19 test kits in Ohio. In addition to test kit production, we also met with several research teams throughout the United States, as well as a global team from Ethiopia.",
            "cite_spans": [
                {
                    "start": 446,
                    "end": 449,
                    "text": "[5]",
                    "ref_id": "BIBREF4"
                }
            ],
            "ref_spans": [],
            "section": "Discussion"
        },
        {
            "text": "COVID-19 test kits employed by our group supported the propagation of local Columbus, OH strains of SARS-CoV-2 from testing samples, confirming that our VTM formulation maintained infectious virions. In laboratory experiments, others have shown that live SARS-CoV-2 survives in similar VTM for at least 72 h at room temperature, and viral RNA can be detected by RT-PCR as long as 28 days post collection [ 6 , 7 ] . In agreement with this, OSUWMC has contributed numerous full genome sequences of SARS-CoV-2 obtained from our testing kit samples, and identified a Midwestern variant of concern [8] . Overall, our test kits were compatible with RT-PCR detection of SARS-CoV-2, propagation of live virus, and sequencing of full genomes.",
            "cite_spans": [
                {
                    "start": 404,
                    "end": 413,
                    "text": "[ 6 , 7 ]",
                    "ref_id": null
                },
                {
                    "start": 594,
                    "end": 597,
                    "text": "[8]",
                    "ref_id": "BIBREF7"
                }
            ],
            "ref_spans": [],
            "section": "Discussion"
        },
        {
            "text": "Conversion of the DHLRI space and personnel, alongside over 100 volunteers associated with the Ohio State University, allowed for the internal production of 386,993 total COVID-19 test kit viral transport media tubes from April 2020 through February 2021. Until September 2020, OSUWMC was unable to obtain enough commercially produced COVID-19 test kits to fulfil its own needs due to global backorders. The repurposing of OSUWMC research assets allowed the Ohio State University to exceed demand, allowing the University to meet its own testing needs, while also providing for the State of Ohio.",
            "cite_spans": [],
            "ref_spans": [],
            "section": "Discussion"
        },
        {
            "text": "Nothing to disclose.",
            "cite_spans": [],
            "ref_spans": [],
            "section": "Declaration of Competing Interest"
        }
    ],
    "bib_entries": {
        "BIBREF0": {
            "ref_id": "b0",
            "title": "Understanding the challenges and uncertainties of seroprevalence studies for SARS-CoV-2",
            "authors": [
                {
                    "first": "D",
                    "middle": [],
                    "last": "Mcconnell",
                    "suffix": ""
                },
                {
                    "first": "C",
                    "middle": [],
                    "last": "Hickey",
                    "suffix": ""
                },
                {
                    "first": "N",
                    "middle": [],
                    "last": "Bargary",
                    "suffix": ""
                }
            ],
            "year": 2021,
            "venue": "Int. J. Environ. Res. Public Health",
            "volume": "18",
            "issn": "9",
            "pages": "",
            "other_ids": {
                "DOI": [
                    "10.3390/ijerph18094640"
                ]
            }
        },
        "BIBREF1": {
            "ref_id": "b1",
            "title": "Reconstructing the early global dynamics of under-ascertained COVID-19 cases and infections, medRxiv (2020) 1-9 Published online",
            "authors": [
                {
                    "first": "T",
                    "middle": [
                        "W"
                    ],
                    "last": "Russell",
                    "suffix": ""
                },
                {
                    "first": "N",
                    "middle": [],
                    "last": "Golding",
                    "suffix": ""
                },
                {
                    "first": "J",
                    "middle": [],
                    "last": "Hellewell",
                    "suffix": ""
                }
            ],
            "year": null,
            "venue": "",
            "volume": "",
            "issn": "",
            "pages": "",
            "other_ids": {
                "DOI": [
                    "10.1101/2020.07.07.20148460"
                ]
            }
        },
        "BIBREF2": {
            "ref_id": "b2",
            "title": "The COVID-19 pandemic -an epidemiological perspective",
            "authors": [
                {
                    "first": "A",
                    "middle": [],
                    "last": "Vilella",
                    "suffix": ""
                },
                {
                    "first": "A",
                    "middle": [],
                    "last": "Trilla",
                    "suffix": ""
                }
            ],
            "year": 2021,
            "venue": "Curr. Allergy Asthma Rep",
            "volume": "21",
            "issn": "29",
            "pages": "",
            "other_ids": {}
        },
        "BIBREF3": {
            "ref_id": "b3",
            "title": "Detection of severe acute respiratory syndrome coronavirus 2 (SARS-CoV-2) is comparable in clinical samples preserved in saline or viral transport medium",
            "authors": [
                {
                    "first": "J",
                    "middle": [],
                    "last": "Radbel",
                    "suffix": ""
                },
                {
                    "first": "S",
                    "middle": [],
                    "last": "Jagpal",
                    "suffix": ""
                },
                {
                    "first": "J",
                    "middle": [],
                    "last": "Roy",
                    "suffix": ""
                }
            ],
            "year": 2020,
            "venue": "J. Mol. Diagnostics",
            "volume": "22",
            "issn": "7",
            "pages": "871--875",
            "other_ids": {
                "DOI": [
                    "10.1016/j.jmoldx.2020.04.209"
                ]
            }
        },
        "BIBREF4": {
            "ref_id": "b4",
            "title": "Preparation of viral transport medium",
            "authors": [],
            "year": 2020,
            "venue": "Prep. Viral Transp. Mediu",
            "volume": "36",
            "issn": "4",
            "pages": "1--8",
            "other_ids": {}
        },
        "BIBREF5": {
            "ref_id": "b5",
            "title": "Optimal preparation of SARS-CoV-2 viral transport medium for culture",
            "authors": [
                {
                    "first": "J",
                    "middle": [],
                    "last": "Mcauley",
                    "suffix": ""
                },
                {
                    "first": "C",
                    "middle": [],
                    "last": "Fraser",
                    "suffix": ""
                },
                {
                    "first": "E",
                    "middle": [],
                    "last": "Paraskeva",
                    "suffix": ""
                }
            ],
            "year": 2021,
            "venue": "Virol. J",
            "volume": "18",
            "issn": "1",
            "pages": "1--6",
            "other_ids": {
                "DOI": [
                    "10.1186/s12985-021-01525-z"
                ]
            }
        },
        "BIBREF6": {
            "ref_id": "b6",
            "title": "High stability of severe acute respiratory syndrome coronavirus 2 (SARS-CoV-2) RNA under minimal storage conditions for detection by real-time PCR, medRxiv (2020) 1-9 Published online",
            "authors": [
                {
                    "first": "S",
                    "middle": [],
                    "last": "Summer",
                    "suffix": ""
                },
                {
                    "first": "R",
                    "middle": [],
                    "last": "Schmidt",
                    "suffix": ""
                },
                {
                    "first": "A",
                    "middle": [
                        "N"
                    ],
                    "last": "Herdina",
                    "suffix": ""
                }
            ],
            "year": 2015,
            "venue": "",
            "volume": "",
            "issn": "",
            "pages": "",
            "other_ids": {
                "DOI": [
                    "10.1101/2020.07.21.20158154"
                ]
            }
        },
        "BIBREF7": {
            "ref_id": "b7",
            "title": "Distinct patterns of emergence of SARS-CoV-2 spike variants including N501Y in clinical samples in Columbus Ohio",
            "authors": [
                {
                    "first": "Huolin",
                    "middle": [],
                    "last": "Tu",
                    "suffix": ""
                },
                {
                    "first": "Matthew",
                    "middle": [
                        "R"
                    ],
                    "last": "Avenarius",
                    "suffix": ""
                },
                {
                    "first": "Laura",
                    "middle": [],
                    "last": "Kubatko",
                    "suffix": ""
                },
                {
                    "first": "Matthew",
                    "middle": [],
                    "last": "Hunt",
                    "suffix": ""
                },
                {
                    "first": "Xiaokang",
                    "middle": [],
                    "last": "Pan",
                    "suffix": ""
                },
                {
                    "first": "Peng",
                    "middle": [],
                    "last": "Ru",
                    "suffix": ""
                },
                {
                    "first": "Jason",
                    "middle": [],
                    "last": "Garee",
                    "suffix": ""
                },
                {
                    "first": "Keelie",
                    "middle": [],
                    "last": "Thomas",
                    "suffix": ""
                },
                {
                    "first": "Peter",
                    "middle": [],
                    "last": "Mohler",
                    "suffix": ""
                },
                {
                    "first": "Preeti",
                    "middle": [],
                    "last": "Pancholi",
                    "suffix": ""
                }
            ],
            "year": 2021,
            "venue": "Angew Chemie Int Ed",
            "volume": "6",
            "issn": "11",
            "pages": "1--19",
            "other_ids": {}
        }
    },
    "ref_entries": {
        "TABREF0": {
            "text": "table High global demand for commercial COVID-19 test kits has resulted in backorders and scarcity of the product. Using general research supplies, space, and personnel can alleviate this reliance on commercial product. • Reassignment of research personnel to COVID-19 test kit production allows for maximum use of resources during temporary cessations of general research activities due to local outbreaks of COVID-19.",
            "latex": null,
            "type": "table"
        },
        "TABREF1": {
            "text": "Stock VTM Production.",
            "latex": null,
            "type": "table"
        },
        "TABREF2": {
            "text": "Monthly VTM Output.",
            "latex": null,
            "type": "table"
        }
    },
    "back_matter": [
        {
            "text": "Funding provided by grants from the National Institutes of Health (NIH; AI130110) to JSY, the CDC/NIOSH (U01 OH012056) and the NIH (HL139348/AG057046) to LEW, and the American Heart Association (20YVNR35490079) to LEW and PJM. The investigators thank Joe and Linda Chlapaty and Ken and Christina Schwaber as well as an Anonymous Donor for philanthropic gifts to support public health. The investigators also thank the Ohio Department of Health for their partnership during the pandemic.",
            "cite_spans": [],
            "ref_spans": [],
            "section": "Acknowledgements"
        }
    ]
}