{
    "paper_id": "0a309efb3e0910de6841bc9588791424a8dad034",
    "metadata": {
        "title": "Family history of diabetes and risk of SARS-COV-2 in UK Biobank: A prospective cohort study",
        "authors": [
            {
                "first": "Bhautesh",
                "middle": [],
                "last": "Dinesh",
                "suffix": "",
                "affiliation": {},
                "email": "bhautesh.jani@glasgow.ac.uk"
            },
            {
                "first": "Jani",
                "middle": [],
                "last": "",
                "suffix": "",
                "affiliation": {},
                "email": ""
            },
            {
                "first": "Barbara",
                "middle": [
                    "I"
                ],
                "last": "Nicholl",
                "suffix": "",
                "affiliation": {},
                "email": ""
            },
            {
                "first": "|",
                "middle": [
                    "Peter"
                ],
                "last": "Hanlon",
                "suffix": "",
                "affiliation": {},
                "email": ""
            },
            {
                "first": "Frances",
                "middle": [
                    "S"
                ],
                "last": "Mair",
                "suffix": "",
                "affiliation": {},
                "email": ""
            },
            {
                "first": "Jason",
                "middle": [
                    "Mr"
                ],
                "last": "Gill",
                "suffix": "",
                "affiliation": {
                    "laboratory": "",
                    "institution": "University of Glasgow",
                    "location": {
                        "settlement": "Glasgow",
                        "country": "UK"
                    }
                },
                "email": ""
            },
            {
                "first": "Stuart",
                "middle": [
                    "R"
                ],
                "last": "Gray",
                "suffix": "",
                "affiliation": {
                    "laboratory": "",
                    "institution": "University of Glasgow",
                    "location": {
                        "settlement": "Glasgow",
                        "country": "UK"
                    }
                },
                "email": ""
            },
            {
                "first": "Carlos",
                "middle": [
                    "A"
                ],
                "last": "Celis-Morales",
                "suffix": "",
                "affiliation": {
                    "laboratory": "",
                    "institution": "University of Glasgow",
                    "location": {
                        "settlement": "Glasgow",
                        "country": "UK"
                    }
                },
                "email": ""
            },
            {
                "first": "|",
                "middle": [],
                "last": "Frederick",
                "suffix": "",
                "affiliation": {},
                "email": ""
            },
            {
                "first": "K",
                "middle": [],
                "last": "Ho",
                "suffix": "",
                "affiliation": {
                    "laboratory": "",
                    "institution": "University of Glasgow",
                    "location": {
                        "settlement": "Glasgow",
                        "country": "UK"
                    }
                },
                "email": ""
            },
            {
                "first": "|",
                "middle": [],
                "last": "Donald",
                "suffix": "",
                "affiliation": {},
                "email": ""
            },
            {
                "first": "M",
                "middle": [],
                "last": "Lyall",
                "suffix": "",
                "affiliation": {
                    "laboratory": "",
                    "institution": "University of Glasgow",
                    "location": {
                        "settlement": "Glasgow",
                        "country": "UK"
                    }
                },
                "email": ""
            },
            {
                "first": "Jana",
                "middle": [
                    "J"
                ],
                "last": "Anderson",
                "suffix": "",
                "affiliation": {
                    "laboratory": "",
                    "institution": "University of Glasgow",
                    "location": {
                        "settlement": "Glasgow",
                        "country": "UK"
                    }
                },
                "email": ""
            },
            {
                "first": "Claire",
                "middle": [
                    "E"
                ],
                "last": "Hastie",
                "suffix": "",
                "affiliation": {
                    "laboratory": "",
                    "institution": "University of Glasgow",
                    "location": {
                        "settlement": "Glasgow",
                        "country": "UK"
                    }
                },
                "email": ""
            },
            {
                "first": "|",
                "middle": [],
                "last": "Mark",
                "suffix": "",
                "affiliation": {},
                "email": ""
            },
            {
                "first": "E",
                "middle": [
                    "S"
                ],
                "last": "Bailey",
                "suffix": "",
                "affiliation": {
                    "laboratory": "",
                    "institution": "University of Glasgow",
                    "location": {
                        "settlement": "Glasgow",
                        "country": "UK"
                    }
                },
                "email": ""
            },
            {
                "first": "Hamish",
                "middle": [],
                "last": "Foster",
                "suffix": "",
                "affiliation": {},
                "email": ""
            },
            {
                "first": "Jill",
                "middle": [
                    "P"
                ],
                "last": "Pell",
                "suffix": "",
                "affiliation": {
                    "laboratory": "",
                    "institution": "University of Glasgow",
                    "location": {
                        "settlement": "Glasgow",
                        "country": "UK"
                    }
                },
                "email": ""
            },
            {
                "first": "|",
                "middle": [],
                "last": "Paul",
                "suffix": "",
                "affiliation": {
                    "laboratory": "",
                    "institution": "University of Glasgow",
                    "location": {
                        "settlement": "Glasgow",
                        "country": "UK"
                    }
                },
                "email": ""
            },
            {
                "first": "Welsh",
                "middle": [],
                "last": "",
                "suffix": "",
                "affiliation": {},
                "email": ""
            },
            {
                "first": "|",
                "middle": [],
                "last": "Naveed Sattar",
                "suffix": "",
                "affiliation": {
                    "laboratory": "",
                    "institution": "University of Glasgow",
                    "location": {
                        "settlement": "Glasgow",
                        "country": "UK"
                    }
                },
                "email": "naveed.sattar@glasgow.ac.uk"
            }
        ]
    },
    "abstract": [
        {
            "text": "The aim of this study was to determine risk of being SARS-CoV-2 positive and severe infection (associated with hospitalization/mortality) in those with family history of diabetes.",
            "cite_spans": [],
            "ref_spans": [],
            "section": "Abstract"
        },
        {
            "text": "We used UK Biobank, an observational cohort recruited between 2006 and 2010. We compared the risk of being SARS-CoV-2 positive and severe infection for those with family history of diabetes (mother/father/sibling) against those without.",
            "cite_spans": [],
            "ref_spans": [],
            "section": "Abstract"
        },
        {
            "text": "Of 401,268 participants in total, 13,331 tested positive for SARS-CoV-2 and 2282 had severe infection by end of January 2021. In unadjusted models, participants with ≥2 family members with diabetes were more likely to be SARS-CoV-2 positive (risk ratio-RR 1.35; 95% confidence interval-CI 1.24-1.47) and severe infection (RR 1.30; 95% CI 1.04-1.59), compared to those without. The excess risk of being tested positive for SARS-CoV-2 was attenuated but significant after adjusting for demographics, lifestyle factors, multimorbidity and presence of cardiometabolic conditions. The excess risk for severe infection was no longer significant after adjusting for demographics, lifestyle factors, multimorbidity and presence of cardiometabolic conditions, and was absent when excluding incident diabetes.",
            "cite_spans": [],
            "ref_spans": [],
            "section": "Abstract"
        },
        {
            "text": "The totality of the results suggests that good lifestyle and not developing incident diabetes may lessen risks of severe infections in people with a strong family of diabetes.",
            "cite_spans": [],
            "ref_spans": [],
            "section": "Abstract"
        },
        {
            "text": "diabetes, family history, lifestyle, SARS-CoV-2 [Correction added on 14 August 2021 after first online publication: Additional funding information has been added]",
            "cite_spans": [],
            "ref_spans": [],
            "section": "Abstract"
        }
    ],
    "body_text": [
        {
            "text": "People with existing health conditions are at higher risk of SARS-CoV-2 infection 1 and related mortality, including people with diabetes. 2 A meta-analysis from 30 different studies found more than twice higher risk of SARS-CoV-2 disease and mortality among patients with diabetes. 3 Family history (parental or sibling) of diabetes is a strong risk factor for type 2 diabetes, with stronger familiality (ie >one family member affected) being associated with higher risk. 4, 5 Previous research has suggested that in addition to genetic risk, lifestyle-related factors such as adiposity and dietary habits may explain some of this observed association. 4, 5 The risk for SARS-CoV-2 infection and poor outcomes among those with family history of diabetes has not been previously investigated. Given the current uncertainty about the course and duration of the pandemic continues, and the prevalence of diabetes in many populations worldwide, the role of whether family history of diabetes in predisposition to damaging SARS-CoV-2 outcomes is important to know as diabetes can be prevented. We investigated the association of family history of diabetes with the risk of developing SARS-CoV-2 and severe SARS-CoV-2, and the potential role of demographic and lifestyle factors in such a link.",
            "cite_spans": [
                {
                    "start": 139,
                    "end": 140,
                    "text": "2",
                    "ref_id": "BIBREF1"
                },
                {
                    "start": 283,
                    "end": 284,
                    "text": "3",
                    "ref_id": "BIBREF2"
                },
                {
                    "start": 473,
                    "end": 475,
                    "text": "4,",
                    "ref_id": "BIBREF3"
                },
                {
                    "start": 476,
                    "end": 477,
                    "text": "5",
                    "ref_id": "BIBREF4"
                },
                {
                    "start": 654,
                    "end": 656,
                    "text": "4,",
                    "ref_id": "BIBREF3"
                },
                {
                    "start": 657,
                    "end": 658,
                    "text": "5",
                    "ref_id": "BIBREF4"
                }
            ],
            "ref_spans": [],
            "section": "| INTRODUC TI ON"
        },
        {
            "text": "This study was conducted as part of UK Biobank project number 14151 and is covered by the generic ethics approval for UK Biobank studies from the NHS National Research Ethics Service (16/ NW/0274). All participants gave written informed consent before enrolment in the study, which was conducted in accordance with the principles of the Declaration of Helsinki. ",
            "cite_spans": [],
            "ref_spans": [],
            "section": "| Ethical approval"
        },
        {
            "text": "Family history of diabetes (mother/father/sibling) was reported at the time of recruitment and categorized into none, one, or two or more, according to the number of family members with a history of diabetes.",
            "cite_spans": [],
            "ref_spans": [],
            "section": "| Exposure variable"
        },
        {
            "text": "Confirmed SARS-CoV-2 infection (≥one positive result) and severe SARS-CoV-2 infection (defined as testing positive during an inpatient hospital episode).",
            "cite_spans": [],
            "ref_spans": [],
            "section": "| Outcome variables"
        },
        {
            "text": "Age at recruitment was used as a continuous variable. Sex and ethnicity (categorized into 'Asian or Asian British', 'Black or Black British', 'Chinese', 'Mixed', 'Other ethnic group' or 'White' groups) were used as categorical variables. Townsend score, a measure of socioeconomic status based on participant postcode, was used as a continuous score. 6 Smoking status self-reported at the time of UKB study recruitment was categorized as never, previous or current.",
            "cite_spans": [
                {
                    "start": 351,
                    "end": 352,
                    "text": "6",
                    "ref_id": null
                }
            ],
            "ref_spans": [],
            "section": "| Sociodemographics, lifestyle and underlying health conditions"
        },
        {
            "text": "Body mass index (BMI) was measured by a study nurse at the time of UKB study recruitment and used as a continuous variable. Level of physical activity was defined as 'none', 'low', 'medium' or 'high' ",
            "cite_spans": [],
            "ref_spans": [],
            "section": "| Sociodemographics, lifestyle and underlying health conditions"
        },
        {
            "text": "We used Poisson regression models with robust standard errors to test for cross-sectional associations between family history of diabetes and SARS-CoV-2 infection or severe SARS-CoV-2. Unadjusted estimates were presented followed by stepwise adjustments. The models were first adjusted for sociodemographic variables (age, sex, Townsend score and ethnicity), then for lifestyle variables (smoking status, BMI and physical activity levels), and finally for presence of cardiovascular conditions at the time of study recruitment (hypertension, ischaemic heart disease and stroke), incident admissions for cardiometabolic conditions (hypertension, diabetes, ischaemic heart disease and stroke) and multimorbidity count.",
            "cite_spans": [],
            "ref_spans": [],
            "section": "| Statistical analysis"
        },
        {
            "text": "The main analysis was repeated for the subset of participants who were tested positive for SARS-CoV-2, with the risk of severe SARS-CoV-2 as the outcome variable. The above analysis was also repeated after excluding participants who were diagnosed with diabetes (based on hospitalization records) since the study recruitment to the onset of COVID pandemic.",
            "cite_spans": [],
            "ref_spans": [],
            "section": "| Sensitivity analysis"
        },
        {
            "text": "All analyses were carried out using R version 3.6.1, using the 'glm' function and 'quasipoisson' formula.",
            "cite_spans": [],
            "ref_spans": [],
            "section": "| Sensitivity analysis"
        },
        {
            "text": "After exclusions noted above, 401,268 were included for analyses (please see Figure 1 ). On recruitment, 70,427 participants (17.5%) reported having one family member with diabetes, and 12,443 (3.1%) reported having two or more family members with diabetes (Table 1 ).",
            "cite_spans": [],
            "ref_spans": [
                {
                    "start": 77,
                    "end": 85,
                    "text": "Figure 1",
                    "ref_id": null
                },
                {
                    "start": 257,
                    "end": 265,
                    "text": "(Table 1",
                    "ref_id": null
                }
            ],
            "section": "| RE SULTS"
        },
        {
            "text": "In total, 13,331 (3.32%) tested positive for SARS-CoV-2 and 2282 (0.6%) participants had severe SARS-CoV-2 (ie infection detected in hospital or through death). The proportion of study sample testing positive of SARS-CoV-2 infection was 3.2%, 3.65% and 4.33% respectively for those with no, one and two or more family members with diabetes. Participants with at least one family member with diabetes had higher average HbA1c than participants with no family history (see Table 1 ). In the unadjusted model, participants with two or more family members with diabetes were more likely to test positive for SARS-CoV-2 infection (risk ratio (RR) 1 Table 2 shows the results of association between family history of diabetes and risk of severe SARS-CoV-2 only for the subset of participants who were tested positive for SARS-CoV-2. The results",
            "cite_spans": [
                {
                    "start": 642,
                    "end": 643,
                    "text": "1",
                    "ref_id": "BIBREF0"
                }
            ],
            "ref_spans": [
                {
                    "start": 471,
                    "end": 478,
                    "text": "Table 1",
                    "ref_id": null
                },
                {
                    "start": 644,
                    "end": 651,
                    "text": "Table 2",
                    "ref_id": null
                }
            ],
            "section": "| RE SULTS"
        },
        {
            "text": "show that there was no significant association between family history of diabetes and severe SARS-CoV-2 in the subset who tested positive. Table 3 shows the results of sensitivity analysis after excluding participants who were diagnosed with diabetes (based on hospitalization records) since the study recruitment to the onset of COVID pandemic. In the sensitivity analysis, there was significant association between family history of diabetes and testing positive for SARS-CoV-2 infection; however, risk was attenuated after adjusting for demographics, lifestyle factors and underlying health. In this group, there was no association between family history of diabetes of severe COVID-19 infections.",
            "cite_spans": [],
            "ref_spans": [
                {
                    "start": 139,
                    "end": 146,
                    "text": "Table 3",
                    "ref_id": null
                }
            ],
            "section": "| Sensitivity analysis"
        },
        {
            "text": "Given diabetes is a strong prognostic factor for SARS-CoV-2 severity and mortality, 9 relatives of such patients may be rightly concerned that they are also at higher risk. The present analyses have shown this to be the case with a 35% higher chance of a positive SARS-CoV-2 test and a 30% higher chance of severe SARS-CoV-2 infection in those with two first-degree relatives with diabetes.",
            "cite_spans": [],
            "ref_spans": [],
            "section": "| DISCUSS ION"
        },
        {
            "text": "However, it appears as if this risk may be mitigated by better lifestyles which also lessen the risk of comorbidity. Lifestyle factors such as smoking, BMI and physical activity are likely to influence the risk of COVID-19 and/or associated complications as evidenced by previous studies. A separate study using UK Biobank data found higher risk of severe SARS-CoV-2 with physical inactivity, smoking and obesity but not heavy alcohol consumption. 10 In addition, relationship between unhealthy lifestyle and severe disease risk was dose dependent. Another study by the COVID-19 host genetics initiative found similar association between high BMI, smoking and physical activity and higher risk severe COVID-19 illness using mendelian randomization approach. 11 Hopkinson et al. found that people who smoke were at higher risk of developing symptomatic COIVD-19, based on data from 2.4 million UK users of the Zoe COVID-19 symptom study. 12 A study in United States found that patients with COVID-19 who were physically inactive had a higher risk of hospitalization, ICU admission and mortality, with some evidence of dose-response relationship. 13 We accept some limitations. UK Biobank participants are relatively healthier and more affluent than general UK population although there is some evidence that risk factor associations with health outcomes are generalizable. 14 The work did not differentiate Also, we could not fully adjust for all incident diabetes; only admissions for diabetes were adjusted for. In addition, information on lifestyle and underlying health was based on self-report and these data were collected more than 10 years ago. During the early study period of the 'first wave' of the outbreak in England, SARS-CoV-2 testing was highly selective and limited to only those participants who presented with severe symptoms. There was no association found between family history of diabetes and severe SARS-CoV-2 risk when analysis was limited to those who tested positive to reduce the bias due to selective testing. That said, this sensitivity analysis by no means excludes bias as those initially tested for SARS-CoV-2",
            "cite_spans": [
                {
                    "start": 448,
                    "end": 450,
                    "text": "10",
                    "ref_id": "BIBREF9"
                },
                {
                    "start": 758,
                    "end": 760,
                    "text": "11",
                    "ref_id": "BIBREF10"
                },
                {
                    "start": 937,
                    "end": 939,
                    "text": "12",
                    "ref_id": "BIBREF11"
                },
                {
                    "start": 1145,
                    "end": 1147,
                    "text": "13",
                    "ref_id": "BIBREF12"
                }
            ],
            "ref_spans": [],
            "section": "| DISCUSS ION"
        },
        {
            "text": "in the UK had more severe symptoms and it is impossible to ascer- Severe SARS-CoV-2 defined as participants who tested positive during an inpatient hospital episode.",
            "cite_spans": [],
            "ref_spans": [],
            "section": "| DISCUSS ION"
        },
        {
            "text": "Results in bold suggest statistical significance (p < 0.05).",
            "cite_spans": [],
            "ref_spans": [],
            "section": "| DISCUSS ION"
        }
    ],
    "bib_entries": {
        "BIBREF0": {
            "ref_id": "b0",
            "title": "polypharmacy, and COVID-19 infection within the UK Biobank cohort",
            "authors": [
                {
                    "first": "R",
                    "middle": [],
                    "last": "Mcqueenie",
                    "suffix": ""
                },
                {
                    "first": "Hme",
                    "middle": [],
                    "last": "Foster",
                    "suffix": ""
                },
                {
                    "first": "B",
                    "middle": [
                        "D"
                    ],
                    "last": "Jani",
                    "suffix": ""
                }
            ],
            "year": 2020,
            "venue": "PLoS One",
            "volume": "15",
            "issn": "8",
            "pages": "",
            "other_ids": {
                "DOI": [
                    "10.1371/journal.pone.0238091"
                ]
            }
        },
        "BIBREF1": {
            "ref_id": "b1",
            "title": "Factors associated with COVID-19-related death using OpenSAFELY",
            "authors": [
                {
                    "first": "E",
                    "middle": [
                        "J"
                    ],
                    "last": "Williamson",
                    "suffix": ""
                },
                {
                    "first": "A",
                    "middle": [
                        "J"
                    ],
                    "last": "Walker",
                    "suffix": ""
                },
                {
                    "first": "K",
                    "middle": [],
                    "last": "Bhaskaran",
                    "suffix": ""
                }
            ],
            "year": 2020,
            "venue": "Nature",
            "volume": "584",
            "issn": "",
            "pages": "430--436",
            "other_ids": {
                "DOI": [
                    "10.1038/s41586-020-2521-4"
                ]
            }
        },
        "BIBREF2": {
            "ref_id": "b2",
            "title": "Diabetes mellitus is associated with increased mortality and severity of disease in COVID-19 pneumonia-A systematic review, meta-analysis, and meta-regression: diabetes and COVID-19",
            "authors": [
                {
                    "first": "I",
                    "middle": [],
                    "last": "Huang",
                    "suffix": ""
                },
                {
                    "first": "Mma",
                    "middle": [],
                    "last": "Lim",
                    "suffix": ""
                },
                {
                    "first": "R",
                    "middle": [],
                    "last": "Pranata",
                    "suffix": ""
                }
            ],
            "year": 2020,
            "venue": "Diabetes Metab Syndr Clin Res Rev",
            "volume": "14",
            "issn": "4",
            "pages": "395--403",
            "other_ids": {
                "DOI": [
                    "10.1016/j.dsx.2020.04.018"
                ]
            }
        },
        "BIBREF3": {
            "ref_id": "b3",
            "title": "Role of adiposity and lifestyle in the relationship between family history of diabetes and 20-year incidence of type 2 diabetes in U.S. women. Diabetes Care",
            "authors": [
                {
                    "first": "E",
                    "middle": [],
                    "last": "Van &apos;t Riet",
                    "suffix": ""
                },
                {
                    "first": "J",
                    "middle": [],
                    "last": "Dekker",
                    "suffix": ""
                },
                {
                    "first": "Q",
                    "middle": [],
                    "last": "Sun",
                    "suffix": ""
                },
                {
                    "first": "G",
                    "middle": [],
                    "last": "Nijpels",
                    "suffix": ""
                },
                {
                    "first": "",
                    "middle": [],
                    "last": "Hu F B, Van Dam R M",
                    "suffix": ""
                }
            ],
            "year": 2010,
            "venue": "",
            "volume": "33",
            "issn": "",
            "pages": "763--767",
            "other_ids": {
                "DOI": [
                    "10.2337/dc09-1586"
                ]
            }
        },
        "BIBREF4": {
            "ref_id": "b4",
            "title": "The link between family history and risk of type 2 diabetes is not explained by anthropometric, lifestyle or genetic risk factors: the EPIC-InterAct study",
            "authors": [
                {
                    "first": "R",
                    "middle": [
                        "A"
                    ],
                    "last": "Scott",
                    "suffix": ""
                },
                {
                    "first": "C",
                    "middle": [],
                    "last": "Langenberg",
                    "suffix": ""
                },
                {
                    "first": "S",
                    "middle": [
                        "J"
                    ],
                    "last": "Sharp",
                    "suffix": ""
                }
            ],
            "year": 2013,
            "venue": "Diabetologia",
            "volume": "56",
            "issn": "1",
            "pages": "60--69",
            "other_ids": {
                "DOI": [
                    "10.1007/s00125-012-2715-x"
                ]
            }
        },
        "BIBREF6": {
            "ref_id": "b6",
            "title": "Multimorbidity and comorbidity in atrial fibrillation and effects on survival: findings from UK Biobank cohort",
            "authors": [
                {
                    "first": "B",
                    "middle": [
                        "D"
                    ],
                    "last": "Jani",
                    "suffix": ""
                },
                {
                    "first": "B",
                    "middle": [
                        "I"
                    ],
                    "last": "Nicholl",
                    "suffix": ""
                },
                {
                    "first": "R",
                    "middle": [],
                    "last": "Mcqueenie",
                    "suffix": ""
                }
            ],
            "year": 2018,
            "venue": "EP Eur",
            "volume": "20",
            "issn": "FI_3",
            "pages": "329--336",
            "other_ids": {
                "DOI": [
                    "10.1093/europace/eux322"
                ]
            }
        },
        "BIBREF7": {
            "ref_id": "b7",
            "title": "Relationship between multimorbidity, demographic factors and mortality: findings from the UK Biobank cohort",
            "authors": [
                {
                    "first": "B",
                    "middle": [
                        "D"
                    ],
                    "last": "Jani",
                    "suffix": ""
                },
                {
                    "first": "P",
                    "middle": [],
                    "last": "Hanlon",
                    "suffix": ""
                },
                {
                    "first": "B",
                    "middle": [
                        "I"
                    ],
                    "last": "Nicholl",
                    "suffix": ""
                }
            ],
            "year": 2019,
            "venue": "BMC Med",
            "volume": "17",
            "issn": "1",
            "pages": "",
            "other_ids": {
                "DOI": [
                    "10.1186/s12916-019-1305-x"
                ]
            }
        },
        "BIBREF8": {
            "ref_id": "b8",
            "title": "Associations of type 1 and type 2 diabetes with COVID-19-related mortality in England: a wholepopulation study",
            "authors": [
                {
                    "first": "E",
                    "middle": [],
                    "last": "Barron",
                    "suffix": ""
                },
                {
                    "first": "C",
                    "middle": [],
                    "last": "Bakhai",
                    "suffix": ""
                },
                {
                    "first": "P",
                    "middle": [],
                    "last": "Kar",
                    "suffix": ""
                }
            ],
            "year": 2020,
            "venue": "Lancet Diabetes Endocrinol",
            "volume": "8",
            "issn": "10",
            "pages": "30272--30274",
            "other_ids": {
                "DOI": [
                    "10.1016/S2213-8587(20)30272-2"
                ]
            }
        },
        "BIBREF9": {
            "ref_id": "b9",
            "title": "Lifestyle risk factors, inflammatory mechanisms, and COVID-19 hospitalization: a community-based cohort study of 387,109 adults in UK",
            "authors": [
                {
                    "first": "M",
                    "middle": [],
                    "last": "Hamer",
                    "suffix": ""
                },
                {
                    "first": "M",
                    "middle": [],
                    "last": "Kivimäki",
                    "suffix": ""
                },
                {
                    "first": "C",
                    "middle": [
                        "R"
                    ],
                    "last": "Gale",
                    "suffix": ""
                },
                {
                    "first": "G",
                    "middle": [
                        "D"
                    ],
                    "last": "Batty",
                    "suffix": ""
                }
            ],
            "year": 2020,
            "venue": "Brain Behav Immun",
            "volume": "87",
            "issn": "",
            "pages": "184--187",
            "other_ids": {
                "DOI": [
                    "10.1016/j.bbi.2020.05.059"
                ]
            }
        },
        "BIBREF10": {
            "ref_id": "b10",
            "title": "Modifiable lifestyle factors and severe COVID-19 risk: a Mendelian randomisation study",
            "authors": [
                {
                    "first": "S",
                    "middle": [],
                    "last": "Li",
                    "suffix": ""
                },
                {
                    "first": "X",
                    "middle": [],
                    "last": "Hua",
                    "suffix": ""
                }
            ],
            "year": 2021,
            "venue": "BMC Med Genomics",
            "volume": "14",
            "issn": "1",
            "pages": "",
            "other_ids": {
                "DOI": [
                    "10.1186/s12920-021-00887-1"
                ]
            }
        },
        "BIBREF11": {
            "ref_id": "b11",
            "title": "Current smoking and COVID-19 risk: results from a population symptom app in over 2.4 million people",
            "authors": [
                {
                    "first": "N",
                    "middle": [
                        "S"
                    ],
                    "last": "Hopkinson",
                    "suffix": ""
                },
                {
                    "first": "N",
                    "middle": [],
                    "last": "Rossi",
                    "suffix": ""
                },
                {
                    "first": "J",
                    "middle": [],
                    "last": "El-Sayed-Moustafa",
                    "suffix": ""
                }
            ],
            "year": 2021,
            "venue": "Thorax",
            "volume": "76",
            "issn": "7",
            "pages": "714--722",
            "other_ids": {
                "DOI": [
                    "10.1136/thoraxjnl-2020-216422"
                ]
            }
        },
        "BIBREF12": {
            "ref_id": "b12",
            "title": "Physical inactivity is associated with a higher risk for severe COVID-19 outcomes: a study in 48 440 adult patients",
            "authors": [
                {
                    "first": "R",
                    "middle": [],
                    "last": "Sallis",
                    "suffix": ""
                },
                {
                    "first": "D",
                    "middle": [
                        "R"
                    ],
                    "last": "Young",
                    "suffix": ""
                },
                {
                    "first": "S",
                    "middle": [
                        "Y"
                    ],
                    "last": "Tartof",
                    "suffix": ""
                }
            ],
            "year": 2021,
            "venue": "Br J Sports Med",
            "volume": "",
            "issn": "",
            "pages": "",
            "other_ids": {
                "DOI": [
                    "10.1136/bjsports-2021-104080"
                ]
            }
        },
        "BIBREF13": {
            "ref_id": "b13",
            "title": "Comparison of risk factor associations in UK Biobank against representative, general population based studies with conventional response rates: prospective cohort study and individual participant meta-analysis",
            "authors": [
                {
                    "first": "G",
                    "middle": [
                        "D"
                    ],
                    "last": "Batty",
                    "suffix": ""
                },
                {
                    "first": "C",
                    "middle": [
                        "R"
                    ],
                    "last": "Gale",
                    "suffix": ""
                },
                {
                    "first": "M",
                    "middle": [],
                    "last": "Kivimäki",
                    "suffix": ""
                },
                {
                    "first": "I",
                    "middle": [
                        "J"
                    ],
                    "last": "Deary",
                    "suffix": ""
                },
                {
                    "first": "S",
                    "middle": [],
                    "last": "Bell",
                    "suffix": ""
                }
            ],
            "year": 2020,
            "venue": "BMJ",
            "volume": "368",
            "issn": "",
            "pages": "",
            "other_ids": {
                "DOI": [
                    "10.1136/bmj.m131"
                ]
            }
        },
        "BIBREF14": {
            "ref_id": "b14",
            "title": "Excess weight and COVID-19: insights from new evidence",
            "authors": [
                {
                    "first": "Public",
                    "middle": [],
                    "last": "Health England",
                    "suffix": ""
                }
            ],
            "year": 2020,
            "venue": "",
            "volume": "",
            "issn": "",
            "pages": "",
            "other_ids": {}
        },
        "BIBREF15": {
            "ref_id": "b15",
            "title": "Family history of diabetes and risk of SARS-COV-2 in UK Biobank: A prospective cohort study",
            "authors": [
                {
                    "first": "B",
                    "middle": [
                        "D"
                    ],
                    "last": "Jani",
                    "suffix": ""
                },
                {
                    "first": "B",
                    "middle": [
                        "I"
                    ],
                    "last": "Nicholl",
                    "suffix": ""
                },
                {
                    "first": "P",
                    "middle": [],
                    "last": "Hanlon",
                    "suffix": ""
                }
            ],
            "year": 2021,
            "venue": "Endocrinol Diab Metab",
            "volume": "00",
            "issn": "",
            "pages": "",
            "other_ids": {
                "DOI": [
                    "10.1002/edm2.283"
                ]
            }
        }
    },
    "ref_entries": {
        "FIGREF0": {
            "text": "using Metabolic Equivalent of Task (MET) minutes per week scores based on the International Physical Activity Questionnaire (IPAQ) scoring protocol 2005. The physical and mental health conditions self-reported by participants at the time of UKB study recruitment were organized into a list of 43 long-term conditions (LTCs) based on our previously published literature. 7,8 Multimorbidity count was classified by LTC count into 0, 1, 2, 3 or ≥4. Presence of four cardiometabolic conditions (hypertension, diabetes, ischaemic heart disease and stroke) was ascertained via participant self-report at the time of UKB study recruitment or hospitalization event (between UKB study recruitment to April 2019) with ICD-10 codes as primary or secondary discharge diagnoses (incident).",
            "latex": null,
            "type": "figure"
        },
        "FIGREF1": {
            "text": "I G U R E 1 Flow chart of study participants. *Incident diabetes, participants who were diagnosed with diabetes (based on hospitalization records) since the study recruitment to the onset of COVID pandemic; UKB, UK Biobank TA B L E 1 Family history (none/one/two or more) of diabetes and risk of SARS-CoV-2 infection/severity in UK Biobank. Model 1: Adjusted for age, sex, deprivation score and ethnicity; Model 2: Adjusted for model 1 plus body mass index, physical activity levels and smoking; Model 3: Adjusted for model 2 plus multimorbidity count and presence of diabetes (incident), hypertension (baseline and incident), stroke (baseline and incident), ischaemic heart disease (baseline and incident). Abbreviuations: CI, confidence intervals; RR, risk ratio; SD, standard deviation.a Participants who died before the onset of SARS-CoV-2 pandemic and those who reported having diabetes at baseline were excluded.bSevere SARS-CoV-2 defined as participants who tested positive during an inpatient hospital episode.Results in bold suggest statistical significance (p < 0.05).",
            "latex": null,
            "type": "figure"
        },
        "FIGREF2": {
            "text": "between type 1 and type 2 diabetes, though most with two family members are likely to have Type 2 diabetes. The data on family history of diabetes and lifestyle behaviour were collected at the time of study recruitment (2006-2010) and have not been updated since.",
            "latex": null,
            "type": "figure"
        },
        "FIGREF3": {
            "text": "tain whether viral loads (and so symptoms and testing) differed dependent on family history of diabetes. Of course, other unmeasured factors could also have biased the chances of testing. Therefore, we believe our main findings hold relevance to those with family histories of diabetes.The association of being SARS-CoV-2 positive with family history of diabetes may partially reflect both a strong association between excess body weight and SARS-CoV-2 infection or related mortality (as recently summarized in a UK Governmental report)15 and the strong social factors (ie lower socioeconomic status) linked to SARS-CoV-2 infection that overlap with diabetes risk. The risk attenuation after adjustment for lifestyle factors provides some reassurance that healthy lifestyle may not only attenuate risk of diabetes in those with strong family histories but may also attenuate risk of SARS-CoV-2 disease and severe complications. The sensitivity analyses also point in similar direction. However, this attenuation in risk is likely related to lifestyle over many years and so our findings do not necessarily demonstrate that short-term change in lifestyle would immediately alter the risk of SARS-CoV-2 infection, although such short-term changes can prevent diabetes. Our findings may stimulate those with diabetes family histories to take more interest in preventive efforts. TA B L E 2 Sensitivity Analysis: Family history (none/one/two or more) of diabetes and risk of SARS-CoV-2 severity in UK Biobank in subset of participants who were positive for SARS-CoV-2. N = 13331",
            "latex": null,
            "type": "figure"
        },
        "FIGREF4": {
            "text": "Model 1: Adjusted for age, sex, deprivation score and ethnicity; Model 2: Adjusted for model 1 plus body mass index, physical activity levels and smoking; Model 3: Adjusted for model 2 plus multimorbidity count and presence of hypertension (baseline and incident), stroke (baseline and incident), ischaemic heart disease (baseline and incident).Abbreviations: CI, confidence intervals; RR, risk ratio; SD, standard deviation a Participants who died before the onset of SARS-CoV-2 pandemic and those who reported having diabetes at baseline and incident were excluded.b",
            "latex": null,
            "type": "figure"
        },
        "TABREF0": {
            "text": "We used data from UK Biobank (UKB), a longitudinal cohort of 502,503 participants aged 37-73 recruited from the general population in England, Wales and Scotland between 2006 and 2010. SARS-CoV-2 test samples were collected and processed between 16th March 2020 and 31st January 2021. SARS-CoV-2 test results were provided by Public Health England (http:// bioba nk.ndph.ox.ac.uk/ukb/exinfo.cgi?src= COVID 19_tests).Participants who had died prior to the SARS-CoV-2 outbreak in the UK (01/03/2020) and who reported diabetes at the time of UKB study recruitment were excluded. Data were only available for participants in England. During the early study period of the 'first wave' of the outbreak in England, SARS-CoV-2 testing was highly selective and limited to only those participants who presented with severe symptoms.",
            "latex": null,
            "type": "table"
        },
        "TABREF1": {
            "text": ".35; 95% confidence intervals (CI) 1.24-1.47) and have severe infection (RR 1.30; 95% CI 1.04-1.59) than participants with no family history. The association with risk of testing positive was attenuated after adjusting for sociodemographics (RR 1.17; 95 CI 1.07-1.27), and additionally for lifestyle factors (RR 1.11; 95% CI 1.02-1.21) and multimorbidity (RR 1.10; 95% 1.00-1.19). (Table 1). The proportion of the study sample with severe SARS-CoV-2 was 0.56%, 0.60% and 0.72% respectively for those with no, one and two or more family members with diabetes. Participants with two or more family members with diabetes were more likely to have severe SARS-CoV-2 infection (RR 1.30; 95% CI 1.04-1.59) in unadjusted model. The association was no longer significant after adjusting for demographics, lifestyle factors and underlying health.",
            "latex": null,
            "type": "table"
        },
        "TABREF2": {
            "text": "Note: Model 1: Adjusted for age, sex, deprivation score and ethnicity; Model 2: Adjusted for model 1 plus body mass index, physical activity levels and smoking; Model 3: Adjusted for model 2 plus multimorbidity count and presence of diabetes (incident), hypertension (baseline and incident), stroke (baseline and incident), ischaemic heart disease (baseline and incident). Participants who died before the onset of SARS-CoV-2 pandemic and those who reported having diabetes at baseline were excluded. Abbreviations: CI, confidence intervals; RR, risk ratio; SD, standard deviation.Severe SARS-CoV-2 defined as participants who tested positive during an inpatient hospital episode.Results in bold suggest statistical significance (p TA B L E 3 Sensitivity Analysis: Family history (none/one/two or more) of diabetes and risk of SARS-CoV-2 infection/severity in UK Biobank after excluding those with incident diabetes. N = 392056 a",
            "latex": null,
            "type": "table"
        }
    },
    "back_matter": [
        {
            "text": "The authors would like to thank the participants of UK Biobank and the UK Biobank for access to this data. The authors thank Liz Coyle (University of Glasgow) for assistance with manuscript preparation. ",
            "cite_spans": [],
            "ref_spans": [],
            "section": "ACK N OWLED G EM ENTS"
        },
        {
            "text": "The idea for this paper was generated by NS and BDJ. The analyses were done by BDJ. All other authors gave input to the writing and revision of the manuscript. NS is guarantor, and takes responsibility for the contents of the article.",
            "cite_spans": [],
            "ref_spans": [],
            "section": "AUTH O R CO NTR I B UTI O N S"
        },
        {
            "text": "The data used in this study are available via UK Biobank (https:// www.ukbio bank.ac.uk/), subject to necessary approvals. ",
            "cite_spans": [],
            "ref_spans": [],
            "section": "DATA AVA I L A B I L I T Y S TAT E M E N T"
        }
    ]
}