{
    "paper_id": "0a3a44100c1e70b685497d9e973a963042a80be3",
    "metadata": {
        "title": "B R I E F C O M M U N I C A T I O N Lower seroprevalence for SARS-CoV-2-specific antibodies among kidney transplant recipients compared to the general population in the city of Sao Paulo, Brazil",
        "authors": [
            {
                "first": "Marina",
                "middle": [
                    "P"
                ],
                "last": "Cristelli",
                "suffix": "",
                "affiliation": {
                    "laboratory": "",
                    "institution": "Universidade Federal de São Paulo (UNIFESP)",
                    "location": {
                        "settlement": "São Paulo, Sao Paulo",
                        "country": "Brazil"
                    }
                },
                "email": "ninacristelli@yahoo.com.br"
            },
            {
                "first": "Laila",
                "middle": [
                    "A"
                ],
                "last": "Viana",
                "suffix": "",
                "affiliation": {
                    "laboratory": "",
                    "institution": "Universidade Federal de São Paulo (UNIFESP)",
                    "location": {
                        "settlement": "São Paulo, Sao Paulo",
                        "country": "Brazil"
                    }
                },
                "email": ""
            },
            {
                "first": "Carlos",
                "middle": [
                    "M"
                ],
                "last": "Fortaleza",
                "suffix": "",
                "affiliation": {
                    "laboratory": "",
                    "institution": "Universidade Estadual Paulista (UNESP)",
                    "location": {
                        "settlement": "Botucatu, Sao Paulo",
                        "country": "Brazil"
                    }
                },
                "email": ""
            },
            {
                "first": "Celso",
                "middle": [],
                "last": "Granato",
                "suffix": "",
                "affiliation": {
                    "laboratory": "",
                    "institution": "Universidade Federal de São Paulo (UNIFESP)",
                    "location": {
                        "settlement": "São Paulo, Sao Paulo",
                        "country": "Brazil"
                    }
                },
                "email": ""
            },
            {
                "first": "Monica",
                "middle": [
                    "R"
                ],
                "last": "Nakamura",
                "suffix": "",
                "affiliation": {
                    "laboratory": "",
                    "institution": "Universidade Federal de São Paulo (UNIFESP)",
                    "location": {
                        "settlement": "São Paulo, Sao Paulo",
                        "country": "Brazil"
                    }
                },
                "email": ""
            },
            {
                "first": "Daniel",
                "middle": [
                    "W C L"
                ],
                "last": "Santos",
                "suffix": "",
                "affiliation": {
                    "laboratory": "",
                    "institution": "Universidade Federal de São Paulo (UNIFESP)",
                    "location": {
                        "settlement": "São Paulo, Sao Paulo",
                        "country": "Brazil"
                    }
                },
                "email": ""
            },
            {
                "first": "Renato",
                "middle": [
                    "Demarchi"
                ],
                "last": "Foresto",
                "suffix": "",
                "affiliation": {
                    "laboratory": "",
                    "institution": "Universidade Federal de São Paulo (UNIFESP)",
                    "location": {
                        "settlement": "São Paulo, Sao Paulo",
                        "country": "Brazil"
                    }
                },
                "email": ""
            },
            {
                "first": "Helio",
                "middle": [],
                "last": "Tedesco-Silva",
                "suffix": "",
                "affiliation": {
                    "laboratory": "",
                    "institution": "Universidade Federal de São Paulo (UNIFESP)",
                    "location": {
                        "settlement": "São Paulo, Sao Paulo",
                        "country": "Brazil"
                    }
                },
                "email": ""
            },
            {
                "first": "Jose",
                "middle": [],
                "last": "Medina-Pestana",
                "suffix": "",
                "affiliation": {
                    "laboratory": "",
                    "institution": "Universidade Federal de São Paulo (UNIFESP)",
                    "location": {
                        "settlement": "São Paulo, Sao Paulo",
                        "country": "Brazil"
                    }
                },
                "email": ""
            }
        ]
    },
    "abstract": [
        {
            "text": "Background: Kidney transplant recipients have higher COVID-19 associated mortality compared to the general population. However, as only symptomatic patients seek medical attention, the current level of exposure, the main sources of acquisition, and the behavior of humoral immunity over time are poorly understood.",
            "cite_spans": [],
            "ref_spans": [],
            "section": "Abstract"
        },
        {
            "text": "This cross-sectional prospective single-center study recruited kidney transplant recipients of any age living in Sao Paulo. A sample size of 401 patients was calculated considering the 17.2% seroprevalence in the municipality population from a published survey, a 95% confidence interval and an absolute error of 2%.",
            "cite_spans": [],
            "ref_spans": [],
            "section": "Abstract"
        },
        {
            "text": "Of the 2636 eligible patients, 416 were included. The seroprevalence for IgG anti-SARS-CoV-2 was 8.2%. Seroconversion rate decreased with increasing age, from 15.7% (18-35 years) to 8.3% (36-60 years) and 4.2% (>60 years, p = 0.042). Seropositivity among previously confirmed COVID-19 patients was 68.4%, followed by 9.4% in those with flu-like symptoms and only 4.6% among asymptomatic patients (p < 0.0001).",
            "cite_spans": [],
            "ref_spans": [],
            "section": "Abstract"
        },
        {
            "text": "Seroprevalence was significantly higher among patients reporting household contact (p = 0.018). Twenty-seven from the 34 IgG+ patients had a second test after 59 (IQR 50-63) days, and, in 33%, the IgG index became below the positivity threshold.",
            "cite_spans": [],
            "ref_spans": [],
            "section": "Abstract"
        },
        {
            "text": "In this cohort of kidney transplant recipients, the seroprevalence for IgG anti-SARS-CoV-2 was lower than that of the general population, decreased with ageing, and was associated with household contacts. In a considerable proportion of the patients, there was a significant decay in the IgG levels in a short period of time. Therefore, preventive strategies, such as prioritization for vaccination, should be urgently considered.",
            "cite_spans": [],
            "ref_spans": [],
            "section": "Abstract"
        }
    ],
    "body_text": [
        {
            "text": "Population-based data on the seroprevalence of antibodies against severe acute respiratory syndrome coronavirus 2 (SARS-CoV-2) are now available worldwide, showing wide variability depending on age, ethnicity, socio-economic level, geographic region, and timing of the survey during the pandemic. 1, 2 In Brazil, a country with one of the highest number of cases, 3 a large cross-sectional study including more than 30,000 households from 133 sentinel cities in all states, showed an increase in seroprevalence from 1.9% in May to 3.1% in June, 2020. 4 Infection rates are higher among health professionals 2, 5, 6 and younger people due to higher environmental and mobility exposure, respectively. 1, 4 Transplant recipients have a higher COVID-19-associated mortality compared to the general population. [7] [8] [9] Yet, because only symptomatic patients seek health-care assistance, the actual level of exposure is not known. Whether routine and unscheduled medical visits to transplant centers increase the risk of infection, compared to the general population, is still unknown.",
            "cite_spans": [
                {
                    "start": 297,
                    "end": 299,
                    "text": "1,",
                    "ref_id": "BIBREF3"
                },
                {
                    "start": 300,
                    "end": 301,
                    "text": "2",
                    "ref_id": "BIBREF4"
                },
                {
                    "start": 364,
                    "end": 365,
                    "text": "3",
                    "ref_id": "BIBREF5"
                },
                {
                    "start": 551,
                    "end": 552,
                    "text": "4",
                    "ref_id": "BIBREF6"
                },
                {
                    "start": 607,
                    "end": 609,
                    "text": "2,",
                    "ref_id": "BIBREF4"
                },
                {
                    "start": 610,
                    "end": 612,
                    "text": "5,",
                    "ref_id": "BIBREF7"
                },
                {
                    "start": 613,
                    "end": 614,
                    "text": "6",
                    "ref_id": "BIBREF8"
                },
                {
                    "start": 699,
                    "end": 701,
                    "text": "1,",
                    "ref_id": "BIBREF3"
                },
                {
                    "start": 702,
                    "end": 703,
                    "text": "4",
                    "ref_id": "BIBREF6"
                },
                {
                    "start": 806,
                    "end": 809,
                    "text": "[7]",
                    "ref_id": "BIBREF9"
                },
                {
                    "start": 810,
                    "end": 813,
                    "text": "[8]",
                    "ref_id": "BIBREF10"
                },
                {
                    "start": 814,
                    "end": 817,
                    "text": "[9]",
                    "ref_id": "BIBREF11"
                }
            ],
            "ref_spans": [],
            "section": "INTRODUCTION"
        },
        {
            "text": "In Sao Paulo, a city with more than 12 million inhabitants (8, 407, 202 inhabitants aged 18 or over) and a population density of 8,054/kmš, a serosurvey with six phases was established to estimate the percentage of adults infected by SARS-CoV-2. Seroprevalence increased from 11.5% in June (15th to 24th) to 17.9% in July (20th to 29th), and to 26.2% in October (1st to 10th) 2020. 10 Therefore, we sought to determine and compare the seroprevalence for SARS-CoV-2 among kidney transplant recipients living in the city taking advantage of this survey in the general population. We also explored the risk factors associated with the presence of a positive IgG serology and the antibodies titers in a follow up samples two months apart.",
            "cite_spans": [
                {
                    "start": 59,
                    "end": 62,
                    "text": "(8,",
                    "ref_id": "BIBREF10"
                },
                {
                    "start": 63,
                    "end": 67,
                    "text": "407,",
                    "ref_id": null
                },
                {
                    "start": 68,
                    "end": 71,
                    "text": "202",
                    "ref_id": null
                },
                {
                    "start": 382,
                    "end": 384,
                    "text": "10",
                    "ref_id": "BIBREF12"
                }
            ],
            "ref_spans": [],
            "section": "INTRODUCTION"
        },
        {
            "text": "This was a cross-sectional prospective single-center study. ",
            "cite_spans": [],
            "ref_spans": [],
            "section": "Study design and population"
        },
        {
            "text": "The sample size calculation was performed using the OpenEpi software, version 3.01, considering the total population of eligible patients (n = 2,636) and the 17.2% prevalence of the event of interest (seropositivity) in the general population according to the municipal epidemio-logical survey. 10 With a prespecified confidence interval of 95.0% and an absolute error of 2%, the expected total sample size was 401 people.",
            "cite_spans": [
                {
                    "start": 295,
                    "end": 297,
                    "text": "10",
                    "ref_id": "BIBREF12"
                }
            ],
            "ref_spans": [],
            "section": "Sampling"
        },
        {
            "text": "Of the 2636 kidney transplant recipients eligible for the survey, 19%",
            "cite_spans": [],
            "ref_spans": [],
            "section": "Regional stratification"
        },
        {
            "text": "live in the North, 32% in the South, 3% in the Center, 19% in the East, and 27% in the West region of the city. Since regional differences may influence the degree of exposure to the infection, the study population was constituted to represent the regional distribution of patients.",
            "cite_spans": [],
            "ref_spans": [],
            "section": "Regional stratification"
        },
        {
            "text": "Therefore, all the patients with a scheduled in-person outpatient visit beginning of September 1st, 2020 were screened until a representative sample of each city region was completed, which occurred on 25th of September 2020.",
            "cite_spans": [],
            "ref_spans": [],
            "section": "Regional stratification"
        },
        {
            "text": "All enrolled patients answered a questionnaire containing the follow- Mixed ethnicity refers to people of mixed race between Caucasians and Africans.",
            "cite_spans": [],
            "ref_spans": [],
            "section": "Clinical evaluation"
        },
        {
            "text": "The presence of anti-SARS-CoV-2 antibodies (IgG) was determined in a serum sample obtained at the scheduled in-person outpatient visit.",
            "cite_spans": [],
            "ref_spans": [],
            "section": "Anti-SARS-CoV-2 antibody testing"
        },
        {
            "text": "Patients with a positive test were invited to provide a follow-up sample two months later to analyze antibody titers decay. Anti-SARS-CoV-2 antibody (IgG) was determined using the Abbott SARS-CoV-2 IgG assay on the Abbott Architect system. The assay is a chemiluminescent microparticle immunoassay for qualitative detection of IgG against the SARS-CoV-2 nucleoprotein. The results were interpreted as positive according to the manufacturer's instructions with a cut-off antibody index of 1.68 arbitrary units.",
            "cite_spans": [],
            "ref_spans": [],
            "section": "Anti-SARS-CoV-2 antibody testing"
        },
        {
            "text": "Continuous variables were presented as median and interquartile ranges (IQR). Comparisons were made using the non-parametric were not included in the numerator; therefore, seroprevalence rates are expected to be higher than attack rates. Statistical analysis was performed using the SPSS program v. 22.0 (SPSS Inc., Chicago, IL, USA).",
            "cite_spans": [],
            "ref_spans": [],
            "section": "Statistical analysis"
        },
        {
            "text": "Of the 2636 eligible patients, 552 subjects with a scheduled in-person appointment were screened to construct the representative regional ",
            "cite_spans": [],
            "ref_spans": [],
            "section": "Study cohort"
        },
        {
            "text": "In this cohort (n = 416), the seroprevalence for SARS-CoV-2 infec- ",
            "cite_spans": [],
            "ref_spans": [],
            "section": "Seroprevalence for SARS-CoV-2 infection"
        },
        {
            "text": "Patients showing seroconversion were younger, primarily due to a lower representation of the older than 60 years stratum compared to IgG-patients. There were no differences in gender, ethnicity, and blood type, history of diabetes mellitus, donor type, and time after transplantation. There were also no differences in environmental conditions such as regions of residence, health care profession, and contact tracing. Notably, compared to IgG− patients, a higher proportion of IgG+ patients had previous confirmed SARS-CoV-2 infection (38% vs. 2%, p < 0.0001, Table 1 ). In this cohort of patients, the seroprevalence decreased with increasing age, tendency not observed in the serosurvey conducted in the city of Sao Paulo (seroprevalence randomly ranging from 15.8% to 22% across the age strata). 10 Possible explanations include a selection bias, because older people have higher COVID-19-associated mortality and the relationship between immunosenescence and lower vaccine immune responses. 16 ",
            "cite_spans": [
                {
                    "start": 800,
                    "end": 802,
                    "text": "10",
                    "ref_id": "BIBREF12"
                },
                {
                    "start": 996,
                    "end": 998,
                    "text": "16",
                    "ref_id": "BIBREF17"
                }
            ],
            "ref_spans": [
                {
                    "start": 561,
                    "end": 568,
                    "text": "Table 1",
                    "ref_id": null
                }
            ],
            "section": "Comparison between IgG+ and IgG− patients"
        }
    ],
    "bib_entries": {
        "BIBREF0": {
            "ref_id": "b0",
            "title": "Celso Granato, and Helio Tedesco-Silva analyzed the data. Marina P. Cristelli, Laila A",
            "authors": [
                {
                    "first": "Laila",
                    "middle": [
                        "A"
                    ],
                    "last": "Viana",
                    "suffix": ""
                },
                {
                    "first": "Carlos",
                    "middle": [
                        "M"
                    ],
                    "last": "Fortaleza",
                    "suffix": ""
                }
            ],
            "year": null,
            "venue": "",
            "volume": "",
            "issn": "",
            "pages": "",
            "other_ids": {}
        },
        "BIBREF1": {
            "ref_id": "b1",
            "title": "Silva drafted and revised the paper. All authors approved the final version of the manuscript",
            "authors": [
                {
                    "first": "M",
                    "middle": [],
                    "last": "Fortaleza",
                    "suffix": ""
                },
                {
                    "first": "Helio",
                    "middle": [],
                    "last": "Tedesco",
                    "suffix": ""
                }
            ],
            "year": null,
            "venue": "",
            "volume": "Marina P",
            "issn": "",
            "pages": "",
            "other_ids": {}
        },
        "BIBREF2": {
            "ref_id": "b2",
            "title": "Fortaleza equally contributed to the study",
            "authors": [
                {
                    "first": "Laila",
                    "middle": [
                        "A"
                    ],
                    "last": "Cristelli",
                    "suffix": ""
                },
                {
                    "first": "Carlos",
                    "middle": [
                        "M"
                    ],
                    "last": "Viana",
                    "suffix": ""
                }
            ],
            "year": null,
            "venue": "",
            "volume": "",
            "issn": "",
            "pages": "",
            "other_ids": {}
        },
        "BIBREF3": {
            "ref_id": "b3",
            "title": "Estimated SARS-CoV-2 Seroprevalence in the US as of",
            "authors": [
                {
                    "first": "K",
                    "middle": [
                        "L"
                    ],
                    "last": "Bajema",
                    "suffix": ""
                },
                {
                    "first": "R",
                    "middle": [
                        "E"
                    ],
                    "last": "Wiegand",
                    "suffix": ""
                },
                {
                    "first": "K",
                    "middle": [],
                    "last": "Cuffe",
                    "suffix": ""
                }
            ],
            "year": 2020,
            "venue": "JAMA Intern Med. 2020",
            "volume": "",
            "issn": "",
            "pages": "",
            "other_ids": {}
        },
        "BIBREF4": {
            "ref_id": "b4",
            "title": "Population-based seroprevalence surveys of anti-SARS-CoV-2 antibody: an up-to-date review",
            "authors": [
                {
                    "first": "C",
                    "middle": [
                        "C"
                    ],
                    "last": "Lai",
                    "suffix": ""
                },
                {
                    "first": "J",
                    "middle": [
                        "H"
                    ],
                    "last": "Wang",
                    "suffix": ""
                },
                {
                    "first": "P",
                    "middle": [
                        "R"
                    ],
                    "last": "Hsueh",
                    "suffix": ""
                }
            ],
            "year": 2020,
            "venue": "Int J Infect Dis",
            "volume": "101",
            "issn": "",
            "pages": "314--322",
            "other_ids": {}
        },
        "BIBREF5": {
            "ref_id": "b5",
            "title": "Health Surveillance Secretariat. Ministry of Health of. Coronavirus -COVID-19",
            "authors": [
                {
                    "first": "",
                    "middle": [],
                    "last": "Brazil",
                    "suffix": ""
                },
                {
                    "first": "",
                    "middle": [],
                    "last": "Brazil",
                    "suffix": ""
                }
            ],
            "year": 2021,
            "venue": "",
            "volume": "",
            "issn": "",
            "pages": "",
            "other_ids": {}
        },
        "BIBREF6": {
            "ref_id": "b6",
            "title": "SARS-CoV-2 antibody prevalence in Brazil: results from two successive nationwide serological household surveys",
            "authors": [
                {
                    "first": "P",
                    "middle": [
                        "C"
                    ],
                    "last": "Hallal",
                    "suffix": ""
                },
                {
                    "first": "F",
                    "middle": [
                        "P"
                    ],
                    "last": "Hartwig",
                    "suffix": ""
                },
                {
                    "first": "B",
                    "middle": [
                        "L"
                    ],
                    "last": "Horta",
                    "suffix": ""
                }
            ],
            "year": 2020,
            "venue": "Lancet Glob Health",
            "volume": "8",
            "issn": "11",
            "pages": "1390--1398",
            "other_ids": {}
        },
        "BIBREF7": {
            "ref_id": "b7",
            "title": "Seroprevalence of SARS-CoV-2 among frontline health care personnel in a multistate hospital network -13 Academic Medical Centers",
            "authors": [
                {
                    "first": "W",
                    "middle": [
                        "H"
                    ],
                    "last": "Self",
                    "suffix": ""
                },
                {
                    "first": "M",
                    "middle": [
                        "W"
                    ],
                    "last": "Tenforde",
                    "suffix": ""
                },
                {
                    "first": "W",
                    "middle": [
                        "B"
                    ],
                    "last": "Stubblefield",
                    "suffix": ""
                }
            ],
            "year": 2020,
            "venue": "MMWR Morb Mortal Wkly Rep",
            "volume": "69",
            "issn": "35",
            "pages": "1221--1226",
            "other_ids": {}
        },
        "BIBREF8": {
            "ref_id": "b8",
            "title": "High prevalence of asymptomatic COVID-19 infection in hemodialysis patients detected using serologic screening",
            "authors": [
                {
                    "first": "C",
                    "middle": [],
                    "last": "Clarke",
                    "suffix": ""
                },
                {
                    "first": "M",
                    "middle": [],
                    "last": "Prendecki",
                    "suffix": ""
                },
                {
                    "first": "A",
                    "middle": [],
                    "last": "Dhutia",
                    "suffix": ""
                }
            ],
            "year": 2020,
            "venue": "J Am Soc Nephrol",
            "volume": "31",
            "issn": "9",
            "pages": "1969--1975",
            "other_ids": {}
        },
        "BIBREF9": {
            "ref_id": "b9",
            "title": "COVID-19 and solid organ transplantation: a review article",
            "authors": [
                {
                    "first": "Y",
                    "middle": [],
                    "last": "Azzi",
                    "suffix": ""
                },
                {
                    "first": "R",
                    "middle": [],
                    "last": "Bartash",
                    "suffix": ""
                },
                {
                    "first": "J",
                    "middle": [],
                    "last": "Scalea",
                    "suffix": ""
                },
                {
                    "first": "P",
                    "middle": [],
                    "last": "Loarte-Campos",
                    "suffix": ""
                },
                {
                    "first": "E",
                    "middle": [],
                    "last": "Akalin",
                    "suffix": ""
                }
            ],
            "year": 2021,
            "venue": "Transplantation",
            "volume": "105",
            "issn": "1",
            "pages": "37--55",
            "other_ids": {}
        },
        "BIBREF10": {
            "ref_id": "b10",
            "title": "An initial report from the French SOT COVID Registry suggests high mortality due to Covid-19 in recipients of kidney transplants. Kidney Int",
            "authors": [
                {
                    "first": "S",
                    "middle": [],
                    "last": "Caillard",
                    "suffix": ""
                },
                {
                    "first": "D",
                    "middle": [],
                    "last": "Anglicheau",
                    "suffix": ""
                },
                {
                    "first": "M",
                    "middle": [],
                    "last": "Matignon",
                    "suffix": ""
                }
            ],
            "year": 1920,
            "venue": "",
            "volume": "",
            "issn": "",
            "pages": "30961--30963",
            "other_ids": {}
        },
        "BIBREF11": {
            "ref_id": "b11",
            "title": "TANGO Study Group. COVID-19 and kidney transplantation: results from the TANGO International Transplant Consortium",
            "authors": [
                {
                    "first": "P",
                    "middle": [],
                    "last": "Cravedi",
                    "suffix": ""
                },
                {
                    "first": "S",
                    "middle": [
                        "M"
                    ],
                    "last": "Suraj",
                    "suffix": ""
                },
                {
                    "first": "Y",
                    "middle": [],
                    "last": "Azzi",
                    "suffix": ""
                }
            ],
            "year": 2020,
            "venue": "Am J Transplant",
            "volume": "20",
            "issn": "11",
            "pages": "3140--3148",
            "other_ids": {}
        },
        "BIBREF12": {
            "ref_id": "b12",
            "title": "Serial soroepidemiological survey to monitor the prevalence of SARS-CoV-2 infection in the Municipality of São Paulo, SP, Brazil. Accessed Mar 03, 2021. www.monitoramentocovid19.org 11. São Paulo. Secretaria Municipal de Saúde. Núcleo de comunicação do comitê de crise para enfrentamento da COVID-19",
            "authors": [
                {
                    "first": "Msp",
                    "middle": [],
                    "last": "Soro Epi",
                    "suffix": ""
                }
            ],
            "year": 2021,
            "venue": "",
            "volume": "",
            "issn": "",
            "pages": "",
            "other_ids": {}
        },
        "BIBREF13": {
            "ref_id": "b13",
            "title": "Kidney transplantation in the time of COVID-19: dilemmas, experiences, and perspectives",
            "authors": [
                {
                    "first": "M",
                    "middle": [
                        "P"
                    ],
                    "last": "Cristelli",
                    "suffix": ""
                },
                {
                    "first": "L",
                    "middle": [
                        "A"
                    ],
                    "last": "Viana",
                    "suffix": ""
                },
                {
                    "first": "R",
                    "middle": [
                        "A"
                    ],
                    "last": "Fernandes",
                    "suffix": ""
                }
            ],
            "year": 2021,
            "venue": "Transpl Infect Dis",
            "volume": "",
            "issn": "",
            "pages": "",
            "other_ids": {
                "DOI": [
                    "10.1111/tid.13600"
                ]
            }
        },
        "BIBREF14": {
            "ref_id": "b14",
            "title": "AST ID Community of. Vaccination of solid organ transplant candidates and recipients: guidelines from the American society of transplantation infectious diseases community of practice",
            "authors": [
                {
                    "first": "L",
                    "middle": [],
                    "last": "Danziger-Isakov",
                    "suffix": ""
                },
                {
                    "first": "L",
                    "middle": [
                        "A"
                    ],
                    "last": "Viana",
                    "suffix": ""
                },
                {
                    "first": "R",
                    "middle": [],
                    "last": "Fernandes",
                    "suffix": ""
                }
            ],
            "year": 2019,
            "venue": "Clin Transplant",
            "volume": "33",
            "issn": "9",
            "pages": "",
            "other_ids": {}
        },
        "BIBREF15": {
            "ref_id": "b15",
            "title": "Association between ABO blood groups and COVID-19 infection, severity and demise: a systematic review and meta-analysis",
            "authors": [
                {
                    "first": "B",
                    "middle": [
                        "B"
                    ],
                    "last": "Wu",
                    "suffix": ""
                },
                {
                    "first": "D",
                    "middle": [
                        "Z"
                    ],
                    "last": "Gu",
                    "suffix": ""
                },
                {
                    "first": "J",
                    "middle": [
                        "N"
                    ],
                    "last": "Yu",
                    "suffix": ""
                },
                {
                    "first": "J",
                    "middle": [],
                    "last": "Yang",
                    "suffix": ""
                },
                {
                    "first": "W",
                    "middle": [
                        "Q"
                    ],
                    "last": "Shen",
                    "suffix": ""
                }
            ],
            "year": 2020,
            "venue": "Infect Genet Evol",
            "volume": "84",
            "issn": "",
            "pages": "",
            "other_ids": {}
        },
        "BIBREF16": {
            "ref_id": "b16",
            "title": "Spread of SARS-CoV-2 in the Icelandic Population",
            "authors": [
                {
                    "first": "D",
                    "middle": [
                        "F"
                    ],
                    "last": "Gudbjartsson",
                    "suffix": ""
                },
                {
                    "first": "A",
                    "middle": [],
                    "last": "Helgason",
                    "suffix": ""
                },
                {
                    "first": "H",
                    "middle": [],
                    "last": "Jonsson",
                    "suffix": ""
                }
            ],
            "year": 2020,
            "venue": "N Engl J Med",
            "volume": "382",
            "issn": "24",
            "pages": "2302--2315",
            "other_ids": {}
        },
        "BIBREF17": {
            "ref_id": "b17",
            "title": "Understanding immunosenescence and its impact on vaccination of older adults",
            "authors": [
                {
                    "first": "J",
                    "middle": [
                        "C"
                    ],
                    "last": "Allen",
                    "suffix": ""
                },
                {
                    "first": "F",
                    "middle": [
                        "R"
                    ],
                    "last": "Toapanta",
                    "suffix": ""
                },
                {
                    "first": "W",
                    "middle": [],
                    "last": "Chen",
                    "suffix": ""
                },
                {
                    "first": "S",
                    "middle": [
                        "M"
                    ],
                    "last": "Tennant",
                    "suffix": ""
                }
            ],
            "year": 2020,
            "venue": "Vaccine",
            "volume": "38",
            "issn": "52",
            "pages": "8264--8272",
            "other_ids": {}
        },
        "BIBREF18": {
            "ref_id": "b18",
            "title": "Rapid decay of anti-SARS-CoV-2 antibodies in persons with mild covid-19",
            "authors": [
                {
                    "first": "F",
                    "middle": [
                        "J"
                    ],
                    "last": "Ibarrondo",
                    "suffix": ""
                },
                {
                    "first": "J",
                    "middle": [
                        "A"
                    ],
                    "last": "Fulcher",
                    "suffix": ""
                },
                {
                    "first": "D",
                    "middle": [],
                    "last": "Goodman-Meza",
                    "suffix": ""
                }
            ],
            "year": 2020,
            "venue": "N Engl J Med",
            "volume": "383",
            "issn": "11",
            "pages": "1085--1087",
            "other_ids": {}
        },
        "BIBREF19": {
            "ref_id": "b19",
            "title": "Clinical and immunological assessment of asymptomatic SARS-CoV-2 infections",
            "authors": [
                {
                    "first": "Q",
                    "middle": [
                        "X"
                    ],
                    "last": "Long",
                    "suffix": ""
                },
                {
                    "first": "X",
                    "middle": [
                        "J"
                    ],
                    "last": "Tang",
                    "suffix": ""
                },
                {
                    "first": "Q",
                    "middle": [
                        "L"
                    ],
                    "last": "Shi",
                    "suffix": ""
                }
            ],
            "year": 2020,
            "venue": "Nat Med",
            "volume": "26",
            "issn": "8",
            "pages": "1200--1204",
            "other_ids": {}
        },
        "BIBREF20": {
            "ref_id": "b20",
            "title": "Ebola virus antibody decay-stimulation in a high proportion of survivors",
            "authors": [
                {
                    "first": "C",
                    "middle": [],
                    "last": "Adaken",
                    "suffix": ""
                },
                {
                    "first": "J",
                    "middle": [
                        "T"
                    ],
                    "last": "Scott",
                    "suffix": ""
                },
                {
                    "first": "R",
                    "middle": [],
                    "last": "Sharma",
                    "suffix": ""
                }
            ],
            "year": 2021,
            "venue": "Nature",
            "volume": "590",
            "issn": "7846",
            "pages": "468--472",
            "other_ids": {}
        },
        "BIBREF21": {
            "ref_id": "b21",
            "title": "Evolution of antibody immunity to SARS-CoV-2",
            "authors": [
                {
                    "first": "C",
                    "middle": [],
                    "last": "Gaebler",
                    "suffix": ""
                },
                {
                    "first": "Z",
                    "middle": [],
                    "last": "Wang",
                    "suffix": ""
                },
                {
                    "first": "Jcc",
                    "middle": [],
                    "last": "Lorenzi",
                    "suffix": ""
                }
            ],
            "year": 2021,
            "venue": "Nature",
            "volume": "591",
            "issn": "7851",
            "pages": "639--644",
            "other_ids": {}
        },
        "BIBREF22": {
            "ref_id": "b22",
            "title": "Humoral immune responses in COVID-19 patients: a window on the state of the art",
            "authors": [
                {
                    "first": "G",
                    "middle": [],
                    "last": "Siracusano",
                    "suffix": ""
                },
                {
                    "first": "C",
                    "middle": [],
                    "last": "Pastori",
                    "suffix": ""
                },
                {
                    "first": "L",
                    "middle": [],
                    "last": "Lopalco",
                    "suffix": ""
                }
            ],
            "year": 2020,
            "venue": "Front Immunol",
            "volume": "11",
            "issn": "",
            "pages": "",
            "other_ids": {}
        }
    },
    "ref_entries": {
        "FIGREF0": {
            "text": "Do you work as a health professional?; (2) have you had prior SARS-CoV-2 infection confirmed by either viral detection by RT-PCR testing or serologic testing?; (3) Have you had flu-like symptoms (that included fever, chills, headache, muscle or body aches, cough, sore throat, runny nose, fatigue, nausea, vomiting, and diarrhea) in the last six months?; (4) Have you have close contact (for at least 15 minutes) with a suspicious or confirmed case of SARS-CoV-2 infection in the past six months? Socio-demographic and clinical characteristics of interest were obtained from the electronic institutional records and included age, gender, ethnicity, blood type, past history of diabetes, donor source (deceased or living), class I and class II panel reactive antibody (PRA), time from transplantation, and region of residence.",
            "latex": null,
            "type": "figure"
        },
        "FIGREF1": {
            "text": "The median IgG anti-SARS-CoV-2 index of the 34 patients with positive serology was 3.1 arbitrary units (IQR 2.4-5.4). There were no differences in median IgG index according to clinical status (Supplementary Material 3). Twenty-seven patients had a second test after 59 (IQR 50-63) days, showing a median index of 2.6 arbitrary units (IQR 1.6-4.2). There were no differences in median IgG index comparing the first and second measurements (Supplementary Material 3) but, importantly, in nine patients (33%) the IgG index became below the positivity threshold, indicating the phenomena of seroreversion (the first Latin American analysis of the seroprevalence of IgG antibodies for SARS-CoV-2 among kidney transplant recipients. This survey was conducted in São Paulo, one of the epicenters of the COVID-19 pandemic in Brazil. The reported 8.2% seroprevalence islower than that observed in the general population, 17.9% in July 2020, and 26.2% in October 2020.10 The reasons behind the seroprevalence difference observed are not completely understood, involving, but not limited to, differences in the attack rate, lethality rate, antibody response, and adherence to non-pharmacological measures. The attack rate was higher among transplant recipients than that in general population reported by the municipality, 11 as illustrated inFigure 1. This may have been possibly due to an observation bias, since these individuals have broader access to SARS-CoV-2 testing, thanks to coordinated and sequential measures implemented by the transplant center since the beginning of the pandemic.12 Conversely, the COVID-19 lethality rate was 10-times higher among the kidney transplant recipients compared to the general population (30% vs. 4%) 11(Figure 1), potentially reducing the number of IgG+ recipients during the survey.Finally, pharmacological immunosuppression may impair the antibody response, such as what is observed for seroconversion after other viral diseases and vaccines.13 Some evidence suggests that certain blood groups would influence susceptibility to SARS-CoV-2 infection (group A patients would be more susceptible, for example), for reasons related to the interaction between the virus and target cells, but not yet completely established.14 In the present analysis, however, this association was not observed. There was a clear association between household contact and seroprevalence, as already demonstrated in previous surveys in the general population.4,15 Since prolonged and unprotected household contact represents the greatest risk of spreading the disease,",
            "latex": null,
            "type": "figure"
        },
        "FIGREF2": {
            "text": "Attack and lethality rates from COVID-19 and seroprevalence for IgG anti-SARS-CoV-2 among the studied population of kidney transplant recipients and the general population of the city of Sao Paulo. Data regarding the general population was obtained from references number 10 and 11 any prevention strategy should also focus on the patient's behavior at home. In addition, the social vulnerability of patients, added to the accumulation of comorbidities and the state of immunosuppression, results in a high risk of death, suggesting the need to prioritize this population in government vaccination strategies.",
            "latex": null,
            "type": "figure"
        },
        "FIGREF3": {
            "text": "between 1.3 and 6.2 months after infection with SARS-CoV-2 observed a preservation of the magnitude of the memory B-cell compartment, despite a significant decay of specific IgM and IgG antibody against the SARS-CoV-2 receptor binding domain and of the neutralizing activity in plasma. 20 The limitations of the present analysis include the fact that it was transversal and included a population from a specific region of the country, which does not allow extrapolation to other periods of time and space. Moreover, it is not possible to infer about population-or person-level protective immunity, since the presence of antibodies does not imply these antibodies protect the person. Third, the absence of a plaque-reduction neutralization test for confirming the IgG ELISA positive results prevents any conclusion about quantitative information on antibody titers that inhibit viral infection. Finally, in an ongoing pandemic, a large proportion of persons will be recently infected and therefore will be negative by serologic testing. 21 In conclusion, in this cohort of kidney transplant recipients living in the São Paulo city, the the seroprevalence for IgG anti-SARS-CoV-2 was lower than that of the general population and decreased with ageing. The main source of exposition was household contact and there was seroreversion in a considerable proportion of these patients in a short period of time suggesting the need prioritization of preventive strategies for these individuals. AUTHOR CONTRIBUTIONS Marina P. Cristelli, Laila A. Viana, Carlos M. Fortaleza, Helio Tedesco-Silva, Jose Medina-Pestana, Daniel W.C.L. Santos, and C.Gdesigned the study. Marina P. Cristelli, Laila A. Viana, Monica R. Nakamura, C.Z., and Renato Demarchi Foresto obtained the data. Marina P. Cristelli,",
            "latex": null,
            "type": "figure"
        },
        "TABREF1": {
            "text": "reported as frequencies and percentages, and comparisons were made using the Pearson chi-square test. Differences or effects were considered significant with a p < 0.05. Attack rate was defined as the percentage of the persons at risk that had a confirmed COVID-19 diagnosis either by RT-PCR or antigen testing. Patients who had a positive serologic test performed for the purpose of serosurvey studies",
            "latex": null,
            "type": "table"
        },
        "TABREF2": {
            "text": "cohorts. Of them, 64 were no longer living in Sao Paulo, and 50 patients did not consent to participate in the study. Finally, 22 patients had no serologic test result at the time of this analysis, resulting in 416 patients included for analysis (Supplementary Material 4). There were no differences comparing the demographic characteristics of the study cohort with the eligible population living in Sao Paulo, except for a longer median time after transplantation. Importantly, the study cohort well represented the regional distribution of residence of the eligible population (Supplementary Material 1).",
            "latex": null,
            "type": "table"
        },
        "TABREF5": {
            "text": "On the contrary, increased exposure to the virus among younger people, as they represent the workforce and are more socially active, less severe clinical presentation and more robust humoral response may be involved in the higher percentage of seroconversion among the younger kidney transplant recipients. Within 60 days, a third of the patients presented antibody decay to non-reagent levels. This phenomenon has already been observed for SARS-CoV-2 15,17,18 and other viruses 19 in the general population, and other viruses although its clinical significance is still uncertain. Furthermore, up to now, the role of cellular immunity, the most important component for virus infection control, has not been thoroughly evaluated. A North American study that evaluated 87 patients",
            "latex": null,
            "type": "table"
        }
    },
    "back_matter": [
        {
            "text": "The authors declare that they have no competing interests.",
            "cite_spans": [],
            "ref_spans": [],
            "section": "CONFLICT OF INTEREST"
        },
        {
            "text": "Marina P. Cristelli https://orcid.org/0000-0002-2813-0400",
            "cite_spans": [],
            "ref_spans": [],
            "section": "ORCID"
        },
        {
            "text": "Additional supporting information may be found online in the Supporting Information section at the end of the article. ",
            "cite_spans": [],
            "ref_spans": [],
            "section": "SUPPORTING INFORMATION"
        }
    ]
}