{
    "paper_id": "0a3e9da04b539edf262d3949473e9989672731fa",
    "metadata": {
        "title": "",
        "authors": []
    },
    "abstract": [],
    "body_text": [
        {
            "text": "Severe acute respiratory syndrome coronavirus 2 (SARS-CoV-2) and its associated illness, COVID-19, has emerged as the first global pandemic in a century. It was evident early on that older individuals were particularly vulnerable due to age and preexisting medical conditions. [1] [2] [3] [4] An outbreak in the United States at a long-term care facility (LTCF) in Washington made national headlines secondary to the high infection rates and a fatality rate greater than 25%. 5 Medical directors of LTCFs were alerted to identify quickly any suspected residents as the virus spread, infecting residents at LTCFs across the country, and leading to reports of more than 50% of the states' reported COVID-related deaths. 6, 7 Current research shows symptomatic residents at LTCFs most commonly experience shortness of breath, cough, and fever. 4 These symptoms are thought to arise after the virus enters the lungs via the angiotensin converting enzyme-2 receptor found in the lower respiratory tract. 4, 8 For unclear reasons, some residents develop an inflammatory process in the lungs resulting in respiratory distress which requires urgent medical attention. However, not all residents want aggressive medical interventions. Frequently residents in LTCFs have advanced directives to elucidate the extent of desired treatment if they were to become severely symptomatic with a disease such as COVID-19. As a result, some LTCF residents with COVID-19 wish to remain at the facility while others seek care in a hospital.",
            "cite_spans": [
                {
                    "start": 277,
                    "end": 280,
                    "text": "[1]",
                    "ref_id": "BIBREF0"
                },
                {
                    "start": 281,
                    "end": 284,
                    "text": "[2]",
                    "ref_id": "BIBREF1"
                },
                {
                    "start": 285,
                    "end": 288,
                    "text": "[3]",
                    "ref_id": "BIBREF2"
                },
                {
                    "start": 289,
                    "end": 292,
                    "text": "[4]",
                    "ref_id": "BIBREF3"
                },
                {
                    "start": 476,
                    "end": 477,
                    "text": "5",
                    "ref_id": "BIBREF4"
                },
                {
                    "start": 718,
                    "end": 720,
                    "text": "6,",
                    "ref_id": "BIBREF5"
                },
                {
                    "start": 721,
                    "end": 722,
                    "text": "7",
                    "ref_id": "BIBREF6"
                },
                {
                    "start": 841,
                    "end": 842,
                    "text": "4",
                    "ref_id": "BIBREF3"
                },
                {
                    "start": 999,
                    "end": 1001,
                    "text": "4,",
                    "ref_id": "BIBREF3"
                },
                {
                    "start": 1002,
                    "end": 1003,
                    "text": "8",
                    "ref_id": "BIBREF7"
                }
            ],
            "ref_spans": [],
            "section": "Introduction"
        },
        {
            "text": "For those choosing to remain at an LTCF and not to receive aggressive measures, treatment focuses on comfort. Opioid therapy for oxygen hunger is a well-established treatment for refractory dyspnea, particularly at the end of life. While the exact mechanism of action of opioids on dyspnea is not understood, it is thought to be multifactorial: opioids decrease respiratory drive, central perception dyspnea, activity of peripheral opioid receptors, and anxiety associated with breathlessness. 1 In March 2020, a resident at a 98-bed long-term care facility (LTCF) in West Virginia (WV) was the first confirmed COVID-19 positive LTCF case in the state. Within 48 h, 40 residents tested positive with 11 developing severe respiratory symptoms. This study examined associations between treatment received, location, and mortality in residents who experienced severe respiratory symptoms secondary to COVID-19. Early observations led to the hypothesis that outcomes would not be different based on treatment received or location of treatment.",
            "cite_spans": [
                {
                    "start": 494,
                    "end": 495,
                    "text": "1",
                    "ref_id": "BIBREF0"
                }
            ],
            "ref_spans": [],
            "section": "Introduction"
        },
        {
            "text": "Residents from a 98-bed LTCF in West Virginia were tracked from the notification of the first positive resident with SARS-CoV-2 until the facility became COVID recovered (all facility residents PCR negative for 2 weeks). Residents were included if they experienced severe respiratory symptoms defined as an oxygen requirement beyond support by nasal cannula. This study was approved and monitored by the West Virginia University Institutional Review Board (protocol #2006023468), and written documentation of informed consent was obtained from each resident or their medical power of attorney.",
            "cite_spans": [],
            "ref_spans": [],
            "section": "Population"
        },
        {
            "text": "The primary outcome of interest was overall mortality. Mortality was assessed at 4 time points along a resident's disease course, including while in respiratory failure, after symptom resolution but PCR positive, 3 months after the initial PCR positive test, and 6 months after the initial PCR positive test. Residents were tested weekly until PCR testing for SARS-CoV-2 was negative, and at that time they were considered fully recovered. Of severely symptomatic residents surviving to clear SARS-CoV-2, the average duration of PCR positivity was 34 days.",
            "cite_spans": [],
            "ref_spans": [],
            "section": "Primary Outcome"
        },
        {
            "text": "Demographic factors (age, race/ethnicity, and sex), medical conditions, and medications were retrospectively extracted from paper and/or electronic health record review. All residents at the facility were white and therefore race not included in analysis.",
            "cite_spans": [],
            "ref_spans": [],
            "section": "Resident Characteristics"
        },
        {
            "text": "Upon diagnosis of COVID-19, the medical director of the LTCF communicated with residents and their families to review and confirm the resident's advanced directives so that the desired level of care could be provided should a resident's medical condition worsen.",
            "cite_spans": [],
            "ref_spans": [],
            "section": "Treatment Received"
        },
        {
            "text": "Hospitalization. Residents with severe symptoms who wished to be transferred to a higher level of care were sent via ambulance to a local hospital of their choice. Residents sent to the hospital were all a full code and requested medical intervention to treat COVID-19 associated symptoms. Individuals were treated with advancing levels of supplemental oxygen, ultimately resulting in intubation due to their worsening respiratory distress. Infectious disease physicians were consulted and recommended treatment with azithromycin and hydroxychloroquine, the accepted therapy at the time of their hospitalization. ICU level care was provided until death or until they were extubated and only required nasal cannula respiratory support.",
            "cite_spans": [],
            "ref_spans": [],
            "section": "Treatment Received"
        },
        {
            "text": "Supportive care at facility. For residents electing to remain at LTCF, all were provided all supportive and comfort care measures available at the facility including medication (antipyretics, hydroxychloroquine, azithromycin, and palliative medications if indicated), intravenous or subcutaneous fluids, nasal cannula, and non-rebreather oxygen supplementation. An infectious disease physician at the local academic medical facility was consulted via phone by the LTCF medical director and recommend treatment with azithromycin and hydroxychloroquine for all residents. Vitals were monitored approximately every 4 h. Staff noted that patients would often decompensate quickly and without warning. Normal range vitals with a few liters of oxygen at 1 check would be followed by finding a hypoxic patient with oxygen saturations in the 70s or low 80s at the next. It was observed that the patients were frequently tachypneic and agitated when hypoxic. Patients displaying agitation despite use of non-rebreather at 10 L were given morphine (Roxanol) to help with the dyspnea. 9 Morphine (Roxanol) dosing varied among patients but was titrated to comfort. It was noticed that after achieving comfort, the patients' respiratory rate and oxygen saturations improved into the upper 80's to low 90's. Additionally, as the patient's agitation decreased, their ability to tolerate supplemental oxygen therapy improved. Treatment with palliative opioids and nonrebreather oxygen continued until the patient improved or expired. The average duration of treatment was 24 to 48 h.",
            "cite_spans": [],
            "ref_spans": [],
            "section": "Treatment Received"
        },
        {
            "text": "Stata Statistical Software: Release 16 (College Station, TX: StataCorp LP) was used for all statistical analyses. Means and proportions were calculated for each demographic characteristic and outcome. Differences in demographic characteristics and outcomes between patients who were hospitalized with no palliative opioid treatment to those opting to remain at the LTCF and treated with palliative opioids were tested using a Pearson χ 2 . Significance was set at a P-value of <.05. Table 1 summarizes the demographic and health characteristics of the LTCF residents with severe symptoms. Residents with severe symptoms had a mean age of 84 years and 81.2% were female. All were chronically ill at baseline, with approximately 8 chronic medical conditions; the most common was dementia (72.2%).",
            "cite_spans": [],
            "ref_spans": [
                {
                    "start": 483,
                    "end": 490,
                    "text": "Table 1",
                    "ref_id": "TABREF0"
                }
            ],
            "section": "Analysis"
        },
        {
            "text": "With respect to treatment, 3 of the 11 residents opted for transfer to the hospital where they continued to decline and required intubation. Eight residents developed respiratory failure at the LTCF and received palliative opioids. No statistically significant differences in age, gender, chronic medical conditions, or medications were found among those who remained at the LTCF receiving opioid therapy versus those hospitalized and intubated. Figure 1 summarizes survival data for each treatment group across disease progression and recovery. Overall mortality among residents who developed severe respiratory symptoms was 45.5%. Across all time points (while in respiratory failure, after symptom resolution but PCR positive, 3 months after the initial PCR positive test, and 6 months after the initial PCR positive test) mortality was not statistically different between those hospitalized versus those who received palliative opioids at the LTCF.",
            "cite_spans": [],
            "ref_spans": [
                {
                    "start": 446,
                    "end": 454,
                    "text": "Figure 1",
                    "ref_id": null
                }
            ],
            "section": "Results"
        },
        {
            "text": "Residents developing respiratory failure were given palliative opioids with oxygen to achieve comfort. No difference was found in their survival compared with those hospitalized receiving full scope of care. This is the first known study to examine outcome differences in geriatric individuals experiencing severe respiratory symptoms secondary to COVID-19 who were hospitalized versus treated with palliative measures.",
            "cite_spans": [],
            "ref_spans": [],
            "section": "Discussion"
        },
        {
            "text": "Opioid therapy for oxygen hunger is a well-established treatment for refractory dyspnea, particularly at the end of life. It is thought opioids improve dyspnea by decreasing a patient's respiratory drive, central perception of dyspnea, and anxiety. 1 Breathlessness and anxiety were common among residents with severe symptoms and many LTCF residents had a diagnosis of dementia which can exacerbate confusion, agitation, and delirium in any acute illness. Titrating opioid therapy resulted in normalization of oxygen saturations and respiratory rates. Subsequently, opioidtreated resident survival at this facility was 87.5% during the acutely symptomatic phase, higher than expected given extensive reports of low survival rates at LTCFs. 2 Mortality of acutely symptomatic LTCF residents receiving palliative opioids was proportionally lower and trended toward significance compared to those who did not receive palliative opioids and were intubated. Although not significant, it suggests hospitalization may not improve survival over palliative care at a LTCF. This finding may also have cost implications for the resident and health care system as the cost difference between a day in a LTCF versus ICU can easily be $10,000 in acute illness. 2, 3 With this knowledge, families and residents families could take comfort in a familiar environment surrounded by staff they knew and potentially no difference in outcomes.",
            "cite_spans": [
                {
                    "start": 249,
                    "end": 250,
                    "text": "1",
                    "ref_id": "BIBREF0"
                },
                {
                    "start": 741,
                    "end": 742,
                    "text": "2",
                    "ref_id": "BIBREF1"
                },
                {
                    "start": 1248,
                    "end": 1250,
                    "text": "2,",
                    "ref_id": "BIBREF1"
                },
                {
                    "start": 1251,
                    "end": 1252,
                    "text": "3",
                    "ref_id": "BIBREF2"
                }
            ],
            "ref_spans": [],
            "section": "Discussion"
        },
        {
            "text": "The key strength of this study was the ability to follow longitudinally a cohort of high-risk, vulnerable residents throughout their COVID-19 course. Furthermore, the study was able to compare outcomes of LTCF residents choosing different levels of therapeutic intervention to combat the illness. The greatest limitation was a small sample size which did not allow for sufficient statistical power to make a conclusion regarding the superiority of 1 treatment. Ultimately, more research with larger sample sizes is needed to better understand the outcomes of residents treated at an LTCF with palliative opioids versus those hospitalized. At the time of this reported outbreak, azithromycin and hydroxychloroquine were the standard, but newer data suggest that other medications (such as steroids and remdesivir) lead to better outcomes. 4, 5 The current treatments may impact LTCF resident survival and alter the consideration of treatment with palliative opioids in residents afflicted with COVID-19.",
            "cite_spans": [
                {
                    "start": 838,
                    "end": 840,
                    "text": "4,",
                    "ref_id": "BIBREF3"
                },
                {
                    "start": 841,
                    "end": 842,
                    "text": "5",
                    "ref_id": "BIBREF4"
                }
            ],
            "ref_spans": [],
            "section": "Discussion"
        },
        {
            "text": "In conclusion, our data suggest that LTCF staff can provide the necessary care to residents with COVID-19 while maintaining mortality rates comparable to hospitalization. This is critical information for LCTFs in both rural and lowresource areas, as palliative opioids may be an important tool in bridging the gap until higher levels of care can be accessed or by allowing a patient to remain in an environment of their choice for care.",
            "cite_spans": [],
            "ref_spans": [],
            "section": "Discussion"
        }
    ],
    "bib_entries": {
        "BIBREF0": {
            "ref_id": "b0",
            "title": "Opioids for refractory dyspnea",
            "authors": [
                {
                    "first": "D",
                    "middle": [
                        "A"
                    ],
                    "last": "Mahler",
                    "suffix": ""
                }
            ],
            "year": 2013,
            "venue": "Expert Rev of Respir Med",
            "volume": "7",
            "issn": "",
            "pages": "123--135",
            "other_ids": {
                "DOI": [
                    "10.1586/ers.13.5"
                ]
            }
        },
        "BIBREF1": {
            "ref_id": "b1",
            "title": "Coronavirus disease 2019 in geriatrics and long-term care: the ABCDs of COVID-19",
            "authors": [
                {
                    "first": "H",
                    "middle": [],
                    "last": "D&apos;adamo",
                    "suffix": ""
                },
                {
                    "first": "T",
                    "middle": [],
                    "last": "Yoshikawa",
                    "suffix": ""
                },
                {
                    "first": "J",
                    "middle": [
                        "G"
                    ],
                    "last": "Ouslander",
                    "suffix": ""
                }
            ],
            "year": 2020,
            "venue": "J Am Geriatr Soc",
            "volume": "68",
            "issn": "",
            "pages": "912--917",
            "other_ids": {}
        },
        "BIBREF2": {
            "ref_id": "b2",
            "title": "Society of Taiwan long-term care infection prevention and control. Recommendation on protection from and mitigation of COVID-19 pandemic in long-term care facilities",
            "authors": [
                {
                    "first": "M",
                    "middle": [
                        "Y"
                    ],
                    "last": "Yen",
                    "suffix": ""
                },
                {
                    "first": "J",
                    "middle": [],
                    "last": "Schwartz",
                    "suffix": ""
                },
                {
                    "first": "C",
                    "middle": [
                        "C"
                    ],
                    "last": "King",
                    "suffix": ""
                },
                {
                    "first": "C",
                    "middle": [
                        "M"
                    ],
                    "last": "Lee",
                    "suffix": ""
                },
                {
                    "first": "P",
                    "middle": [
                        "R"
                    ],
                    "last": "Hsueh",
                    "suffix": ""
                }
            ],
            "year": 2020,
            "venue": "J Microbiol Immunol Infect",
            "volume": "53",
            "issn": "",
            "pages": "447--453",
            "other_ids": {}
        },
        "BIBREF3": {
            "ref_id": "b3",
            "title": "COVID-19 and older adults: what we know",
            "authors": [
                {
                    "first": "Z",
                    "middle": [],
                    "last": "Shahid",
                    "suffix": ""
                },
                {
                    "first": "R",
                    "middle": [],
                    "last": "Kalayanamitra",
                    "suffix": ""
                },
                {
                    "first": "B",
                    "middle": [],
                    "last": "Mcclafferty",
                    "suffix": ""
                }
            ],
            "year": 2020,
            "venue": "J Am Geriatr Soc",
            "volume": "68",
            "issn": "",
            "pages": "926--929",
            "other_ids": {
                "DOI": [
                    "10.1111/jgs.16472"
                ]
            }
        },
        "BIBREF4": {
            "ref_id": "b4",
            "title": "COVID-19 in a long-term care facility",
            "authors": [
                {
                    "first": "T",
                    "middle": [
                        "M"
                    ],
                    "last": "Mcmichael",
                    "suffix": ""
                },
                {
                    "first": "S",
                    "middle": [],
                    "last": "Clark",
                    "suffix": ""
                },
                {
                    "first": "S",
                    "middle": [],
                    "last": "Pogosjans",
                    "suffix": ""
                }
            ],
            "year": 2020,
            "venue": "MMWR Morb Mortal Wkly Rep",
            "volume": "69",
            "issn": "",
            "pages": "339--342",
            "other_ids": {
                "DOI": [
                    "10.15585/mmwr.mm6912e1"
                ]
            }
        },
        "BIBREF5": {
            "ref_id": "b5",
            "title": "COVID-19 Nursing Home Data. Data.cms.gov",
            "authors": [],
            "year": 2021,
            "venue": "",
            "volume": "",
            "issn": "",
            "pages": "",
            "other_ids": {}
        },
        "BIBREF6": {
            "ref_id": "b6",
            "title": "State reporting of cases and deaths due to COVID-19 in long-term care facilities. Kaiser Family Foundation",
            "authors": [
                {
                    "first": "P",
                    "middle": [],
                    "last": "Chidambaram",
                    "suffix": ""
                }
            ],
            "year": 2020,
            "venue": "",
            "volume": "",
            "issn": "",
            "pages": "",
            "other_ids": {}
        },
        "BIBREF7": {
            "ref_id": "b7",
            "title": "A pneumonia outbreak associated with a new coronavirus of probable bat origin",
            "authors": [
                {
                    "first": "P",
                    "middle": [],
                    "last": "Zhou",
                    "suffix": ""
                },
                {
                    "first": "X",
                    "middle": [
                        "L"
                    ],
                    "last": "Yang",
                    "suffix": ""
                },
                {
                    "first": "X",
                    "middle": [
                        "G"
                    ],
                    "last": "Wang",
                    "suffix": ""
                }
            ],
            "year": 2020,
            "venue": "Nature",
            "volume": "579",
            "issn": "",
            "pages": "270--273",
            "other_ids": {
                "DOI": [
                    "10.1038/s41586-020-2012-7"
                ]
            }
        },
        "BIBREF8": {
            "ref_id": "b8",
            "title": "Daily cost of an intensive care unit day: the contribution of mechanical ventilation",
            "authors": [
                {
                    "first": "J",
                    "middle": [
                        "F"
                    ],
                    "last": "Dasta",
                    "suffix": ""
                },
                {
                    "first": "T",
                    "middle": [
                        "P"
                    ],
                    "last": "Mclaughlin",
                    "suffix": ""
                },
                {
                    "first": "S",
                    "middle": [
                        "H"
                    ],
                    "last": "Mody",
                    "suffix": ""
                },
                {
                    "first": "C",
                    "middle": [
                        "T"
                    ],
                    "last": "Piech",
                    "suffix": ""
                }
            ],
            "year": 2005,
            "venue": "Crit Care Med",
            "volume": "33",
            "issn": "",
            "pages": "1266--1271",
            "other_ids": {
                "DOI": [
                    "10.1097/01.ccm.0000164543.14619.00"
                ]
            }
        }
    },
    "ref_entries": {
        "TABREF0": {
            "text": "Demographic and Health Characteristics of LTCF Residents Who Experienced Severe Symptoms ¥ Associated with COVID-19 Infection by Palliative Opioid Use. ^I ncludes myasthenia gravis, multiple sclerosis, rheumatoid arthritis, or hypothyroidism.Includes asthma and chronic obstructive pulmonary disease (COPD). † Includes congestive heart failure (CHF) and coronary artery disease (CAD). ‡ Includes aromatase inhibitors, methotrexate, or biologics.Severe symptoms defined by need for oxygen supplementation beyond a common nasal cannula including non-rebreather, high-flow nasal cannula, BiPAP, and/or intubation.",
            "latex": null,
            "type": "table"
        }
    },
    "back_matter": [
        {
            "text": "We are grateful to the staff and administration of this LTCF for their tireless efforts to care for the residents and to maintain open communication with their families during the outbreak. We are especially thankful to Tammy Wills for her limitless knowledge, organization, and leadership that made data collection for this study possible.",
            "cite_spans": [],
            "ref_spans": [],
            "section": "Acknowledgments"
        },
        {
            "text": "The author(s) declared the following potential conflicts of interest with respect to the research, authorship, and/or publication of this article: Carl Shrader is the Medical Director of the LTCF described in this manuscript. He has no other financial or personal conflicts to disclose. Emily Crocetti, Shauna Assadzandi, Courtney Pilkerton, and Amie Ashcraft have no conflicts of interest either financial or personal to disclose.",
            "cite_spans": [],
            "ref_spans": [],
            "section": "Declaration of Conflicting Interests"
        },
        {
            "text": "The author(s) disclosed receipt of the following financial support for the research, authorship, and/or publication of this article: The project described was supported by the National Institute of General Medical Sciences, U54GM104942. The content is solely the responsibility of the authors and does not necessarily represent the official views of the NIH.",
            "cite_spans": [],
            "ref_spans": [],
            "section": "Funding"
        },
        {
            "text": "The views expressed in this article are those of the authors' and do not necessarily reflect official policy or position of the Department of the Navy, Department of Defense, nor the U.S. Government.",
            "cite_spans": [],
            "ref_spans": [],
            "section": "Disclaimer"
        },
        {
            "text": "Amie M. Ashcraft https://orcid.org/0000-0002-7466-7612",
            "cite_spans": [],
            "ref_spans": [],
            "section": "ORCID iD"
        }
    ]
}