{
    "paper_id": "0a41cbd52672eb1b297efc3761c58aa5c48a9e14",
    "metadata": {
        "title": "Ethical, Regulatory and Market related aspects of Deploying Triple Artemisinin-Based Combination Therapies for Malaria treatment in Africa: A study protocol. [version 1; peer review: 2 approved]",
        "authors": [
            {
                "first": "Paulina",
                "middle": [],
                "last": "Tindana",
                "suffix": "",
                "affiliation": {
                    "laboratory": "",
                    "institution": "University of Ghana",
                    "location": {
                        "settlement": "Accra",
                        "country": "Ghana"
                    }
                },
                "email": ""
            },
            {
                "first": "Freek",
                "middle": [],
                "last": "De Haan",
                "suffix": "",
                "affiliation": {
                    "laboratory": "",
                    "institution": "Utrecht University",
                    "location": {
                        "settlement": "Ultrecht",
                        "country": "The Netherlands"
                    }
                },
                "email": ""
            },
            {
                "first": "Olugbenga",
                "middle": [
                    "Ayodeji"
                ],
                "last": "Mokuolu",
                "suffix": "",
                "affiliation": {
                    "laboratory": "",
                    "institution": "University of Ilorin",
                    "location": {
                        "settlement": "Illorin",
                        "country": "Nigeria"
                    }
                },
                "email": ""
            },
            {
                "first": "Rosemonde",
                "middle": [],
                "last": "Guissou",
                "suffix": "",
                "affiliation": {},
                "email": ""
            },
            {
                "first": "Oladimeji",
                "middle": [
                    "Akeem"
                ],
                "last": "Bolarinwa",
                "suffix": "",
                "affiliation": {
                    "laboratory": "",
                    "institution": "University of Illorin",
                    "location": {
                        "settlement": "Illorin",
                        "country": "Nigeria"
                    }
                },
                "email": ""
            },
            {
                "first": "Jean",
                "middle": [],
                "last": "Bosco Ouedraogo",
                "suffix": "",
                "affiliation": {},
                "email": ""
            },
            {
                "first": "Fatoumata",
                "middle": [],
                "last": "Tou",
                "suffix": "",
                "affiliation": {},
                "email": ""
            },
            {
                "first": "Wouter",
                "middle": [
                    "P C"
                ],
                "last": "Boon",
                "suffix": "",
                "affiliation": {
                    "laboratory": "",
                    "institution": "Utrecht University",
                    "location": {
                        "settlement": "Ultrecht",
                        "country": "The Netherlands"
                    }
                },
                "email": ""
            },
            {
                "first": "Ellen",
                "middle": [
                    "H M"
                ],
                "last": "Moors",
                "suffix": "",
                "affiliation": {
                    "laboratory": "",
                    "institution": "Utrecht University",
                    "location": {
                        "settlement": "Ultrecht",
                        "country": "The Netherlands"
                    }
                },
                "email": ""
            },
            {
                "first": "Arjen",
                "middle": [
                    "M"
                ],
                "last": "Dondorp",
                "suffix": "",
                "affiliation": {
                    "laboratory": "",
                    "institution": "Mahidol University",
                    "location": {
                        "settlement": "Bangkok",
                        "country": "Thailand"
                    }
                },
                "email": ""
            },
            {
                "first": "Mehul",
                "middle": [],
                "last": "Dhorda",
                "suffix": "",
                "affiliation": {
                    "laboratory": "",
                    "institution": "Mahidol University",
                    "location": {
                        "settlement": "Bangkok",
                        "country": "Thailand"
                    }
                },
                "email": ""
            },
            {
                "first": "Chanaki",
                "middle": [],
                "last": "Amaratunga",
                "suffix": "",
                "affiliation": {
                    "laboratory": "",
                    "institution": "Mahidol University",
                    "location": {
                        "settlement": "Bangkok",
                        "country": "Thailand"
                    }
                },
                "email": ""
            },
            {
                "first": "Phaik",
                "middle": [
                    "Yeong"
                ],
                "last": "Cheah",
                "suffix": "",
                "affiliation": {
                    "laboratory": "",
                    "institution": "Mahidol University",
                    "location": {
                        "settlement": "Bangkok",
                        "country": "Thailand"
                    }
                },
                "email": ""
            }
        ]
    },
    "abstract": [],
    "body_text": [
        {
            "text": "In the early 2000s, following widespread development of antimalarial drug resistance to hitherto effective monotherapies, such as chloroquine and sulphadoxine-pyrimethamine (SP), the World Health Organization (WHO) recommended artemisininbased combination therapies (ACTs) as an approach to improve therapeutic efficacy and delay the development of antimalarial drug resistance (WHO, 2003) . Subsequently, several malaria endemic countries in Asia and Africa changed their national malaria treatment policies to ACTs as first-line treatment for uncomplicated malaria (Kamya et al., 2002; Mulligan et al., 2006; Williams et al., 2004) .",
            "cite_spans": [
                {
                    "start": 378,
                    "end": 389,
                    "text": "(WHO, 2003)",
                    "ref_id": null
                },
                {
                    "start": 567,
                    "end": 587,
                    "text": "(Kamya et al., 2002;",
                    "ref_id": null
                },
                {
                    "start": 588,
                    "end": 610,
                    "text": "Mulligan et al., 2006;",
                    "ref_id": null
                },
                {
                    "start": 611,
                    "end": 633,
                    "text": "Williams et al., 2004)",
                    "ref_id": null
                }
            ],
            "ref_spans": [],
            "section": "Introduction"
        },
        {
            "text": "Artemether-lumefantrine (AL) and artesunate-amodiaquine (ASAQ) are currently the most deployed ACT combinations used by national malaria control programs in Africa and the recent World Malaria Report suggests that the efficacy rates of these ACTs 'were more than 98%, and efficacy has remained high over time' (WHO, 2019) . The report also showed that in 2018, there were an estimated 405,000 deaths from malaria globally, compared with 416,000 estimated deaths in 2017, and 585,000 in 2010 (WHO, 2019) . Majority (94%) of these deaths occurred in the African region (WHO, 2019) . While malaria prevalence and mortality has declined over the years, recent reports suggest that these gains may stand the risk of being reversed, particularly with the threat of resistance to ACTs spreading from Southeast Asia to Africa (Ashley et al., 2014) . There is therefore the need to intensify efforts at developing effective treatment regimens that can treat multi-drug resistant Plasmodium falciparum malaria.",
            "cite_spans": [
                {
                    "start": 310,
                    "end": 321,
                    "text": "(WHO, 2019)",
                    "ref_id": null
                },
                {
                    "start": 491,
                    "end": 502,
                    "text": "(WHO, 2019)",
                    "ref_id": null
                },
                {
                    "start": 567,
                    "end": 578,
                    "text": "(WHO, 2019)",
                    "ref_id": null
                },
                {
                    "start": 811,
                    "end": 839,
                    "text": "Africa (Ashley et al., 2014)",
                    "ref_id": null
                }
            ],
            "ref_spans": [],
            "section": "Introduction"
        },
        {
            "text": "The Tracking Resistance to Artemisinin Collaboration II (TRACII) trial was established to conduct a randomized clinical trial mainly in Asia to compare the efficacy, safety and tolerability of two triple ACTs (TACTs) with corresponding ACT (van der Pluijm et al., 2020) . This TRACII trial involved combining existing antimalarial: AL with amodiaquine and dihydroartemisinin-piperaquine (DHA-PPQ) with mefloquine, both of which were able to treat multi-drug resistant falciparum malaria. Taking the results to the next level, the overarching goal of the Development of Triple Artemisinin-based Combination Therapies (DeTACT) project is to have co-formulated TACTs ready for global deployment once they are found to be non-inferior to ACTs in the treatment of malaria. This has implications. As with the introduction of any new health interventions, there is the need, not only to address issues related to efficacy and safety, but also to anticipate ethical, social and regulatory aspects of deploying TACTs. Ethical questions may arise around deployment of TACTs in contexts where ACTs remain effective, such as in Africa. Effective implementation of updated treatment policies and integrating ACTs into established market structures in Africa has historically faced several ethical, social and regulatory challenges (Maslove et al., 2009; Mutero et al., 2014; Wasunna et al., 2008; Yeung & White, 2005) . A review article by Amin et al. reported that it took nearly 3 years for Kenya to implement ACT after the policy change was announced (Amin et al., 2007) . Similar implementation delays were observed by Bosman and Mendis in several malaria endemic countries (Bosman & Mendis, 2007) . Beyond delays in implementation programs, many factors were associated with a problematic market introduction of ACTs in Africa. These vary from high consumer prices and suboptimal integration in distribution chains, to a lack of end-user acceptability through factors such as negative community perceptions and perceived side effects (Arrow et al., 2004; Malik et al., 2006; Martins et al., 2012; Palafox et al., 2014; Yadav et al., 2007) . Similar challenges are also likely to affect the future deployment of new antimalarials on the African continent. Additionally, introduction of previous generations of antimalarial drugs warrant a market positioning assessment to address issues related to changing treatment policy and the integration of TACTs into established market structures. Therefore, it is important to learn lessons from the past and anticipate ethical, regulatory and market related issues for the introduction and deployment of new generations of antimalarials.",
            "cite_spans": [
                {
                    "start": 240,
                    "end": 269,
                    "text": "(van der Pluijm et al., 2020)",
                    "ref_id": null
                },
                {
                    "start": 1318,
                    "end": 1340,
                    "text": "(Maslove et al., 2009;",
                    "ref_id": null
                },
                {
                    "start": 1341,
                    "end": 1361,
                    "text": "Mutero et al., 2014;",
                    "ref_id": null
                },
                {
                    "start": 1362,
                    "end": 1383,
                    "text": "Wasunna et al., 2008;",
                    "ref_id": null
                },
                {
                    "start": 1384,
                    "end": 1404,
                    "text": "Yeung & White, 2005)",
                    "ref_id": null
                },
                {
                    "start": 1541,
                    "end": 1560,
                    "text": "(Amin et al., 2007)",
                    "ref_id": null
                },
                {
                    "start": 1665,
                    "end": 1688,
                    "text": "(Bosman & Mendis, 2007)",
                    "ref_id": null
                },
                {
                    "start": 2026,
                    "end": 2046,
                    "text": "(Arrow et al., 2004;",
                    "ref_id": null
                },
                {
                    "start": 2047,
                    "end": 2066,
                    "text": "Malik et al., 2006;",
                    "ref_id": null
                },
                {
                    "start": 2067,
                    "end": 2088,
                    "text": "Martins et al., 2012;",
                    "ref_id": null
                },
                {
                    "start": 2089,
                    "end": 2110,
                    "text": "Palafox et al., 2014;",
                    "ref_id": null
                },
                {
                    "start": 2111,
                    "end": 2130,
                    "text": "Yadav et al., 2007)",
                    "ref_id": null
                }
            ],
            "ref_spans": [],
            "section": "Introduction"
        },
        {
            "text": "There are several lessons that can be learned from country experiences in the adoption and deployment of ACTs in Africa which can inform the rapid deployment of TACTs in Africa. Developing effective communication strategies to sensitize communities about the change in treatment policies is clearly important and has played a major role in malaria treatment policy implementation in several countries (Mutero et al., 2014) . Public involvement (which includes taking into account stakeholders' views needs to be harnessed right from the time of undertaking the research through to implementing the national treatment policies. Innovative drugs should also be aligned with the prevalent institutional frameworks and there should be effective strategies in place to phase out previous drug generations from the market (Martins et al., 2012) . Even though the WHO recommended the deployment of ACTs in areas of drug resistance since 2001, non-artemisinin therapies continued to dominate the drug markets in African countries beyond 2009 (Palafox et al., 2014 . Beyond influencing policy change, there are other barriers to effective treatment of malaria that need to be addressed. Chuma et al. have reported that issues related to affordability, acceptability and availability interact to influence access to prompt and effective treatment (Chuma et al., 2010) . Other issues that have been highlighted in the literature include community acceptance, adherence to treatment guidelines both at the facility and household level, prescribers' preferences and the burden on health systems (Ajayi et al., 2008; Bosman & Mendis, 2007; O'Connell et al., 2011) . Inertia in the process of policy implementation, misalignment with institutional arrangements and complexity of distribution chains have also been associated with the slow uptake of innovative drugs (Martins et al., 2012; Palafox et al., 2014; Yadav et al., 2007) . Ajayi et al., 2008; Williams et al., 2004) . Addressing these issues is important to determine if TACTs will be accepted once they are proven safe and non-inferior to ACTs in African settings.",
            "cite_spans": [
                {
                    "start": 401,
                    "end": 422,
                    "text": "(Mutero et al., 2014)",
                    "ref_id": null
                },
                {
                    "start": 816,
                    "end": 838,
                    "text": "(Martins et al., 2012)",
                    "ref_id": null
                },
                {
                    "start": 1029,
                    "end": 1033,
                    "text": "2009",
                    "ref_id": null
                },
                {
                    "start": 1034,
                    "end": 1055,
                    "text": "(Palafox et al., 2014",
                    "ref_id": null
                },
                {
                    "start": 1337,
                    "end": 1357,
                    "text": "(Chuma et al., 2010)",
                    "ref_id": null
                },
                {
                    "start": 1582,
                    "end": 1602,
                    "text": "(Ajayi et al., 2008;",
                    "ref_id": "BIBREF0"
                },
                {
                    "start": 1603,
                    "end": 1625,
                    "text": "Bosman & Mendis, 2007;",
                    "ref_id": null
                },
                {
                    "start": 1626,
                    "end": 1649,
                    "text": "O'Connell et al., 2011)",
                    "ref_id": null
                },
                {
                    "start": 1851,
                    "end": 1873,
                    "text": "(Martins et al., 2012;",
                    "ref_id": null
                },
                {
                    "start": 1874,
                    "end": 1895,
                    "text": "Palafox et al., 2014;",
                    "ref_id": null
                },
                {
                    "start": 1896,
                    "end": 1915,
                    "text": "Yadav et al., 2007)",
                    "ref_id": null
                },
                {
                    "start": 1918,
                    "end": 1937,
                    "text": "Ajayi et al., 2008;",
                    "ref_id": "BIBREF0"
                },
                {
                    "start": 1938,
                    "end": 1960,
                    "text": "Williams et al., 2004)",
                    "ref_id": null
                }
            ],
            "ref_spans": [],
            "section": "Introduction"
        },
        {
            "text": "The proposed study poses some uniqueness in being one of the first studies that will seek to understand the ethical, social, regulatory and market position issues prior to the development of a potential antimalarial medicine in Africa. This will inform the design, the sampling process, the tools and their validation. This paper presents the study protocol to guide the reproducibility of similar studies by other researchers and facilitate comparison of data that may be generated from such studies.",
            "cite_spans": [],
            "ref_spans": [],
            "section": "Study protocol"
        },
        {
            "text": "Two major questions were raised for this study. The first is the ethics question around the deployment of TACTs \"what are the main ethical considerations for requesting populations and governments in African countries to switch to TACTs while ACTs are still effective?\" The second is the market positioning question \"To what extent are the health systems and markets of African countries ready for a transition to TACTs if it is proven to be non-inferior to ACTs?\"",
            "cite_spans": [],
            "ref_spans": [],
            "section": "Research questions"
        },
        {
            "text": "This study aims to explore a range of issues beyond the clinical trial results around the potential future deployment of TACTs in the current scientific, economic and social contexts, in order to prepare their potential deployment in Asia and Africa.",
            "cite_spans": [],
            "ref_spans": [],
            "section": "Aims and objectives"
        },
        {
            "text": "Specifically, the project will (i) examine the feasibility of deployment of TACTs, potential barriers to its deployment, to assess whether mitigation of observed barriers is indicated, and how the identified barriers can feed into communication plans; (ii) identify the key ethical, social, practical, and regulatory issues of changing first-line treatment from ACTs to TACTs; (iii) explore possible strategies to facilitate the integration of TACT in public and private sector distribution chains; (iv) explore the readiness of public and private sector markets for a transition to TACTs and (v) explore end-user acceptability of TACTs.",
            "cite_spans": [],
            "ref_spans": [],
            "section": "Aims and objectives"
        },
        {
            "text": "The study is based on a social science methodology using in-depth interviews and focus group discussions (FGDs) with key stakeholders (Creswell, 2003) . The rationale for using these qualitative methods is to allow respondents to express their views on what they value as the key considerations that researchers and national regulatory authorities should focus on for a potential deployment of TACTs in Africa.",
            "cite_spans": [
                {
                    "start": 134,
                    "end": 150,
                    "text": "(Creswell, 2003)",
                    "ref_id": null
                }
            ],
            "ref_spans": [],
            "section": "Study design"
        },
        {
            "text": "The project is under the auspices of the DeTACT project with the case studies conducted in Burkina Faso and Nigeria in West Africa. Both countries have high malaria prevalence and are situated on the African continent, where ACTs are still effective. According to the 2019 World Malaria Report, Nigeria accounted 'for almost 24% of all global malaria deaths' (WHO, 2019). While TACTs may have limited added benefit to individual patients who could have received an ACT in the absence of artemisinin resistance in Africa; it may have a much larger benefit on the community by preventing or delaying the development of artemisinin-resistance. Moreover, health systems and malaria control policies vary significantly between both Nigeria and Burkina Faso, making both countries suitable for this multi-country assessment of the ethical and market related aspects of prospective deployment of TACTs.",
            "cite_spans": [],
            "ref_spans": [],
            "section": "Context and settings."
        },
        {
            "text": "Key stakeholders are selected from the two target countries; Burkina Faso and Nigeria and include representatives of national malaria control programs and regulatory agencies, public and private sector drug distributors and retailers, clinicians and prescribers. Finally, malaria researchers, parents, caregivers, and community leaders will be included in data collection.",
            "cite_spans": [],
            "ref_spans": [],
            "section": "Study participants"
        },
        {
            "text": "The inclusion criteria will be male or female, aged 18 years or above and the willingness of the participant to give informed consent for participation in the study.",
            "cite_spans": [],
            "ref_spans": [],
            "section": "Inclusion criteria"
        },
        {
            "text": "The participant may not be recruited into the study if they have been identified with intellectual and/or cognitive disability which may affect his/her ability to comprehend the information about the project.",
            "cite_spans": [],
            "ref_spans": [],
            "section": "Exclusion criteria"
        },
        {
            "text": "Selection of respondents. At the time of writing this manuscript, data collection was completed in Nigeria while the process was on hold in Burkina Faso following the COVID-19 pandemic. Key stakeholders were approached at different levels of the healthcare system and the antimalarial drug value chain within both target countries. Initial consultations were held with the country-specific principal investigators of the DeTACT project to identify specific districts and study sites with potential participants for interviews at each of the project sites. The national regulatory authorities were contacted via telephone and personally by the country teams in Nigeria and Burkina Faso.",
            "cite_spans": [],
            "ref_spans": [],
            "section": "Study respondents"
        },
        {
            "text": "Five categories of respondents were purposively sampled for interviews at each selected country, as outlined in Table 1 and  Table 2 . The total number of interviews will depend on when we reach data saturation, when no new ideas are emerging from the interviews. Measures were put in place to ensure heterogeneity within each category of data collection. Moreover, parents who were interviewed will not be included in the DeTACT clinical trials as their perception might be biased through information.",
            "cite_spans": [],
            "ref_spans": [
                {
                    "start": 112,
                    "end": 132,
                    "text": "Table 1 and  Table 2",
                    "ref_id": "TABREF0"
                }
            ],
            "section": "Study respondents"
        },
        {
            "text": "With the identification of the various stakeholders and key issues to be addressed by the different groups, draft tools for the in-depth interviews and FGDs as may be applicable to different respondents were developed. These were reviewed and validated by all the core team members, particularly the lead co-investigators from the study countries. These formed the generic data tools. Furthermore, prior to the study,, the tools were pre-tested in each of the study countries. This was to allow engaged research assistants to be trained, allow for local tweaking of the tools on how best the designed concepts can be communicated and align the tools properly to the local context of the target group.",
            "cite_spans": [],
            "ref_spans": [],
            "section": "Development and validation of data collection tools."
        },
        {
            "text": "For stakeholders at the community levels that cannot communicate effectively in English, the relevant tools were translated to the local language by language experts and back-translated to English to ensure consistency of the translation.",
            "cite_spans": [],
            "ref_spans": [],
            "section": "Development and validation of data collection tools."
        },
        {
            "text": "Qualitative data were collected from two main sources: semi-structured interviews and FGDs.",
            "cite_spans": [],
            "ref_spans": [],
            "section": "Data collection"
        },
        {
            "text": "A semi-structured interview guide was developed to cover topics related to current treatment guidelines, prescription preferences etc. The target groups for these semi-structured interviews are regulatory authorities, National Malaria Control Programs (NMCPs), wholesalers, distributors, prescribers, clinicians, malaria researchers and community members. Most of the interviews conducted so far lasted approximately 30-45 minutes and were conducted in a quiet place at the interviewee's request. Interviews were audio recorded, transcribed verbatim into English. If more time is required, the lead interviewer will ask the interviewee if he or she is willing to be interviewed for an additional 15 minutes; the time will only be extended if they agree. The investigator or study team member also recorded simultaneous written notes in English, which will serve as a critical back-up in case of audio recording failures. Recordings and transcripts are currently stored on a password-protected computer, and participants' identities will remain confidential in any reports of the data. Both verbatim translation and structure transcription of the interview will be conducted by a trained transcriber who is also exposed to research methodology and the principles of confidentiality. The transcribed notes will be shared to study team members only through very secured platforms and not through surface or electronic mail or any means that can compromise the confidentiality of the data.",
            "cite_spans": [],
            "ref_spans": [],
            "section": "Semi-structured interviews."
        },
        {
            "text": "We identified different groups of respondents including village health workers, parents, community advisory boards and community leaders at each of the selected countries for FGDs. The FGDs were made up of a group of 8 to 10 people who are brought together to discuss an issue of interest and lasted approximately 40 to 60 minutes. The technique is useful for gathering information about the way people behave and motivations that underlie these behaviours as the discussions allow for the expression of views, opinions and counter-opinions on attitudes, beliefs and practices. Our aim in these FGDs was to explore the collective views of these respondents on what issues need to be anticipated in the deployment of TACTs in Africa, specifically on issues related to health-seeking behaviour, community acceptance and adherence to treatment guidelines at the individual, household and health facility levels. Contents of implementation programs and user preferences were also discussed in the FGDs. The recorded and transcribed information will be managed as described for the semi-structured interviews.",
            "cite_spans": [],
            "ref_spans": [],
            "section": "FGDs."
        },
        {
            "text": "Data management Access to data. Direct access will be granted to authorised representatives from the sponsor, host institutions, research ethics committees, and regulatory authorities to ensure compliance with any existing regulations.",
            "cite_spans": [],
            "ref_spans": [],
            "section": "FGDs."
        },
        {
            "text": "To facilitate the management and analysis of the data, all the interviews were audio recorded and transcribed, where interviewees consent to the use of recorders. Where permission to record is not granted, notes were taken during the interview and an account of the interview were prepared immediately afterwards. Interviews conducted in the local languages of the research participants and French, in the case of Burkina Faso, are being translated into English by the local researchers or trained translators.",
            "cite_spans": [],
            "ref_spans": [],
            "section": "Data recording and record keeping."
        },
        {
            "text": "Data analysis will be an on-going process. We will follow the steps used across many different qualitative analytical traditions with a focus on thematic content analysis. This analysis will focus on an in-depth description and conceptual interpretation of the entire data set (Boyatzis, 1998; Fereday & Mair-Cochrane, 2006) . The analysis will initially be based on the themes used to guide data collection, and then augmented by themes emerging from the data. Qualitative analysis software NVivo version 12 (QSR NVivo) will be used to aid in the management and analysis of the data.",
            "cite_spans": [
                {
                    "start": 277,
                    "end": 293,
                    "text": "(Boyatzis, 1998;",
                    "ref_id": null
                },
                {
                    "start": 294,
                    "end": 324,
                    "text": "Fereday & Mair-Cochrane, 2006)",
                    "ref_id": null
                }
            ],
            "ref_spans": [],
            "section": "Data analysis"
        },
        {
            "text": "The main ethical issues in this study relate to privacy and confidentiality. Care was taken to maintain privacy during the audio recording of interviews and interactions with individual participants. The study will comply with the General Data Protection Regulation (GDPR), which requires that personal data must not be kept as identifiable data for longer than necessary for the purposes concerned. All completed interview transcripts, field notes, etc. will be de-identified and stored in a secure and access restricted place at the collection site on password secured servers for 5 years after study completion. All audio files will be destroyed when all the transcripts have been completed and verified. De-identified data will be stored digitally indefinitely as word documents which will be password protected.",
            "cite_spans": [],
            "ref_spans": [],
            "section": "Ethical and regulatory considerations"
        },
        {
            "text": "Approvals. The protocol, informed consent form, and participant information sheet were submitted to appropriate Research Ethics Committees in Oxford, Burkina Faso and Nigeria for approval. The investigators will submit and, where necessary, obtain approval from the above parties for all substantial amendments to the original approved documents.",
            "cite_spans": [],
            "ref_spans": [],
            "section": "Ethical and regulatory considerations"
        },
        {
            "text": "We designed an informed consent form to be administered to all prospective participants of the project after full disclosure of the study is read out to them from information sheets. Most of the interviews in Nigeria were conducted in English while those in Burkina were conducted in French. However, interviews with village health workers, parents and community members were conducted in local languages. Therefore, we translated the consent forms into the various local languages for the interviews with non-English speaking participants.",
            "cite_spans": [],
            "ref_spans": [],
            "section": "Informed consent."
        },
        {
            "text": "Each participant has the right to withdraw from the study at any time. In addition, the investigator may discontinue a participant from the study at any time if the investigator considers it necessary for any reason.",
            "cite_spans": [],
            "ref_spans": [],
            "section": "Discontinuation/withdrawal of participants from study."
        },
        {
            "text": "The audio recording will be deleted if the participant decides to withdraw mid-interview; the PIS for those participating in the FGDs states that if the participant withdraws mid-focus group, those portions of the audio recordings that capture his/her views will be deleted.",
            "cite_spans": [],
            "ref_spans": [],
            "section": "Discontinuation/withdrawal of participants from study."
        },
        {
            "text": "Participant confidentiality. All interviewees have been assigned a unique identifier (an ID number) which will be used on all transcripts. Permission will be asked to mention the affiliation of the respondent in the results of the study. This is particularly important for national level representatives such as NMCP members and drug authorities with specific expertise related to their position. Real personal names and names of places of residence will not be included in any data. A database linking real names and ID numbers will be stored securely and separately from the data and will be accessible only to the research team.",
            "cite_spans": [],
            "ref_spans": [],
            "section": "Discontinuation/withdrawal of participants from study."
        },
        {
            "text": "Data sharing and safety. Data collected for this study will be under the custodianship of MORU, will be de-identified and may be shared with other groups of researchers in accordance with the current data sharing policies.",
            "cite_spans": [],
            "ref_spans": [],
            "section": "Discontinuation/withdrawal of participants from study."
        },
        {
            "text": "The proposed project is considered a minimal risk study since it does not involve any invasive procedures. The study team does not expect any risks for participants beyond the minimal risks described above regarding confidentiality surrounding sensitive comments that might arise when participating in the qualitative interviews or group discussions. However, if there are any questions that the participant does not want to answer or discuss, these can be skipped and the interview or discussion can be stopped at any time.",
            "cite_spans": [],
            "ref_spans": [],
            "section": "Risks and benefits to research participation."
        },
        {
            "text": "Benefits to research participation. There are no direct benefits to the participants. Their contribution to the project will inform the development of key policies and recommendations that will help identify the key ethical and market-related issues that should be taken into consideration when deploying triple artemisinin-based combination therapies in Africa.",
            "cite_spans": [],
            "ref_spans": [],
            "section": "Risks and benefits to research participation."
        },
        {
            "text": "Compensation. We will follow the research practice at the various research sites and propose a token to be given to each participant in the interviews and FGDs. The proposed token will be discussed with the local ethics committee for approval before implementation.",
            "cite_spans": [],
            "ref_spans": [],
            "section": "Risks and benefits to research participation."
        },
        {
            "text": "A small token of appreciation will be provided in accordance with local customs (amount will be determined with local Ethics Committees). Snacks and drinks will be provided during interviews and FGDs where appropriate. Participants will be compensated for any actual transportation costs incurred to attend the interview or focus groups.",
            "cite_spans": [],
            "ref_spans": [],
            "section": "Risks and benefits to research participation."
        },
        {
            "text": "No data are associated with this article. emerging in Africa.",
            "cite_spans": [],
            "ref_spans": [],
            "section": "Data availability"
        },
        {
            "text": "There are five study objectives and it is not clear how they align with the study design. The authors could mention in the methods how each of the objectives will be addressed. For example, it is not clear how the ethical issues are captured in the protocol to provide meaningful insights at the completion of the study, and yet they are very important as the authors have highlighted.",
            "cite_spans": [],
            "ref_spans": [],
            "section": "Aims and objectives"
        },
        {
            "text": "Do any of the key stakeholders represent the ethical (and social) issues regarding the deployment of TACTs? It will be useful to clarify this because it is unclear. The sample lists in Tables 1 and 2 do not provide information on respondents with possible insights into the ethical and social issues. Could this be clarified?",
            "cite_spans": [],
            "ref_spans": [
                {
                    "start": 185,
                    "end": 199,
                    "text": "Tables 1 and 2",
                    "ref_id": "TABREF0"
                }
            ],
            "section": "Study participants"
        },
        {
            "text": "The study respondents are to be sampled from different levels of the health system. It will be helpful to explain the sampling approach up to that level of the health system in particular since at the sub-national level the study population is larger and geographically dispersed. In the purposive sampling was maximum variation considered or not? The details will help with reproducibility, which is one of the reasons the authors give for publishing the protocol. In that regard, the authors could outline what measures were put in place to \"ensure heterogeneity\". I would also suggest that the parameters used to identify specific districts and study sites should be provided because the details will help guide other similar studies. Tables 1 & 2 provide the total number of interviews and focus group discussions by respondent and the authors say that the number will depend on when they reach data saturation; does this mean that the numbers in column 3 in the tables are indicative and could be exceeded?",
            "cite_spans": [],
            "ref_spans": [],
            "section": "Study participants"
        },
        {
            "text": "Information on the group of respondents that were used to pre-test the study tools will help to understand the reliability of the tools.",
            "cite_spans": [],
            "ref_spans": [],
            "section": "Study participants"
        },
        {
            "text": "Exclusion criteria \"not be recruited to the study\" could be replace with \"not invited to participate in the study\". There is no mention in the methods how the authors plan to identify participants with intellectual and/or cognitive disability. Could this be provided in the methods?",
            "cite_spans": [],
            "ref_spans": [],
            "section": "Study participants"
        },
        {
            "text": "Information on the anticipated role of the sponsor in the study would be useful.",
            "cite_spans": [],
            "ref_spans": [],
            "section": "Data management"
        },
        {
            "text": "Discontinuation/withdrawal of participants from the study It will be informative for researchers to know what possible reasons the investigators could decide to discontinue a participant from the study and still maintain the objectivity of the study. When it is left as a generic statement, it leaves the reader puzzled why the investigator/s would decide to discontinue any participant that has consented to participate in the study.",
            "cite_spans": [],
            "ref_spans": [],
            "section": "Ethical and regulatory considerations"
        },
        {
            "text": "Summary recommendation",
            "cite_spans": [],
            "ref_spans": [],
            "section": "Ethical and regulatory considerations"
        }
    ],
    "bib_entries": {
        "BIBREF0": {
            "ref_id": "b0",
            "title": "Feasibility and acceptability of artemisinin-based combination therapy for the home management of malaria in four African sites",
            "authors": [
                {
                    "first": "I",
                    "middle": [
                        "O"
                    ],
                    "last": "Ajayi",
                    "suffix": ""
                },
                {
                    "first": "E",
                    "middle": [
                        "N"
                    ],
                    "last": "Browne",
                    "suffix": ""
                },
                {
                    "first": "B",
                    "middle": [],
                    "last": "Garshong",
                    "suffix": ""
                }
            ],
            "year": 2008,
            "venue": "Malar J",
            "volume": "7",
            "issn": "",
            "pages": "",
            "other_ids": {}
        }
    },
    "ref_entries": {
        "TABREF0": {
            "text": "Sample for semi-structured interviews and focus group discussions (FGDs) in Nigeria.",
            "latex": null,
            "type": "table"
        },
        "TABREF1": {
            "text": "Sample for semi-structured interviews and focus group discussions (FGDs) in Burkina Faso.",
            "latex": null,
            "type": "table"
        },
        "TABREF2": {
            "text": "PYC and Michael Parker conceived the idea for the study. PT reviewed the literature and developed the ethics study protocol together with the data collection tools. FH developed the Market-positioning protocol. The data collection tools were validated by the core research team during a face to face team meeting held in Ouagadougou, Burkina Faso in May 2019 and in Abuja, Nigeria in December 2019. All authors reviewed the manuscript, provided comments and approved the final version before submission.",
            "latex": null,
            "type": "table"
        }
    },
    "back_matter": [
        {
            "text": "This is an open access peer review report distributed under the terms of the Creative Commons Attribution License, which permits unrestricted use, distribution, and reproduction in any medium, provided the original work is properly cited. James K. Tibenderana 1 Malaria Consortium, London, UK 2 London School of Hygiene and Tropical Medicine, London, UK Summary The paper describes the protocol of an important study in readiness for the deployment of triple artemisinin combination therapies (TACTs) so that others have access to it and can attempt similar studies on the research questions. The study looks ahead at the ethical, social, regulatory and market position issues in readiness for the potential deployment of TACTs in Africa. The study comprises two main research questions on the ethical and market positioning around the deployment of TACTs. It is a qualitative study design using in-depth interviews and focus group discussions targeting key stakeholders in Burkina Faso and Nigeria.Contribution, significance and novelty The protocol provides a useful opportunity for other researchers to feedback, and use to carry out similar studies.",
            "cite_spans": [],
            "ref_spans": [],
            "section": "Open Peer Review"
        },
        {
            "text": "The study is very well written and clearly articulates the research questions, objectives and methodology. There are no major concerns regarding the paper Minor concerns There are some minor issues that the authors could address in the paper to improve its clarity. They are as follows:Introduction \"recent reports suggest that these gains may stand the risk of being reversed, particularly with the threat of resistance to ACTs spreading from Southeast Asia to Africa\": There are other threats such as insecticide resistance that are reversing the gains and good for the authors to mention so that the readers get a broad perspective on the potential threats. It is also worth noting that mechanisms of drug resistance to ACTs do include the chance of independent de novo mutations The paper should be approved with minor revisions.",
            "cite_spans": [],
            "ref_spans": [],
            "section": "Major concerns"
        },
        {
            "text": "Are the datasets clearly presented in a useable and accessible format? Not applicable Competing Interests: No competing interests were disclosed.",
            "cite_spans": [],
            "ref_spans": [],
            "section": "Are sufficient details of the methods provided to allow replication by others? Partly"
        },
        {
            "text": "Reviewer Report 03 June 2021 https://doi.org/10.21956/wellcomeopenres.17622.r43978 © 2021 Halsey E. This is an open access peer review report distributed under the terms of the Creative Commons Attribution License, which permits unrestricted use, distribution, and reproduction in any medium, provided the original work is properly cited.",
            "cite_spans": [],
            "ref_spans": [],
            "section": "I confirm that I have read this submission and believe that I have an appropriate level of expertise to confirm that it is of an acceptable scientific standard."
        },
        {
            "text": "Malaria Branch, US Centers for Disease Control and Prevention, Atlanta, GA, USA This is a well-written protocol, with a clear rationale and appropriate study design. The background and methods are concise and well thought-out. The authors should be commended on having the foresight to seek information on downstream issues that may arise after the conclusion of this potentially paradigm-shifting study. I have no major criticism or points needing clarification.Is the rationale for, and objectives of, the study clearly described? Yes",
            "cite_spans": [],
            "ref_spans": [],
            "section": "Eric Halsey"
        },
        {
            "text": "Are the datasets clearly presented in a useable and accessible format? Not applicable Competing Interests: No competing interests were disclosed.Reviewer Expertise: Malaria and antimalarial efficacy I confirm that I have read this submission and believe that I have an appropriate level of expertise to confirm that it is of an acceptable scientific standard.",
            "cite_spans": [],
            "ref_spans": [],
            "section": "Are sufficient details of the methods provided to allow replication by others? Yes"
        }
    ]
}