{
    "paper_id": "0a43f0629d8a5121829343a3ed6ea4bf8d7c288c",
    "metadata": {
        "title": "Antibody response to SARS-CoV-2 vaccines in patients with hematologic malignancies",
        "authors": [
            {
                "first": "L",
                "middle": [
                    "M"
                ],
                "last": "Saltzman",
                "suffix": "",
                "affiliation": {},
                "email": ""
            },
            {
                "first": "L",
                "middle": [
                    "A"
                ],
                "last": "Senefeld",
                "suffix": "",
                "affiliation": {},
                "email": ""
            },
            {
                "first": "J",
                "middle": [
                    "W"
                ],
                "last": "Johnson",
                "suffix": "",
                "affiliation": {},
                "email": ""
            },
            {
                "first": "P",
                "middle": [
                    "W"
                ],
                "last": "Degennaro",
                "suffix": "",
                "affiliation": {},
                "email": ""
            },
            {
                "first": "L",
                "middle": [
                    "J"
                ],
                "last": "Nichols",
                "suffix": "",
                "affiliation": {},
                "email": ""
            },
            {
                "first": "G",
                "middle": [
                    "L"
                ],
                "last": "",
                "suffix": "",
                "affiliation": {},
                "email": ""
            }
        ]
    },
    "abstract": [],
    "body_text": [
        {
            "text": "Patients with hematologic malignancies from the U.S. were recruited in this prospective cohort registry study (https://www.ciitizen.com/lls/; NCT04794387). Self-reported data were collected on demographic variables (age, sex, cancer diagnosis), treatments, prior COVID-19 infections, vaccine type and dates of administration, and side effects of vaccination. Samples were collected between March 12 and May 5, 2021. The antibody response 14 days after the second dose of the mRNA vaccines was evaluated in 1,495 participants. Semiquantitative anti-spike serologic testing was undertaken with the Roche Elecsys anti-SARS-CoV-2 S enzyme immunoassay with a positive cutoff of at least 0.8 U/mL, which tests for the receptor-binding domain of S and correlates with neutralizing immunity mediated by vaccination (Walsh et al., 2020) . The sensitivity and specificity of the immunoassay (96.6% and 100%, respectively) are excellent for the detection of spike antibodies in response to COVID-19 infections (FDA, 2020) . Patients positive for the nucleocapsid antibody (3.5%), indicating a prior exposure to SARS-CoV-2, were removed, leaving 1,445 participants for data analysis. This study was approved by the Western Institutional Review Board, and participants provided informed consent electronically.",
            "cite_spans": [
                {
                    "start": 807,
                    "end": 827,
                    "text": "(Walsh et al., 2020)",
                    "ref_id": null
                },
                {
                    "start": 979,
                    "end": 1010,
                    "text": "COVID-19 infections (FDA, 2020)",
                    "ref_id": null
                }
            ],
            "ref_spans": [],
            "section": ""
        },
        {
            "text": "The proportion of patients who developed a positive antibody response to the anti-S antibody are reported with point estimates, and confidence intervals were calculated using the Wilson method. We used a logistic regression approach to estimate the antibody response to a two-dose series of SARS-CoV-2 mRNA vaccines with or without adjustment for putative confounding variables. Data were used as reported, and no imputation was performed on missing data. All tests were two-sided, with  = 0.05. Analyses were performed with the use of R software (R Core Team).",
            "cite_spans": [],
            "ref_spans": [],
            "section": ""
        },
        {
            "text": "Serological analysis was done across a broad range of hematologic malignancies. The demographic of the population is shown in Table S1. The median age was 68 (range, 16-110 years), with more females (898, 60.2%), and most patients were Caucasian (1,375 patients, 95.2%). mRNA-1246 and BNT162b2 were given to 652 and 793 patients, respectively. Median days after the second vaccination were 41 and 42 for the mRNA-1246 and BNT162b2 vaccines, respectively.",
            "cite_spans": [],
            "ref_spans": [],
            "section": ""
        },
        {
            "text": "Within B cell malignancies, seronegativity was observed in almost all non-Hodgkin lymphoma subtypes studied, while all but one of 64 Hodgkin lymphoma patients were seropositive (Table S1 ). Seronegativity was found in patients with mantle cell lymphoma (MCL; 56%), marginal zone lymphoma (MZL; 38%), chronic lymphocytic leukemia (CLL; 36%), Waldenstrom's macroglobulinemia (WM; 26%), follicular lymphoma (FL; 22%), and diffuse large B cell lymphoma (DLBCL; 21%). Seronegativity was observed in patients who received no therapy in the past 2 years, as well in patients who have received a variety of B cell-suppressive therapies, including anti-CD20 mAbs, Bruton tyrosine kinases inhibitors (BTKi), and CD19 CAR T therapy (Table S1 ).",
            "cite_spans": [],
            "ref_spans": [
                {
                    "start": 177,
                    "end": 186,
                    "text": "(Table S1",
                    "ref_id": null
                },
                {
                    "start": 721,
                    "end": 730,
                    "text": "(Table S1",
                    "ref_id": null
                }
            ],
            "section": ""
        },
        {
            "text": "In contrast, the seronegative rate was 9%, 12%, and 2.9% in patients with acute myeloid leukemia (AML), acute lymphocytic leukemia (ALL), or chronic myeloid leukemia (CLL), respectively. Only 5.3% of patients with multiple myeloma (MM) were seronegative, while no patients with smoldering multiple myeloma were seronegative. Eleven patients received CAR T cell therapy. Six of the seven patients who received CD19 CAR T therapy for CLL, DLBCL, or FL were seronegative. The one CD19-CAR T-treated patient who was highly seropositive reported that he had relapsed CLL disease just prior to vaccination. In contrast, five patients with MM received either BCMA or CD138 CAR T therapy. All but one produced a robust antibody response that exceeded 200 U/mL. The exceptional patient who produced 1 U/mL anti-S antibodies was evaluated 14 days after the second vaccination, which may be insufficient time to generate an antibody response.",
            "cite_spans": [],
            "ref_spans": [],
            "section": ""
        },
        {
            "text": "To examine if responses between the two mRNA vaccines differ, we limited our analysis to seronegative tumor types with a large sample size (MCL, FL, and WM, n = 845), since any potential difference would not be detectable in patients who had the maximal assay response. In an unadjusted logistic regression analysis, patients were significantly more likely to have an immune response to the mRNA-1273 vaccine series compared to the BNT162b2 vaccine series (odds ratio [OR], 1.50; 95% confidence interval, CI, 1.12-2.00; p = 0.007) (Table S2 ). This finding was further supported by a regression model with adjustments for age, cancer type, gender, vaccine type, and cancer group using two different models (OR, 1.48; CI, 1.06-2.06; p = 0.021; and OR, 1.73; CI, 1.24-2.42; p = 0.001).",
            "cite_spans": [],
            "ref_spans": [
                {
                    "start": 531,
                    "end": 540,
                    "text": "(Table S2",
                    "ref_id": null
                }
            ],
            "section": ""
        },
        {
            "text": "In this analysis, approximately 75% of all patients with hematologic malignancies produce antibodies to the SARS-CoV-2 mRNA vaccines. Patients with the most common B cell malignancies have the lowest rate of seropositivity (range: 44%-79%). It has been reported that the overall seroconversion rate in hematologic patients is 46%-85% after two full doses of SARS-CoV-2 vaccines (Griffiths and Sega, 2021). In contrast, the serological response was 100% in immunocompetent age-and sex-matched controls, using the same assay in this study (Herishanu et al., 2021) .",
            "cite_spans": [
                {
                    "start": 537,
                    "end": 561,
                    "text": "(Herishanu et al., 2021)",
                    "ref_id": "BIBREF3"
                }
            ],
            "ref_spans": [],
            "section": ""
        },
        {
            "text": "Of the 36% of CLL patients who failed to generate spike antibodies, 66 out of 235 (28%) patients reported that they had no therapy in the past 2 years, consistent with another report in which smaller cohorts of CLL patients were examined (Herishanu et al., 2021) . Therefore, the disease itself may impair B cell function, which underscores the abnormal humoral and cellular immune responses previously reported in CLL patients. Higher seronegative rates were observed in patients treated with only BTKi, anti-CD20 mAb therapy, or combinations of these therapies or with venetoclax (a BCL2 inhibitor) compared to those patients who have received no therapy. Consistent with this observation, the serological response to the hepatitis vaccine was nearly absent in BTKi-treated CLL patients compared to a 28% response rate in treatment-naive patients (Pleyer et al., 2021) . While the use of venetoclax may be associated with seronegativity, it was given when other therapeutics were being used.",
            "cite_spans": [
                {
                    "start": 238,
                    "end": 262,
                    "text": "(Herishanu et al., 2021)",
                    "ref_id": "BIBREF3"
                },
                {
                    "start": 849,
                    "end": 870,
                    "text": "(Pleyer et al., 2021)",
                    "ref_id": "BIBREF4"
                }
            ],
            "ref_spans": [],
            "section": ""
        },
        {
            "text": "Treatment regimens containing anti-CD20 mAbs or CD19 CAR T are used to treat patients with FL, MCL, DLBCL, CLL, and WM. Anti-CD20 mAbs can cause depletion of normal B cells typically lasting about 6-12 months and can suppress the response to previously developed vaccines (Yri et al., 2011) , and CD19 CAR T can suppress normal B cells for long duration after dosing. The use of these two therapies explains why many B cell malignancy patients were seronegative after SARS-CoV-2 vaccination. In contrast, four of the five patients treated with BCMA or CD138 CAR T therapy for MM were highly seropositive. This may indicate that BCMA CAR T cells may not persist for long periods of time in some patients (Munshi et al., 2021) , thereby permitting a robust vaccine response. Alternatively, BCMA CAR T does not deplete cells that produce anti-S antibodies.",
            "cite_spans": [
                {
                    "start": 272,
                    "end": 290,
                    "text": "(Yri et al., 2011)",
                    "ref_id": null
                },
                {
                    "start": 703,
                    "end": 724,
                    "text": "(Munshi et al., 2021)",
                    "ref_id": null
                }
            ],
            "ref_spans": [],
            "section": ""
        },
        {
            "text": "In this study, mRNA-1246 induced higher seropositive rates compared to BNT162b2, consistent with a study in patients with solid organ transplant (Boyarsky et al., 2021) . Unlike the nearly identical efficacy of the mRNA vaccines in healthy volunteers (Creech et al., 2021) , the differences were detected in a population that had a partial response to each vaccine. This may be attributed to differences in the amount of spike mRNA in mRNA-1246 (100 µg) and BNT162b2 (30 µg) per dose. Other differences are the exact coding sequence of the mRNA or lipid composition of the vaccines, which may alter penetration of the mRNA into host cells, as well as different dosing schedules.",
            "cite_spans": [
                {
                    "start": 145,
                    "end": 168,
                    "text": "(Boyarsky et al., 2021)",
                    "ref_id": "BIBREF1"
                },
                {
                    "start": 251,
                    "end": 272,
                    "text": "(Creech et al., 2021)",
                    "ref_id": "BIBREF0"
                }
            ],
            "ref_spans": [],
            "section": ""
        },
        {
            "text": "We plan to use this database to understand the response to vaccination in longitudinal studies, as well as to examine the patients' long-term outcomes. These patients may benefit from new therapeutic strategies to avoid COVID-19 infections including booster vaccinations, use of alternative vaccine formats (i.e., attenuated virus), convalescent plasma, or antibody cocktails. The suggested difference in vaccine response to mRNA-1273 and BNT162b2 vaccines may guide these strategies. While many patients with hematologic malignancies fail to mount a full antibody response, the safety profiles of SARS-CoV-2 mRNA vaccines are similar compared to age-matched healthy individuals (https://www.lls.org/news/covid-19-vaccine-safety-among-blood-cancer-patients). Therefore, patients with blood cancer are encouraged to get the SARS-CoV-2 vaccines as recommended by NCCN guidelines.",
            "cite_spans": [],
            "ref_spans": [],
            "section": ""
        },
        {
            "text": "This study has two important limitations. Although there is a good correlation of antibody production, neutralization titers, and infection protection (Walsh et al., 2020) , immune protection in seronegative patients could be mediated by T cells. A reduced T cell response, compared to normal healthy individuals, has been detected in patients with hematologic malignancies after SARS-CoV-2 vaccination (Monin et al., 2021) . Future studies will investigate the relationships between these immunological endpoints.",
            "cite_spans": [
                {
                    "start": 151,
                    "end": 171,
                    "text": "(Walsh et al., 2020)",
                    "ref_id": null
                },
                {
                    "start": 403,
                    "end": 423,
                    "text": "(Monin et al., 2021)",
                    "ref_id": null
                }
            ],
            "ref_spans": [],
            "section": ""
        },
        {
            "text": "A second limitation is that the disease and treatments are self-reported and have not been verified using medical records. We believe the rapid participation of a large cohort of patients in this study underscores the concern in the blood cancer community about vaccine efficacy and the power of patients wishing to participate in scientific studies.",
            "cite_spans": [],
            "ref_spans": [],
            "section": ""
        },
        {
            "text": "In summary, many patients with hematologic malignancies are at risk of not producing antibodies after two doses of the mRNA SARS-CoV-2 vaccines. Differences in antibody responses between the two mRNA vaccine series are detected in patient populations that have a high seronegative rate. Providers should be aware that a substantial subset of vaccinated blood cancer patients may be at high risk of breakthrough COVID-19 infections. Further studies are needed to assess the status of the immune system in seronegative patients and develop options for protecting this vulnerable population.",
            "cite_spans": [],
            "ref_spans": [],
            "section": ""
        }
    ],
    "bib_entries": {
        "BIBREF0": {
            "ref_id": "b0",
            "title": "SARS-coV-2 vaccines",
            "authors": [
                {
                    "first": "C",
                    "middle": [
                        "B"
                    ],
                    "last": "&lt;jrn&gt;creech",
                    "suffix": ""
                },
                {
                    "first": "S",
                    "middle": [
                        "C"
                    ],
                    "last": "Walker",
                    "suffix": ""
                },
                {
                    "first": "R",
                    "middle": [
                        "J"
                    ],
                    "last": "Samuels",
                    "suffix": ""
                }
            ],
            "year": 2021,
            "venue": "JAMA",
            "volume": "325",
            "issn": "",
            "pages": "",
            "other_ids": {
                "DOI": [
                    "1318-1320.10.1001/jama.2021.3199.</jrn>"
                ]
            }
        },
        "BIBREF1": {
            "ref_id": "b1",
            "title": "Immunogenicity of a single dose of SARS-CoV-2 messenger RNA vaccine series in solid organ transplant recipients",
            "authors": [
                {
                    "first": "B",
                    "middle": [
                        "J"
                    ],
                    "last": "&lt;jrn&gt;boyarsky",
                    "suffix": ""
                },
                {
                    "first": "W",
                    "middle": [
                        "A"
                    ],
                    "last": "Werbel",
                    "suffix": ""
                },
                {
                    "first": "R",
                    "middle": [
                        "K"
                    ],
                    "last": "Avery",
                    "suffix": ""
                },
                {
                    "first": "A",
                    "middle": [
                        "A R"
                    ],
                    "last": "Tobian",
                    "suffix": ""
                },
                {
                    "first": "A",
                    "middle": [
                        "B"
                    ],
                    "last": "Massie",
                    "suffix": ""
                },
                {
                    "first": "D",
                    "middle": [
                        "L"
                    ],
                    "last": "Segev",
                    "suffix": ""
                },
                {
                    "first": "J",
                    "middle": [
                        "M"
                    ],
                    "last": "Garonzik-Wang",
                    "suffix": ""
                }
            ],
            "year": 2021,
            "venue": "JAMA",
            "volume": "325",
            "issn": "",
            "pages": "1784--1786",
            "other_ids": {
                "DOI": [
                    "10.1001/jama.2021.4385"
                ]
            }
        },
        "BIBREF3": {
            "ref_id": "b3",
            "title": "Safety and immunogenicity of one versus two doses of the COVID-19 vaccine BNT162b2 for patients with cancer: interim analysis of a prospective observational study",
            "authors": [
                {
                    "first": "E",
                    "middle": [
                        "A"
                    ],
                    "last": "&lt;jrn&gt;griffiths",
                    "suffix": ""
                },
                {
                    "first": "B",
                    "middle": [
                        "H"
                    ],
                    "last": "Segal",
                    "suffix": ""
                },
                {
                    "first": "Y",
                    "middle": [],
                    "last": "; &lt;/Jrn&gt; &lt;jrn&gt;herishanu",
                    "suffix": ""
                },
                {
                    "first": "I",
                    "middle": [],
                    "last": "Avivi",
                    "suffix": ""
                },
                {
                    "first": "A",
                    "middle": [],
                    "last": "Aharon",
                    "suffix": ""
                },
                {
                    "first": "G",
                    "middle": [],
                    "last": "Shefer",
                    "suffix": ""
                },
                {
                    "first": "S",
                    "middle": [],
                    "last": "Levi",
                    "suffix": ""
                },
                {
                    "first": "Y",
                    "middle": [],
                    "last": "Bronstein",
                    "suffix": ""
                },
                {
                    "first": "M",
                    "middle": [],
                    "last": "Morales",
                    "suffix": ""
                },
                {
                    "first": "T",
                    "middle": [],
                    "last": "Ziv",
                    "suffix": ""
                },
                {
                    "first": "Y",
                    "middle": [],
                    "last": "Shorer Arbel",
                    "suffix": ""
                },
                {
                    "first": "L",
                    "middle": [],
                    "last": "Scarfò",
                    "suffix": ""
                }
            ],
            "year": 2021,
            "venue": "Immune responses to COVID-19 vaccines in patients with cancer: promising results and a note of caution",
            "volume": "39",
            "issn": "",
            "pages": "705--716",
            "other_ids": {
                "DOI": [
                    "bxs.10.1016/j.ccell.2021.07.001"
                ]
            }
        },
        "BIBREF4": {
            "ref_id": "b4",
            "title": "Rituximab blocks protective serologic response to influenza A (H1N1) 2009 vaccination in lymphoma patients during or within 6 months after treatment",
            "authors": [
                {
                    "first": "C",
                    "middle": [],
                    "last": "&lt;jrn&gt;pleyer",
                    "suffix": ""
                },
                {
                    "first": "M",
                    "middle": [
                        "A"
                    ],
                    "last": "Ali",
                    "suffix": ""
                },
                {
                    "first": "J",
                    "middle": [
                        "I"
                    ],
                    "last": "Cohen",
                    "suffix": ""
                },
                {
                    "first": "X",
                    "middle": [],
                    "last": "Tian",
                    "suffix": ""
                },
                {
                    "first": "S",
                    "middle": [],
                    "last": "Soto",
                    "suffix": ""
                },
                {
                    "first": "I",
                    "middle": [
                        "E"
                    ],
                    "last": "Ahn",
                    "suffix": ""
                },
                {
                    "first": "E",
                    "middle": [
                        "M"
                    ],
                    "last": "Gaglione",
                    "suffix": ""
                },
                {
                    "first": "P",
                    "middle": [],
                    "last": "Nierman",
                    "suffix": ""
                },
                {
                    "first": "G",
                    "middle": [
                        "E"
                    ],
                    "last": "Marti",
                    "suffix": ""
                },
                {
                    "first": "C",
                    "middle": [],
                    "last": "Hesdorffer",
                    "suffix": ""
                }
            ],
            "year": 2011,
            "venue": "N. Engl. J. Med",
            "volume": "137",
            "issn": "",
            "pages": "6769--6771",
            "other_ids": {
                "DOI": [
                    "10.1182/blood.2020008758.PubMed</jrn><jrn>Walsh"
                ]
            }
        }
    },
    "ref_entries": {},
    "back_matter": [
        {
            "text": "This study was supported by the Leukemia & Lymphoma Society. We thank our generous donors and patients who have participated in the LLS National Registry, a project of the Michael J. Garil Data Collaborative. We thank Ciitizen and LabCorp for their collaboration in this effort and Brian Chadwick, Neil Kay, and Renu Jain for their contribution to this research effort. We especially thank the patient participants.",
            "cite_spans": [],
            "ref_spans": [],
            "section": "Acknowledgments"
        },
        {
            "text": "The authors declare no competing interests.",
            "cite_spans": [],
            "ref_spans": [],
            "section": "DECLARATIon of interests"
        }
    ]
}