{
    "paper_id": "0a447cd54d4d6e0803127673479fe4aa0876de7f",
    "metadata": {
        "title": "Journal Pre-proof Correlation of hemoglobin A 1c and outcomes in patients hospitalized with COVID-19 Correlation of hemoglobin A1c and outcomes in patients hospitalized with COVID-19 Running title: Hemoglobin A1c and Outcomes in COVID-19 Correlation of hemoglobin A1c and outcomes in patients hospitalized with COVID-19",
        "authors": [
            {
                "first": "Amy",
                "middle": [
                    "J"
                ],
                "last": "Patel",
                "suffix": "",
                "affiliation": {},
                "email": ""
            },
            {
                "first": "Stanislaw",
                "middle": [
                    "P"
                ],
                "last": "Klek",
                "suffix": "",
                "affiliation": {},
                "email": ""
            },
            {
                "first": "Virginia",
                "middle": [],
                "last": "Peragallo-Dittko",
                "suffix": "",
                "affiliation": {},
                "email": ""
            },
            {
                "first": "Michael",
                "middle": [],
                "last": "Bc-Adm",
                "suffix": "",
                "affiliation": {},
                "email": ""
            },
            {
                "first": "Eric",
                "middle": [],
                "last": "Goldstein",
                "suffix": "",
                "affiliation": {},
                "email": ""
            },
            {
                "first": "Victoria",
                "middle": [],
                "last": "Burdge",
                "suffix": "",
                "affiliation": {},
                "email": ""
            },
            {
                "first": "",
                "middle": [],
                "last": "Nadile",
                "suffix": "",
                "affiliation": {},
                "email": ""
            },
            {
                "first": "Julia",
                "middle": [],
                "last": "Ba",
                "suffix": "",
                "affiliation": {},
                "email": ""
            },
            {
                "first": "",
                "middle": [],
                "last": "Ramadhar",
                "suffix": "",
                "affiliation": {},
                "email": ""
            },
            {
                "first": "Shahidul",
                "middle": [],
                "last": "Ba",
                "suffix": "",
                "affiliation": {},
                "email": ""
            },
            {
                "first": "Gary",
                "middle": [
                    "D"
                ],
                "last": "Islam",
                "suffix": "",
                "affiliation": {},
                "email": ""
            },
            {
                "first": "",
                "middle": [],
                "last": "Rothberger",
                "suffix": "",
                "affiliation": {},
                "email": ""
            },
            {
                "first": "",
                "middle": [],
                "last": "Bc-Adm",
                "suffix": "",
                "affiliation": {
                    "laboratory": "",
                    "institution": "NYU Long Island School of Medicine",
                    "location": {
                        "settlement": "Mineola"
                    }
                },
                "email": ""
            },
            {
                "first": "Michael",
                "middle": [],
                "last": "Goldstein",
                "suffix": "",
                "affiliation": {},
                "email": ""
            },
            {
                "first": "Eric",
                "middle": [],
                "last": "Burdge",
                "suffix": "",
                "affiliation": {},
                "email": ""
            },
            {
                "first": "Victoria",
                "middle": [],
                "last": "Nadile",
                "suffix": "",
                "affiliation": {},
                "email": ""
            },
            {
                "first": "",
                "middle": [],
                "last": "Ba",
                "suffix": "",
                "affiliation": {},
                "email": ""
            },
            {
                "first": "Julia",
                "middle": [],
                "last": "Ramadhar",
                "suffix": "",
                "affiliation": {},
                "email": ""
            },
            {
                "first": "Shahidul",
                "middle": [],
                "last": "Islam",
                "suffix": "",
                "affiliation": {},
                "email": ""
            },
            {
                "first": "",
                "middle": [],
                "last": "Drph",
                "suffix": "",
                "affiliation": {
                    "laboratory": "",
                    "institution": "NYU Long Island School of Medicine",
                    "location": {
                        "settlement": "Mineola"
                    }
                },
                "email": ""
            },
            {
                "first": "Gary",
                "middle": [
                    "D"
                ],
                "last": "Rothberger",
                "suffix": "",
                "affiliation": {},
                "email": ""
            },
            {
                "first": "",
                "middle": [],
                "last": "Adm",
                "suffix": "",
                "affiliation": {
                    "laboratory": "",
                    "institution": "NYU Long Island School of Medicine",
                    "location": {
                        "settlement": "Mineola"
                    }
                },
                "email": ""
            }
        ]
    },
    "abstract": [
        {
            "text": "Conflict of Interest Disclosure: The authors have no conflicts of interest to declare. Funding: None J o u r n a l P r e -p r o o f Correlation of hemoglobin A1c and outcomes in patients hospitalized with COVID-19 26 27 28 29 30 31 32 33 34 35 36 37 J o u r n a l P r e -p r o o f ABSTRACT 1 2",
            "cite_spans": [],
            "ref_spans": [],
            "section": "Abstract"
        }
    ],
    "body_text": [
        {
            "text": "Patients with diabetes comprise approximately one-third of confirmed cases of 19. 4 Several studies have demonstrated that patients with diabetes are at increased risk 13 of severe disease and poor outcomes. [6] [7] [8] In addition, elevated levels of glycemia during 14 hospital admission has been demonstrated to correlate with poor outcomes. 9,10 The 15 correlation between hemoglobin A1c (HbA1c) and outcomes are less clear. 11 Several 16 studies reported an association between higher HbA1c values and worse outcomes in 17 COVID-19, [12] [13] [14] [15] although all had small samples sizes and two of these studies defined 18 elevated HbA1c as >6.5% (>48 mmol/mol) without stratifying these patients further. Other 19 studies have found no association between HbA1c and outcomes in patients with 19, although several are limited by incomplete data. [16] [17] [18] [19] Our study was designed 21 to specifically investigate the correlation between overall glycemia prior to This is a retrospective, single-center, observational study of patients with diabetes 1 mellitus who had a confirmed case of SARS-CoV-2 on polymerase chain reaction testing 2 of a nasopharyngeal sample and required hospital admission. Our institutional review 3 board approved this study and the requirement for informed consent was waived. All age would affect outcomes. Results were similar to those from the entire cohort (Table   20 3).",
            "cite_spans": [
                {
                    "start": 208,
                    "end": 211,
                    "text": "[6]",
                    "ref_id": null
                },
                {
                    "start": 212,
                    "end": 215,
                    "text": "[7]",
                    "ref_id": null
                },
                {
                    "start": 216,
                    "end": 219,
                    "text": "[8]",
                    "ref_id": null
                },
                {
                    "start": 268,
                    "end": 270,
                    "text": "14",
                    "ref_id": null
                },
                {
                    "start": 538,
                    "end": 542,
                    "text": "[12]",
                    "ref_id": null
                },
                {
                    "start": 543,
                    "end": 547,
                    "text": "[13]",
                    "ref_id": null
                },
                {
                    "start": 548,
                    "end": 552,
                    "text": "[14]",
                    "ref_id": null
                },
                {
                    "start": 553,
                    "end": 557,
                    "text": "[15]",
                    "ref_id": null
                },
                {
                    "start": 854,
                    "end": 858,
                    "text": "[16]",
                    "ref_id": null
                },
                {
                    "start": 859,
                    "end": 863,
                    "text": "[17]",
                    "ref_id": null
                },
                {
                    "start": 864,
                    "end": 868,
                    "text": "[18]",
                    "ref_id": null
                },
                {
                    "start": 869,
                    "end": 873,
                    "text": "[19]",
                    "ref_id": null
                }
            ],
            "ref_spans": [
                {
                    "start": 1403,
                    "end": 1414,
                    "text": "(Table   20",
                    "ref_id": "TABREF11"
                }
            ],
            "section": ""
        },
        {
            "text": "[Insert Table 3 ]",
            "cite_spans": [],
            "ref_spans": [
                {
                    "start": 8,
                    "end": 15,
                    "text": "Table 3",
                    "ref_id": "TABREF12"
                }
            ],
            "section": "21"
        },
        {
            "text": "In order to confirm that our observed outcomes were not a function of the quartile ranges 23 that were used for this study, we analyzed HbA1c as a continuous variable and assessed 24 its relationship to outcomes ( Hyperglycemia also has a direct impact on airway epithelia and lung integrity, rendering 8 quicker respiratory decline in this sub-population. 22 Our study demonstrates that long-9 term glycemia, as measured by HbA1c, does not predict worse outcomes in patients 10 hospitalized with COVID-19. Among the total cohort of 506 patients with an 11 overall mortality rate of 25%, there was no statistically significant increase in the 12 frequency of primary or secondary outcomes in higher quartiles of HbA1c.",
            "cite_spans": [
                {
                    "start": 357,
                    "end": 359,
                    "text": "22",
                    "ref_id": null
                }
            ],
            "ref_spans": [],
            "section": "22"
        },
        {
            "text": "It is important to note that the mean age of patients in quartile 4 was significantly lower in 15 comparison to quartiles 1 through 3. It has been established that age is a key prognostic 16 determinant of outcomes in COVID-19 due to higher susceptibility to the virus and 17 severity of complications in the elderly population. 23 One may attribute the lack of worse 18 outcomes in patients with the highest HbA1c levels to younger age. However, analysis of 19 patients >65 years old failed to reveal any worse outcomes in patients with higher 20 HbA1c levels.",
            "cite_spans": [],
            "ref_spans": [],
            "section": "14"
        },
        {
            "text": "Previously undiagnosed diabetes is common in hospitalized patients with COVID-19. A 23 recent meta-analysis including more than 3700 patients showed a 14.4% of hospitalized 24 patients had newly diagnosed diabetes. 24 In our cohort, nearly 26% of all patients had 25 previously undiagnosed diabetes, similar to the results reported by Li et al. 25 We noted 26 that patients in quartile 4 were less likely to have a new diagnosis of diabetes compared to patients in quartiles 1 and 2. This may have a protective impact on the outcomes of 1 patients in quartile 4, as patients with newly diagnosed diabetes have worse COVID-19-2 related outcomes than those with pre-existing diabetes. 26, 27 Patients in quartile 4 were 3 also more likely to be on long-term insulin therapy, and this did not impact outcomes 4 despite prior studies reporting long-term insulin use to be associated with worse 5 outcomes in hospitalized patients with Metformin use was also more 6 common in patients in quartile 4, and metformin has been associated with improved 7 survival in patients with diabetes and COVID-19. 28",
            "cite_spans": [
                {
                    "start": 345,
                    "end": 347,
                    "text": "25",
                    "ref_id": null
                },
                {
                    "start": 683,
                    "end": 686,
                    "text": "26,",
                    "ref_id": null
                },
                {
                    "start": 687,
                    "end": 689,
                    "text": "27",
                    "ref_id": null
                }
            ],
            "ref_spans": [],
            "section": "22"
        },
        {
            "text": "We observed a lower frequency of AKI in quartile 4 compared to other quartiles, both in 10 the entire cohort and in patients >65 years of age. Patients in quartile 4 were younger and 11 had a lower incidence of CKD compared to other quartiles, making them less prone to 12 developing AKI. However, when adjusted for age and the presence of comorbidities, 13 including CKD, HbA1c >9% (75 mmol/mol) was still associated with a lower risk of AKI 14 (appendix). These results are in contrast to the results of a study by Khalili et al. 29 , who 15 reported HbA1c to be a risk factor for development of AKI in patients hospitalized with 16 COVID-19. Further analysis of our data revealed that CKD was a much stronger risk factor 17 for AKI than HbA1c, and when analyzing patients in quartile 4, CKD was associated with 18 AKI while HbA1c was not (appendix). While our data indicate that HbA1c is negatively 19 associated with AKI, it is likely that our observed rates of AKI in quartile 4 are influenced 20 more by the lower rate of CKD in this group.",
            "cite_spans": [
                {
                    "start": 517,
                    "end": 534,
                    "text": "Khalili et al. 29",
                    "ref_id": null
                }
            ],
            "ref_spans": [],
            "section": "22"
        },
        {
            "text": "The absence of worse outcomes in patients with higher levels of HbA1c are surprising.",
            "cite_spans": [],
            "ref_spans": [],
            "section": "22"
        },
        {
            "text": "Diabetes is a known risk factor for worse outcomes in COVID-19 as well as previous diabetes who had early hyperglycemia (glucose >180 mg/dL) in the first two days of ICU inflammatory cytokines and coagulation factors, theorizing the mechanism behind 1 improvement in outcomes. 39 Although admission glucose levels were recorded in our 2 study, we did not evaluate overall inpatient glycemia and its effect on primary and 3 secondary outcomes. This would be an important focus of future studies.",
            "cite_spans": [
                {
                    "start": 277,
                    "end": 279,
                    "text": "39",
                    "ref_id": null
                }
            ],
            "ref_spans": [],
            "section": "23"
        },
        {
            "text": "Our study holds clinical significance when determining treatment plans and assessing 6 mortality risk in hospitalized patients. Our findings are indeed reassuring for patients with 7 a history of diabetes, specifically those with suboptimal chronic glycemia.",
            "cite_spans": [],
            "ref_spans": [],
            "section": "5"
        },
        {
            "text": "Nonetheless, optimal glycemic management during the course of illness remains an 9 important aspect of the treatment of COVID-19 to limit the incidence of poor outcomes.",
            "cite_spans": [],
            "ref_spans": [],
            "section": "8"
        },
        {
            "text": "The main strengths of our study are a robust sample size and the availability 12 of HbA1c levels for all subjects in this study. The latter differentiates our study from the 13 previous studies that found no correlation between HbA1c and outcomes in COVID-19. WBC, x10 9 /L 7.6 (5.8 -10.2) 7.0 (5.5 -9.4) 7.4 (5.7 -9.4) 7.6 (5.8 -10.6) 7.4 (5.7 -9.7) 0.338 ANC, /mm 3 6.0 (4.4 -8.5) 5.4 (3.6 -7.9) 5.6 (4.3 -7.5) 6.1 (4.2 -8.5) 5.8 (4. J o u r n a l P r e -p r o o f J o u r n a l P r e -p r o o f ",
            "cite_spans": [],
            "ref_spans": [],
            "section": "11"
        }
    ],
    "bib_entries": {
        "BIBREF3": {
            "ref_id": "b3",
            "title": "Data are presented as median (interquartile range) or frequency (%). BMI, body mass index; CVD, cardiovascular disease; CKD, chronic kidney disease",
            "authors": [],
            "year": null,
            "venue": "",
            "volume": "",
            "issn": "",
            "pages": "",
            "other_ids": {}
        },
        "BIBREF7": {
            "ref_id": "b7",
            "title": "P-values are from Kruskal-Wallis test for continuous variables and Chi-Square or Fisher's exact test for categorical variables",
            "authors": [],
            "year": null,
            "venue": "",
            "volume": "",
            "issn": "",
            "pages": "",
            "other_ids": {}
        },
        "BIBREF8": {
            "ref_id": "b8",
            "title": "ESR, mm/hr 73",
            "authors": [],
            "year": null,
            "venue": "",
            "volume": "73",
            "issn": "",
            "pages": "51--103",
            "other_ids": {}
        },
        "BIBREF12": {
            "ref_id": "b12",
            "title": "pg/mL 13",
            "authors": [],
            "year": null,
            "venue": "",
            "volume": "12",
            "issn": "",
            "pages": "5--40",
            "other_ids": {}
        }
    },
    "ref_entries": {
        "FIGREF0": {
            "text": "acute respiratory syndrome coronavirus 2 (SARS-CoV-2). Infection with this 3 virus causes a respiratory disease known as coronavirus disease 2019 (COVID-19). 1 4 There is a spectrum of disease severity in patients with COVID-19, including 5 asymptomatic carriers, mild upper respiratory symptoms, and severe systemic symptoms 6 including acute respiratory failure, thrombophilia, and death. 2 Several risk factors for 7 severe disease have been determined, including increasing age, compromised immune 8 function and preexisting conditions such as cardiovascular disease,",
            "latex": null,
            "type": "figure"
        },
        "FIGREF1": {
            "text": "patients were admitted to the general medical floor or intensive care unit (ICU) at our 5 institution between March 3, 2020 and May 5, 2020, inclusive of those 6 dates. Patients were excluded if hospital course was not completed prior to completion 7 of data collection. Data were retrieved from EPIC electronic health record software 8 and entered into Research Electronic Data Capture (REDCap) application, the platform 9 used for data analysis.",
            "latex": null,
            "type": "figure"
        },
        "FIGREF2": {
            "text": "in the study were considered to have confirmed infection if the initial 12 test result was positive on admission or at least one test was positive during admission if 13 testing was repeated for high clinical suspicion despite an initial negative result. All 14 patients with confirmed COVID-19 infection had HbA1c tested on admission as part of 15 our institution's COVID-19 admission order set. Presence of diabetes was defined 16 by a HbA1c level  6.5% (48 mmol/mol) or a history of diabetes and current administration 17 of at least one antihyperglycemic medication.",
            "latex": null,
            "type": "figure"
        },
        "FIGREF3": {
            "text": "Grasselli G, Zangrillo A, Zanella A, et al. Baseline characteristics and outcomes of 8 1591 patients infected with SARS-CoV-2 admitted to ICUs of the Lombardy Region, Italy. 9 JAMA. 2020;323:1574-1581.",
            "latex": null,
            "type": "figure"
        },
        "FIGREF4": {
            "text": "Richardson S, Hirsch JS, Narasimhan M, et al. Presenting characteristics, 11 comorbidities, and outcomes among 5700 patients hospitalized with COVID-19 in 12 the New York City area. JAMA. 2020;323:2052-2059. 13 5. Lighter J, Phillips M, Hochman S, et al. Obesity in patients younger than 60 years is a 14 risk factor for COVID-19 hospital admission. Clin Infect Dis. 2020;71:896-897. 15 6. Bode B, Garrett V, Messler J, et al. Glycemic characteristics and clinical outcomes of 16 COVID-19 patients hospitalized in the United States. J Diabetes Sci Technol. 17 2020;14:813-821. 18 7. Liu SP, Zhang Q, Wang W, et al. Hyperglycemia is a strong predictor of poor prognosis 19 in COVID-19. Diabetes Res Clin Pract. C, D'Onofrio N, Balestrieri ML, et al. Hyperglycaemia on admission to hospital 4 and COVID-19. Diabetologia. 2020;63:2486-2487 5 10. Coppelli A, Giannarelli R, Aragona M, et al. Pisa COVID-19 Study Group. 6 Hyperglycemia at hospital admission is associated with severity of the prognosis in 7 patients hospitalized for COVID-10: the Pisa COVID-19 study. Diabetes Care. Sathish T, Cao Y. What is the role of admission HbA1c in managing COVID-19 10 patients? J Diabetes. 2020; 10.1111/1753-0407.13140. 11 12. Liu L, Wei W, Yang K, et al. Glycemic control before admission is an important 12 determinant of prognosis in patients with coronavirus disease 2019. J Diabetes Investig. Liu Z, Bai X, Han X, et al. The association of diabetes and the prognosis of COVID-15",
            "latex": null,
            "type": "figure"
        },
        "TABREF0": {
            "text": "hematologic malignancy, history of solid organ transplant, human immunodeficiency virus or acquired immunodeficiency syndrome. Medications utilized for treatment of COVIDthrombosis; and length of hospital stay. AKI was defined as per the Kidney Disease: Improving Global Outcomes (KDIGO) guidelines as an increase in serum creatinine of 65 years old to assess the impact age may have on primary and secondary",
            "latex": null,
            "type": "table"
        },
        "TABREF2": {
            "text": "infectious outbreaks including H1NI influenza 30 and Middle East respiratory syndrome.31  Chronic hyperglycemia impairs immune function,32  and there is evidence that levels of ACE-2, which serves as a port of entry for SARS-CoV-2, are increased in 27 J o u r n a l P r e -p r o o f patients with diabetes. 33,34 One could therefore expect high levels of HbA1c to predict a more severe course in patients with COVID-19. Nonetheless, results from our study are consistent with the findings of several recent studies. The CORONADO study, 16 3 a large multi-centered study of 1317 patients with COVID-19 from France, reported that long-term glycemia as assessed by HbA1c level did not impact severity of CORONADO study are limited by missing data, as HbA1c levels were not available for nearly 40% of patients. A study from New York City included 1,126 patients with diabetes who were hospitalized due to COVID-19, and reported no association between HbA1c and mortality, including in patients with HbA1c >9% (75 mmol/mol). 17 This study 10 was limited in that only 18% of patients had HbA1c measured within 1 week of 11 hospitalization, although most patients (75%) had HbA1c measured within 1 year of 12 admission. Finally, a smaller study of 166 hospitalized patients found no differences in 13 mortality rates based on HbA1c.35  Our study with HbA1c measured in all cases on admission, confirms and supports the findings of these studies.While long-term management of glycemia may not have a direct impact on mortality in COVID-19, optimal management of glycemia during hospitalization has been linked to a18 reduction in mortality [9]. Sardu et al. 36 demonstrated that a substantial reduction in blood 19 glucose with utilization of insulin infusion improved outcomes and prognosis in patients with COVID-19. Zhu et al. 37 also found lower in-hospital death rates from COVID-19 21 (1.1% versus 11%) in patients with well-managed glycemia (defined as blood glucose between 70 and 180 mg/dL) compared to patients with hyperglycemia (glucose > 180 mg/dL) during hospitalization. Mazori et al. 38 reported lower survival for patients without",
            "latex": null,
            "type": "table"
        },
        "TABREF3": {
            "text": "only 18% of patients in the study byAgarwal et al. 17  had HbA1c measured within one week of hospitalization. Our study also has several limitations. It is a singlecenter retrospective study, and our results would be strengthened by prospective multicenter studies. We did not compare outcomes to patients without diabetes, so we cannot",
            "latex": null,
            "type": "table"
        },
        "TABREF4": {
            "text": "19 patients: a retrospective study. Diabetes Res Clin Pract. 2020;169:108386. 19. Gastélum-Cano JM, Islas-Osuna MA, Arízaga-Berber JA. Higher values of fasting 11 blood glucose and glycated hemoglobin are not associated with mortality in Covid-19 Bonanad C, García-Blas S, Tarazona-Santabalbina F, et al. The effect of age on mortality in patients with COVID-19: a meta-Analysis With 611,583 Subjects. J Am Med 26. Sathish T, de Mello GT, Cao Y. Is newly diagnosed diabetes a stronger risk factor 10 than pre-existing diabetes for COVID-19 severity? J Diabetes. 2021;13:177-178. 28. Li L, Wei Q, Li WX, et al. Metformin use in diabetes prior to hospitalization: effects on 35. Riahi S, Sombra LRS, Lo KB, et al. Insulin use, diabetes control, and outcomes in affected by COVID-19: can we do more on glycemic control? Diabetes Care.",
            "latex": null,
            "type": "table"
        },
        "TABREF5": {
            "text": "Characteristics of hospitalized patients with diabetes and COVID-19.",
            "latex": null,
            "type": "table"
        },
        "TABREF6": {
            "text": "1 P-values are from Kruskal-Wallis test for continuous variables and, Chi-Square or Fisher's",
            "latex": null,
            "type": "table"
        },
        "TABREF7": {
            "text": "Univariate logistic regression model using hemoglobin A1c values as an",
            "latex": null,
            "type": "table"
        },
        "TABREF8": {
            "text": "Factors associated with Acute Kidney Injury*c-statistic=0.77. Please note, our main purpose was to evaluate if Hemoglobin A1c significantly affects AKI. Therefore, only characteristics with p-values <0.25 comparing A1c categories (Table1) were considered for the multivariable model. CVD, cardiovascular disease; CKD, chronic kidney disease.",
            "latex": null,
            "type": "table"
        },
        "TABREF9": {
            "text": "Factors associated with Acute Kidney Injury for highest HbA1c quartile (9.0-17.1).*c-statistic=0.77. Characteristics with p-values <0.25 comparing HbA1c categories (Table1) were considered for the multivariable model. Immunocompromised and active malignancy variables were removed to prevent model convergence due to low event counts in the group with highest A1c values. CVD, cardiovascular disease; CKD, chronic kidney disease.",
            "latex": null,
            "type": "table"
        },
        "TABREF10": {
            "text": "Characteristics of hospitalized patients with diabetes and COVID-19. J o u r n a l P r e -p r o o f",
            "latex": null,
            "type": "table"
        },
        "TABREF11": {
            "text": "Comparisons of clinical outcomes between Hemoglobin A1c groups.Data are presented as frequency (%) unless otherwise stated. 1 P values are from the Chi-square test. ICU, intensive care unit.",
            "latex": null,
            "type": "table"
        },
        "TABREF12": {
            "text": "Demographics and outcomes of patients over 65 years of age.",
            "latex": null,
            "type": "table"
        }
    },
    "back_matter": []
}