{
    "paper_id": "0a4b4700cd7a9da28b8aafc3acf952594cc2cb81",
    "metadata": {
        "title": "Title: 1 UK B.1.1.7 variant exhibits increased respiratory replication and shedding in nonhuman primates 2 3",
        "authors": [
            {
                "first": "K",
                "middle": [],
                "last": "Rosenke",
                "suffix": "",
                "affiliation": {
                    "laboratory": "Laboratory of Virology",
                    "institution": "",
                    "location": {}
                },
                "email": ""
            },
            {
                "first": "F",
                "middle": [],
                "last": "Feldmann",
                "suffix": "",
                "affiliation": {
                    "laboratory": "",
                    "institution": "National Institutes of Health",
                    "location": {
                        "addrLine": "10 Hamilton",
                        "region": "MT",
                        "country": "Unites States"
                    }
                },
                "email": "feldmannh@niaid.nih.gov"
            },
            {
                "first": "A",
                "middle": [],
                "last": "Okumura",
                "suffix": "",
                "affiliation": {
                    "laboratory": "Laboratory of Virology",
                    "institution": "",
                    "location": {}
                },
                "email": ""
            },
            {
                "first": "F",
                "middle": [],
                "last": "Hansen",
                "suffix": "",
                "affiliation": {
                    "laboratory": "Laboratory of Virology",
                    "institution": "",
                    "location": {}
                },
                "email": ""
            },
            {
                "first": "T",
                "middle": [],
                "last": "Tang-Huau",
                "suffix": "",
                "affiliation": {
                    "laboratory": "Laboratory of Virology",
                    "institution": "",
                    "location": {}
                },
                "email": ""
            },
            {
                "first": "K",
                "middle": [],
                "last": "Meade-White",
                "suffix": "",
                "affiliation": {
                    "laboratory": "Laboratory of Virology",
                    "institution": "",
                    "location": {}
                },
                "email": ""
            },
            {
                "first": "B",
                "middle": [],
                "last": "",
                "suffix": "",
                "affiliation": {},
                "email": ""
            },
            {
                "first": "",
                "middle": [],
                "last": "Kaza",
                "suffix": "",
                "affiliation": {
                    "laboratory": "Laboratory of Virology",
                    "institution": "",
                    "location": {}
                },
                "email": ""
            },
            {
                "first": "B",
                "middle": [
                    "J"
                ],
                "last": "Smith",
                "suffix": "",
                "affiliation": {
                    "laboratory": "",
                    "institution": "National Institutes of Health",
                    "location": {
                        "addrLine": "10 Hamilton",
                        "region": "MT",
                        "country": "Unites States"
                    }
                },
                "email": ""
            },
            {
                "first": "P",
                "middle": [
                    "W"
                ],
                "last": "Hanley",
                "suffix": "",
                "affiliation": {
                    "laboratory": "",
                    "institution": "National Institutes of Health",
                    "location": {
                        "addrLine": "10 Hamilton",
                        "region": "MT",
                        "country": "Unites States"
                    }
                },
                "email": ""
            },
            {
                "first": "J",
                "middle": [],
                "last": "Lovaglio",
                "suffix": "",
                "affiliation": {
                    "laboratory": "",
                    "institution": "National Institutes of Health",
                    "location": {
                        "addrLine": "10 Hamilton",
                        "region": "MT",
                        "country": "Unites States"
                    }
                },
                "email": ""
            },
            {
                "first": "M",
                "middle": [
                    "A"
                ],
                "last": "Jarvis",
                "suffix": "",
                "affiliation": {
                    "laboratory": "Laboratory of Virology",
                    "institution": "",
                    "location": {}
                },
                "email": ""
            },
            {
                "first": "C",
                "middle": [],
                "last": "Shaia",
                "suffix": "",
                "affiliation": {
                    "laboratory": "",
                    "institution": "National Institutes of Health",
                    "location": {
                        "addrLine": "10 Hamilton",
                        "region": "MT",
                        "country": "Unites States"
                    }
                },
                "email": ""
            },
            {
                "first": "H",
                "middle": [],
                "last": "Feldmann",
                "suffix": "",
                "affiliation": {
                    "laboratory": "Laboratory of Virology",
                    "institution": "",
                    "location": {}
                },
                "email": ""
            },
            {
                "first": "Heinz",
                "middle": [],
                "last": "Feldmann",
                "suffix": "",
                "affiliation": {},
                "email": ""
            }
        ]
    },
    "abstract": [
        {
            "text": " 18 ",
            "cite_spans": [],
            "ref_spans": [],
            "section": "Abstract"
        }
    ],
    "body_text": [
        {
            "text": "The regular emergence of SARS-CoV-2 variants represents a constant public health challenge 151 with the COVID-19 pandemic. Although epidemiological and clinical data can give insight into 152 characteristics of a new variant, this data can be limited initially and may be biased by many 153 factors. Animal models provide the ability to directly compare biological and clinical 154 characteristics of multiple SARS-CoV2 variants in a study with limited variables providing 155 invaluable data otherwise unattainable. 156",
            "cite_spans": [],
            "ref_spans": [],
            "section": ""
        },
        {
            "text": "In the present study, we have used the AGM intranasal infection model to compare the B.1.1.7 157 VOC, a variant that emerged in the UK in September of 2020 and then quickly spread 158 throughout the world (5, 7), with a contemporary D614G variant, in terms of virus replication, 159",
            "cite_spans": [],
            "ref_spans": [],
            "section": ""
        },
        {
            "text": "shedding and disease severity. A nasal atomization device was used to infect NHPs to most 160 closely mimic natural infection in human. Following infection with either variant, animals in 161 both groups exhibited minor differences in disease progression but overall disease signs were 162 similar with mild respiratory disease for both B.1.1.7 and D614G (Fig. 1A ,B; Table S1 & S2) . 163",
            "cite_spans": [],
            "ref_spans": [
                {
                    "start": 355,
                    "end": 363,
                    "text": "(Fig. 1A",
                    "ref_id": "FIGREF5"
                },
                {
                    "start": 368,
                    "end": 382,
                    "text": "Table S1 & S2)",
                    "ref_id": "TABREF1"
                }
            ],
            "section": ""
        },
        {
            "text": "Increased disease severity was initially reported for human B.1.1.7 cases (8-10), but more recent 164 studies have contradicted these earlier claims (11, 12) . The outcome of our study using a NHP 165 surrogate model supports findings from these more recent studies indicating that B.1.1.7 VOC is 166 not associated with increased disease severity. 167",
            "cite_spans": [
                {
                    "start": 149,
                    "end": 153,
                    "text": "(11,",
                    "ref_id": null
                },
                {
                    "start": 154,
                    "end": 157,
                    "text": "12)",
                    "ref_id": null
                }
            ],
            "ref_spans": [],
            "section": ""
        },
        {
            "text": "Although no animals in this study developed severe disease, our analysis reveal differences 168 between the two variants in terms of their replication within the respiratory system. Viral RNA 169 and infectious virus in the lower respiratory tract tissues were more prevalent in the animals 170 infected with B.1.1.7 compared to D614G, especially at later timepoints suggesting the 171 development of a stronger respiratory component associated with the emerging VOC (Figs 2, Fig  172   3 ). Consistent with higher levels of viral replication in the upper respiratory tract, shedding of 173 viral RNA in both the nose and oral cavity was also higher in B.1.1.7 infected animals ( Fig. 1) , 174 which support reports from human infection data showing that the B.1.1.7 VOC is more 175 transmissible than earlier variants (6, 7, 25) . 176",
            "cite_spans": [
                {
                    "start": 819,
                    "end": 822,
                    "text": "(6,",
                    "ref_id": null
                },
                {
                    "start": 823,
                    "end": 825,
                    "text": "7,",
                    "ref_id": null
                },
                {
                    "start": 826,
                    "end": 829,
                    "text": "25)",
                    "ref_id": null
                }
            ],
            "ref_spans": [
                {
                    "start": 467,
                    "end": 488,
                    "text": "(Figs 2, Fig  172   3",
                    "ref_id": "FIGREF5"
                },
                {
                    "start": 680,
                    "end": 687,
                    "text": "Fig. 1)",
                    "ref_id": "FIGREF5"
                }
            ],
            "section": ""
        },
        {
            "text": "The pathology associated with infections differed between the two variants. B.1.1.7 replicated at 177 higher levels in the respiratory tract resulting in lesions that were both more numerous and 178 severe than seen for D614G infected animals. In contrast, D614G replicated at higher levels in 179 the GI tract and the associated pathology seen in these animals correlated with this difference in 180 GI replication. This finding was supported by higher levels of viral RNA in rectal swabs 181",
            "cite_spans": [],
            "ref_spans": [],
            "section": ""
        },
        {
            "text": "indicating the possibility of fecal transmission (Fig. 4) . This may indicate that D614G is more 182 suited to replication in the digestive tract than other variants which is in line with clinical studies 183 conducted in early to mid-2020 that reported GI symptoms in approximately 15-20% of COVID-184 19 patients (26). The difference observed in these studies may also indicate that genetic 185 alterations in B.1.1.7 may have not merely resulted in a general increased rate of replication but 186 may have also altered organ tropism. Clinical studies concerning B.1.1.7 have to date been 187 mainly focused on respiratory symptoms (8-11). However, with clinical studies still underway it 188 remains to be seen whether the observed changes in tissue tropism and replication detected here 189 in the AGM model will correspond to a drop in reported GI symptoms in those infected with the 190 B.1.1.7 VOC compared to infections with contemporary SARS-CoV-2. It is also possible that 191",
            "cite_spans": [],
            "ref_spans": [
                {
                    "start": 49,
                    "end": 57,
                    "text": "(Fig. 4)",
                    "ref_id": "FIGREF8"
                }
            ],
            "section": ""
        },
        {
            "text": "AGMs may be more prone to GI tract infections and an earlier SARS-CoV-2 study with AGMS 192 using the nCoV-WA1-2020 isolate suggests this could be true. That study had a single animal 193 that exhibited infection in the GI tract up to 10dpi but the remaining animals did not (27). Future 194 studies should address potential differences in organ tropism associated with SARS-CoV-2 195 variants. 196 . CC-BY-ND 4.0 International license available under a (which was not certified by peer review) is the author/funder, who has granted bioRxiv a license to display the preprint in perpetuity. It is made",
            "cite_spans": [],
            "ref_spans": [],
            "section": ""
        },
        {
            "text": "The copyright holder for this preprint this version posted June 13, 2021. ; https://doi.org/10.1101/2021.06.11.448134 doi: bioRxiv preprint A recent study posted on a preprint server examining SARS-CoV-2 variants in the rhesus 197 macaque model showed no difference in viral replication nor disease between the D614G and 198 B.1.1.7 variants (28). Notably, this study used double the infectious dose via intranasal challenge 199 using the same atomizing device, but also added an intratracheal inoculation route (28). 200",
            "cite_spans": [],
            "ref_spans": [],
            "section": ""
        },
        {
            "text": "Although AGMs and rhesus macaques share similar ACE-2/RBD binding affinities (29), we 201 cannot rule out the different NHP species as a potential factor in the outcome of infection. The In conclusion, our results from the intranasal AGM COVID-19 surrogate model support the most 205 recent data from B.1.1.7 in humans, providing direct empirical data for increased replication in 206 respiratory tissue, but with no enhancement of disease. Although the lack of clear statistical 207 significance for some of the parameters may be regarded as possible limitation of the study, the 208 use of these multiple parameters to independently verify one another addresses this concern. One 209 way to obtain statistical significance more uniformly is to increase NHP numbers something that 210",
            "cite_spans": [],
            "ref_spans": [],
            "section": ""
        },
        {
            "text": "is ethically sensitive and difficult given the current issues with NHP availability. NHPs remain a 211 surrogate model for humans and results presented herein provide direct experimental evidence 212 that support recent clinical observations, which indicate that the B.1.1.7 VOC has characteristics 213 of increased replication in respiratory tissues with enhanced shedding from the nose and oral 214 cavity resulting in advanced transmission. A further notable and interesting observation of 215 differences between these two variants in terms of distinct viral tissue/organ tropism warrants 216 further attention as such changes would have public health implications in terms of transmission 217 and disease manifestation. 218 219 . CC-BY-ND 4.0 International license available under a (which was not certified by peer review) is the author/funder, who has granted bioRxiv a license to display the preprint in perpetuity. It is made . CC-BY-ND 4.0 International license available under a (which was not certified by peer review) is the author/funder, who has granted bioRxiv a license to display the preprint in perpetuity. It is made",
            "cite_spans": [],
            "ref_spans": [],
            "section": ""
        },
        {
            "text": "The copyright holder for this preprint this version posted June 13, 2021. ; https://doi.org/10.1101/2021.06.11.448134 doi: bioRxiv preprint in general appearance, respiration, food intake and feces as well as locomotion (B) Radiographs 326 were taken on clinical exam days (0, 1, 3, 5, 7) and scored for pulmonary infiltrates. Swabs were 327 taken on clinical exam days (0, 1, 3, 5 and 7) and used as a correlate for virus shedding. Viral 328 RNA total genome (gRNA) and subgenome (sgRNA) copies were determined by qRT-PCR. . CC-BY-ND 4.0 International license available under a (which was not certified by peer review) is the author/funder, who has granted bioRxiv a license to display the preprint in perpetuity. It is made",
            "cite_spans": [],
            "ref_spans": [],
            "section": ""
        },
        {
            "text": "The copyright holder for this preprint this version posted June 13, 2021. ; https://doi.org/10.1101/2021.06.11.448134 doi: bioRxiv preprint AGMs were placed in a climate-controlled room with a fixed 12-hour light-dark cycle. Animals 11 were singly housed in adjacent primate cages allowing social interactions and provided with 12 commercial monkey chow, treats, and fruit twice daily with water ad libitum. Environmental 13 enrichment was provided with a variety of human interaction, manipulanda, commercial toys, 14 movies, and music. AGMs were monitored at least twice daily throughout the study. Serum chemistries were completed on a VetScan VS2 Chemistry Analyzer (Abaxis, Union City, 65 CA, USA) and the following parameters were evaluated: glucose, blood urea nitrogen (BUN), 66 . CC-BY-ND 4.0 International license available under a (which was not certified by peer review) is the author/funder, who has granted bioRxiv a license to display the preprint in perpetuity. It is made",
            "cite_spans": [],
            "ref_spans": [],
            "section": ""
        },
        {
            "text": "The copyright holder for this preprint this version posted June 13, 2021. ; https://doi.org/10.1101/2021.06.11.448134 doi: bioRxiv preprint creatinine, calcium, albumin, total protein, alanine aminotransferase (ALT), aspartate 67 aminotransferase (AST), alkaline phosphatase (ALP), total bilirubin, globulin, sodium, 68 potassium, chloride, and total carbon dioxide. Coagulation values were determined from citrated 69 plasma utilizing a STart4 Hemostatis Analyzer and associated testing kits (Diagnostica Stago, 70",
            "cite_spans": [],
            "ref_spans": [],
            "section": ""
        },
        {
            "text": "Parsippany, NJ, USA). ",
            "cite_spans": [],
            "ref_spans": [],
            "section": ""
        },
        {
            "text": ". CC-BY-ND 4.0 International license available under a (which was not certified by peer review) is the author/funder, who has granted bioRxiv a license to display the preprint in perpetuity. It is made",
            "cite_spans": [],
            "ref_spans": [],
            "section": "Infectious Titer"
        },
        {
            "text": "The copyright holder for this preprint this version posted June 13, 2021. ; https://doi.org/10.1101/2021.06.11.448134 doi: bioRxiv preprint . CC-BY-ND 4.0 International license available under a (which was not certified by peer review) is the author/funder, who has granted bioRxiv a license to display the preprint in perpetuity. It is made",
            "cite_spans": [],
            "ref_spans": [],
            "section": "Infectious Titer"
        },
        {
            "text": "The copyright holder for this preprint this version posted June 13, 2021. ",
            "cite_spans": [],
            "ref_spans": [],
            "section": "Infectious Titer"
        },
        {
            "text": ". CC-BY-ND 4.0 International license available under a (which was not certified by peer review) is the author/funder, who has granted bioRxiv a license to display the preprint in perpetuity. It is made",
            "cite_spans": [],
            "ref_spans": [],
            "section": "Fig S3"
        },
        {
            "text": "The copyright holder for this preprint this version posted June 13, 2021. ; https://doi.org/10.1101/2021.06.11.448134 doi: bioRxiv preprint . CC-BY-ND 4.0 International license available under a (which was not certified by peer review) is the author/funder, who has granted bioRxiv a license to display the preprint in perpetuity. It is made",
            "cite_spans": [],
            "ref_spans": [],
            "section": "Fig S3"
        },
        {
            "text": "The copyright holder for this preprint this version posted June 13, 2021. ; https://doi.org/10.1101/2021.06.11.448134 doi: bioRxiv preprint Table S1 : Clinical scoring and necropsy notes of infected animals. AGMs were scored daily 149",
            "cite_spans": [],
            "ref_spans": [
                {
                    "start": 140,
                    "end": 148,
                    "text": "Table S1",
                    "ref_id": "TABREF1"
                }
            ],
            "section": "Fig S3"
        },
        {
            "text": "for clinical signs of disease including changes in general appearance, respiration, food intake, ",
            "cite_spans": [],
            "ref_spans": [],
            "section": "Fig S3"
        }
    ],
    "bib_entries": {
        "BIBREF0": {
            "ref_id": "b0",
            "title": "Inactivation of SARS-CoV",
            "authors": [
                {
                    "first": "E",
                    "middle": [],
                    "last": "Haddock",
                    "suffix": ""
                },
                {
                    "first": "F",
                    "middle": [],
                    "last": "Feldmann",
                    "suffix": ""
                },
                {
                    "first": "W",
                    "middle": [
                        "L"
                    ],
                    "last": "Shupert",
                    "suffix": ""
                },
                {
                    "first": "H",
                    "middle": [],
                    "last": "Feldmann",
                    "suffix": ""
                }
            ],
            "year": null,
            "venue": "",
            "volume": "2",
            "issn": "",
            "pages": "",
            "other_ids": {}
        },
        "BIBREF2": {
            "ref_id": "b2",
            "title": "Intranasal ChAdOx1 nCoV-19/AZD1222 vaccination reduces 176 shedding of SARS-CoV-2 D614G in rhesus macaques. bioRxiv",
            "authors": [
                {
                    "first": "N",
                    "middle": [],
                    "last": "Van Doremalen",
                    "suffix": ""
                }
            ],
            "year": 2001,
            "venue": "",
            "volume": "",
            "issn": "",
            "pages": "",
            "other_ids": {}
        },
        "BIBREF3": {
            "ref_id": "b3",
            "title": "Subtle differences in the pathogenicity of SARS-CoV-2 variants of 179 concern B.1.1.7 and B.1.351 in rhesus macaques. bioRxiv",
            "authors": [
                {
                    "first": "V",
                    "middle": [
                        "J"
                    ],
                    "last": "Munster",
                    "suffix": ""
                }
            ],
            "year": 2005,
            "venue": "",
            "volume": "443115",
            "issn": "",
            "pages": "",
            "other_ids": {}
        },
        "BIBREF4": {
            "ref_id": "b4",
            "title": "A Simple Method of Estimating Fifty Percent Endpoints",
            "authors": [
                {
                    "first": "L",
                    "middle": [
                        "J"
                    ],
                    "last": "",
                    "suffix": ""
                },
                {
                    "first": ".",
                    "middle": [
                        "M"
                    ],
                    "last": "Reed",
                    "suffix": ""
                },
                {
                    "first": "H",
                    "middle": [],
                    "last": "",
                    "suffix": ""
                }
            ],
            "year": 1938,
            "venue": "American 182 Journal of Hygiene",
            "volume": "27",
            "issn": "",
            "pages": "493--497",
            "other_ids": {}
        },
        "BIBREF5": {
            "ref_id": "b5",
            "title": "Defining the Syrian hamster as a highly susceptible preclinical model 184 for SARS-CoV-2 infection",
            "authors": [
                {
                    "first": "K",
                    "middle": [],
                    "last": "Rosenke",
                    "suffix": ""
                }
            ],
            "year": 2020,
            "venue": "Emerg Microbes Infect",
            "volume": "9",
            "issn": "",
            "pages": "2673--2684",
            "other_ids": {}
        },
        "BIBREF6": {
            "ref_id": "b6",
            "title": "Virological assessment of hospitalized patients with COVID-2019",
            "authors": [
                {
                    "first": "R",
                    "middle": [],
                    "last": "",
                    "suffix": ""
                }
            ],
            "year": null,
            "venue": "",
            "volume": "",
            "issn": "",
            "pages": "",
            "other_ids": {}
        },
        "BIBREF8": {
            "ref_id": "b8",
            "title": "Thoracic radiography as a refinement methodology for the study of 188 H1N1 influenza in cynomologus macaques (Macaca fascicularis)",
            "authors": [
                {
                    "first": "D",
                    "middle": [
                        "L"
                    ],
                    "last": "Brining",
                    "suffix": ""
                }
            ],
            "year": 2010,
            "venue": "Comp Med",
            "volume": "60",
            "issn": "",
            "pages": "",
            "other_ids": {}
        }
    },
    "ref_entries": {
        "FIGREF0": {
            "text": "202 marginally higher dose and additional route of infection may have been additional factors 203 affecting infection outcomes. 204",
            "latex": null,
            "type": "figure"
        },
        "FIGREF1": {
            "text": "The authors are thankful to the animal caretakers and histopathology 283 group of the Rocky Mountain Veterinary Branch (NIAID, NIH) for their support with animal 284 related work, to the Research Technologies Branch (NIAID, NIH) for sequencing of stock 285 viruses, and Anita Mora (NIAID, NIH) for help with the display items. We are grateful to 286 Emmie de Wit and Vincent Munster for their discussions and help with virus stock preparations. 287 The B.1.1.7 variant was obtained through BEI Resources (Bassam Hallis, Sujatha Rashid), 288 NIAID (Ranjan Mukul, Kimberly Stemple) and the NIH. 289 290 Funding: This work was funded by the Intramural Research Program of the National Institutes 291 of Allergy and Infectious Diseases (NIAID), National Institutes of Health (NIH). contributions: Conceptualization: KR, MAJ, HF; Methodology: KR, FF, AO, FH, 294 TTH, KMW, BK, BJS, PWH, JL, CS; Visualization: KR, FH; Funding acquisition: HF; Project 295 administration: KR, HF; Supervision: KR, PWH, CS, HF; Writing (original draft): KR, MAJ, 296 CS, HF; Writing (review & editing): FF, AO, FH, TTH, KMW, BK, BS, PWH, JL, CS 297 298 Competing interest: The authors have declared that no conflict of interest exists. 299 300 Data and materials availability: All data are available in the main text or the supplementary 301 materials. Additional information can be requested through the corresponding author. 302 303 Disclaimer. The opinions, conclusions and recommendations in this report are those of the 304 authors and do not necessarily represent the official positions of the National Institute of Allergy 305 and Infectious Diseases (NIAID) at the National Institutes of Health (NIH). There was no 306 conflict in interest identified for any individual involved in the study.",
            "latex": null,
            "type": "figure"
        },
        "FIGREF5": {
            "text": "Clinical scoring, radiographs and oral and nasal shedding. AGMs were infected 323 with either the D614G or B.1.1.7 SARS-CoV-2 variant intranasally utilizing the Nasal Mucosal 324 Atomization Device. (A) AGMs were scored daily for clinical signs of disease including changes 325",
            "latex": null,
            "type": "figure"
        },
        "FIGREF6": {
            "text": "329Infectious virus was titered on VeroE6 cells. (C-E) Viral shedding in oral swabs. Statistical 330 significance was found at day 5 in total RNA (C, p-value <0.05) and at day 1 in infectious titers 331 (E, p-value <0.05). (F-H) Viral shedding in nasal swabs. Statistical significance was found at 332 day 7 in gRNA (F, p-value <0.05) and at day 7 sgRNA (G, p-value <0.05). Multiple t-tests were 333 used to compare the gRNA, sgRNA and infectious titers between groups.",
            "latex": null,
            "type": "figure"
        },
        "FIGREF7": {
            "text": "Virus load in the lower respiratory tract. AGMs were infected with either the 336 D614G or B.1.1.7 SARS-CoV-2 variant intranasally utilizing the Nasal Mucosal Atomization 337 Device. Bronchial cytology brush (BCB) samples were collected on days 3, 5 and 7 post-338 infection and samples were analyzed for gRNA, sgRNA and infectious virus. (A-C) A significant 339 difference in gRNA collected in the BCBs was detected 7 days-post-infection (A, p-value <0.05). 340 Animals were euthanized on day 7 post-infection and respiratory tissues were collected for 341 analyses for gRNA, sgRNA and infectious virus (D-F). gRNA was significantly different in the 342 trachea and bronchi (D, p-value <0.05). sgRNA differed significantly in the nasal turbinate and 343 bronchi (E, p-values <0.05). Infectious virus did not differ significantly in any tissue (C). 344 Multiple t-tests were used to compare tissue between groups. Pathology and immunoreactivity in 345 the trachea and bronchi (G-N). (G, H) Normal trachea found in the D614G vs. trachea with 346 cellular infiltrates, hemorrhage (*) and fibrin (arrow) found in the submucosa in the B.1.1.7. (K, 347 L) immunoreactivity in the trachea of D614G vs B.1.1.7. (I, J) Normal bronchi found in the 348 D614G vs bronchi with inflammation and cellular infiltrates found in the B.1.1.7. (M, N) 349 Immunoreactivity in bronchi of the D614G vs B.1.1.7. (HE G, H; IHC K, L 100x; HE I, Virus load, pathology and immunoreactivity in the lungs. 357 Animals were euthanized on day 7 post-infection and a section from each lung lobe were 358 collected and analyzed for gRNA, sgRNA and infectious virus. Results of each assay were 359 combined to look at the lungs in total (A-C). Significant differences were detected in lungs in 360 both gRNA and sgRNA (D, p-value <0.05 and E. p-value <0.05) but not in infectious virus (C). 361 Multiple t-tests were used to compare the two groups for statistical significance. Pathology and 362 immunoreactivity in the lungs (D-K). (D, E) Minimally thickened and inflamed alveolar septa 363 with multifocal pneumocyte immunoreactivity in the D614G and B.1.1.7 samples (HE D,",
            "latex": null,
            "type": "figure"
        },
        "FIGREF8": {
            "text": "Viral load in gastrointestinal tract, pathology and immunoreactivity. AGMs were 368 euthanized 7 days post-infection and tissues were collected to determine viral load, pathology 369 and immunoreactivity (A-C). gRNA and sgRNA was significantly different in the ileum and 370 cecum (A, p-value <0.05 and B, p-value <0.05). Infectious virus was significantly different in the 371 ileum (C, p-value <0.05), no other tissues were significantly different. (D-F) Viral shedding in 372 rectal swabs. Statistical significance was found at day 7 in total RNA (D, p-value <0.05). 373 Statistical significances was determined by multiple t-tests between the two groups. Pathology 374 and immunoreactivity in the ileum (G-N). (G, H) Normal mucosa with multifocal mucosal 375 immunoreactivity in the D614G challenged ileum (HE G, IHC K, 20x; HE H, IHC L, 400x). (I, 376 J) Normal mucosa and no immunoreactivity in the B.1.1.7 challenged ileum (HE I, IHC M, 20x; 377 HE J, IHC N, 400x). Biosafety and ethics. All SARS-CoV-2 studies were approved by the Institutional Biosafety 2 Committee (IBC) and performed in high biocontainment (BSL3/BSL4) at Rocky Mountain 3 Laboratories (RML), NIAID, NIH. All sample processing in high biocontainment and sample 4 removal followed IBC-approved Standard Operating Protocols (SOPs) (1). All experiments 5 involving AGMs were performed in strict accordance with approved Institutional Animal Care 6 and Use Committee protocols and following recommendations from the Guide for the Care and 7 Use of Laboratory Animals of the Office of Animal Welfare, National Institutes of Health and 8 the Animal Welfare Act of the US Department of Agriculture, in an Association for Assessment 9 and Accreditation of Laboratory Animal Care International (AAALAC)-accredited facility.10",
            "latex": null,
            "type": "figure"
        },
        "FIGREF9": {
            "text": "15 Virus and cells. SARS-CoV-2 isolate SARS-CoV-2/human/USA/RML-7/2020 (MW127503.1), 16 strain D614G, was obtained from a nasopharyngeal swab obtained on July 19, 2020. Sequencing 17 of the viral stock showed it to be 100% identical to the deposited Genbank sequence and no 18 contaminants were detected (2). SARS-CoV-2 variant B.1.1.7 (hCoV-19 19/England/204820464/2020, EPI_ISL_683466) was obtained from Public Health England via 20 BEI Resources (Manassas, VA, USA). The supplied passage 2 material was propagated once in 21 was performed in Vero E6 cells in DMEM (Sigma-Aldrich, St Louis, MO, 24 USA) supplemented with 2% fetal bovine serum, 1 mM L-glutamine, 50 U/ml penicillin and 50 25 μg/ml streptomycin (DMEM2). Vero E6 cells were maintained in DMEM supplemented with 26 10% fetal bovine serum, 1 mM L-glutamine, 50 U/ml penicillin and 50 μg/ml streptomycin 27 (DMEM10). Mycoplasma testing of cell lines and viral stocks is performed regularly, and no 28 mycoplasma was detected. 29 Study design. Eleven SARS-CoV-2 seronegative AGMs (3.8-6.7 kg) were divided into 2 groups 30 for infection with either the contemporary D614G strain (RML7) (n=5) or the recently emerged 31 B.1.1.7 (UK variant) (n=6). A Nasal Mucosal Atomization Device (Teleflex, MAD110) was 32 used to deliver 10 6 infectious particles (5x10 5 per naris diluted in 500ul DMEM with no 33 additives). Clinical examinations were performed on days 0, 1, 3, 5 and 7. Blood and serum were 34 collected for hematology, blood chemistry, coagulation and virological analysis. Oral, nasal and 35 rectal swabs were collected at every examination for virological analysis. Bronchial cytology 36 brushes were collected on days 3, 5 and 7 and bronchioalveolar lavage (BAL) samples were also 37 collected on days 3 and 5 for virological analysis. Tissues were collected following euthanasia 38 on day 7 for pathology and virological analysis. Studies were performed in successive weeks and 39 different animal study groups to avoid contamination between studies, the D416G study was run 40 first followed by the B.1.1.7 study. 41 Virus titration. Virus isolation was performed on tissues following homogenization in 1 mL 42 DMEM using a TissueLyser (Qiagen, Germantown, MD, USA) and inoculating Vero E6 cells in 43 plate with 200 µL of 1:10 serial dilutions of the homogenate. One hour following 44 inoculation of cells, the inoculum was removed and replaced with 200 µL DMEM. Virus 45 isolation of blood and swab samples were performed in a similar manner. Samples were vortexed 46 for 30 seconds before performing the 1:10 dilution series. The inoculum (200ul) was placed on 47 cells and rocked for 1h. Infectious supernatant was removed and replaced with fresh DMEM. 48 Seven days following inoculation, cytopathogenic effect was scored and the TCID50 was 49 calculated using the Reed-Muench formula (4). 50 Viral RNA detection. qPCR was performed on RNA samples extracted from swabs or tissues 51 using QiaAmp Viral RNA or RNeasy kits, respectively (Qiagen, Germantown, MD, USA). Viral 52 RNA was detected with one-step real-time RT-PCR assays designed to amplify total viral RNA 53 (N gene) (5) or sgRNA by amplifying a region of E gene to detect replicating virus (6). Dilutions 54 of RNA standards counted by droplet digital PCR were run in parallel and used to calculate viral 55 RNA genome copies. A Rotor-Gene probe kit (Qiagen, Germantown, MD, USA) was used to run 56 the PCRs according to the instructions of the manufacturer. 57 Hematology, Serum Chemistry and Coagulation. Hematology analysis was completed on a 58 ProCyte DX (IDEXX Laboratories, Westbrook, ME, USA) and the following parameters were 59 evaluated: red blood cells (RBC), hemoglobin (Hb), hematocrit (HCT), mean corpuscular 60 volume (MCV), mean corpuscular hemoglobin (MCH), mean corpuscular hemoglobin 61 concentration (MCHC), red cell distribution weight (RDW), platelets, mean platelet volume 62 (MPV), white blood cells (WBC), neutrophil count (abs and %), lymphocyte count (abs and %), 63 monocyte count (abs and %), eosinophil count (abs and %), and basophil count (abs and %).",
            "latex": null,
            "type": "figure"
        },
        "FIGREF11": {
            "text": "71 Cytokine analyses. Concentrations of cytokines and chemokines present in the serum from 72 SARS-CoV-2 infected AGMs were quantified using a multiplex bead-based assay (1:4 dilution)-73 the LEGENDPlex Non-Human Primate Cytokine/Chemokines 13-plex (BioLegend, San Diego, 74 CA USA). Analytes detected by this panel are the following: IFN-γ, IL-1β, IL-6, IL-8, MCP-1, 75 MIP-1α, MIP-1β, MIG, TNF-α, I-TAC, RANTES, IP-10, and Eotaxin. Samples were diluted 1:4 76 in duplicate prior to processing according the manufacturer's instructions. Samples were read 77 using the BD FACS Symphony instrument (BD Biosciences, San Jose, CA USA) and analyzed 78 using LEGENDplexTM Data Analysis Software following data acquisition. 79 Thoracic radiographs. Ventro-dorsal and right/left lateral radiographs were taken on clinical 80 exam days prior to any other procedures (e.g. bronchoalveolar lavage, nasal flush). Radiographs 81 were evaluated and scored for the presence of pulmonary infiltrates by two board-certified 82 clinical veterinarians according to a previously published standard scoring system (7). Briefly, 83 each lung lobe (upper left, middle left, lower left, upper right, middle right, lower right) was 84 scored individually based on the following criteria: 0 = normal examination; 1 = mild interstitial 85 pulmonary infiltrates; 2 = moderate interstitial pulmonary infiltrates, perhaps with partial cardiac 86 border effacement and small areas of pulmonary consolidation (alveolar patterns and air 87 bronchograms); and 3 = pulmonary consolidation as the primary lung pathology, seen as a 88 progression from grade 2 lung pathology. At study completion, thoracic radiograph findings 89 were reported as a single radiograph score for each animal on each exam day. To obtain this 90 score, the scores assigned to each of the six lung lobes were added together and recorded as the 91 radiograph score for each animal on each exam day. Scores range from 0 to 18 for each animal 92 on each exam day. 93 Histology and Immunohistochemistry. Tissues were fixed in 10 % neutral buffered formalin 94 with two changes, for a minimum of 7 days according to an IBC-approved SOP. Tissues were 95 processed with a Sakura VIP-6 Tissue Tek, on a 12-hour automated schedule, using a graded 96 series of ethanol, xylene, and PureAffin. Embedded tissues were sectioned at 5 μm and dried 97 overnight at 42°C prior to staining with hematoxylin and eosin. Specific staining was detected 98 using SARS-CoV/SARS-CoV-2 nucleocapsid antibody (Sino Biological cat#40143-MM05) at a 99 1:1000 dilution. The tissues were processed for immunohistochemistry using the Discovery 100 Ultra automated stainer (Ventana Medical Systems) with a ChromoMap DAB kit (Roche Tissue 101 Diagnostics cat#760-159) (Roche Diagnostics Corp., Indianapolis, IN, USA). 102 Statistical analyses. Statistical analysis was performed in Prism 8 (GraphPad, San Diego, CA, 103 USA). Multiple t-tests were used to assess statistical significance between the two infection 104 Viral loads in the lower respiratory system (BAL). 114 AGMs were infected with either the D614G or B.1.1.7 SARS-CoV-2 variant intranasally 115 utilizing a Nasal Mucosal Atomization Device. Bronchioalveolar lavage (BAL) samples were 116 collected on days 3 and 5 post-infection and measured for gRNA, sgRNA and infectious titers. 117 (A-C) A significant difference in gRNA collected in BAL samples was detected on day 5 post-118 infection (*p-value <0.05), no other significant differences were detected. Multiple t-tests were 119 used to compare groups.",
            "latex": null,
            "type": "figure"
        },
        "FIGREF12": {
            "text": "Hematology and blood chemistry following infection. Whole blood and serum 126 samples were collected at each exam time point (days 0, 1, 3, 5 and 7) for hematology (A-L) and 127 blood chemistry analyses (M-T). No significant changes were found in hematology (A-L)",
            "latex": null,
            "type": "figure"
        },
        "FIGREF13": {
            "text": "Coagulation assays following infection. Plasma samples were collected at each 133 clinical time point (days 0, 1, 3, 5 and 7) to evaluate coagulation parameters between infected 134 animals (A-D). No significant changes were found in PT (A), APTT (B), fibrinogen (",
            "latex": null,
            "type": "figure"
        },
        "FIGREF14": {
            "text": "Cytokine analyses following infection. Serum was collected on days 0, 1, 3, 5 post-143 infection for cytokine analyses. Three notable changes were detected. Levels of IL-6 were 144 significantly different 3 days post-infection between the two groups (*p-value 0.05) (A). 145Differences at 1 day post-infection were noted in both IP-10 (B) and I-TAC (C) but were not 146 significant. Samples were analyzed by 2-way ANOVA to determine significance.",
            "latex": null,
            "type": "figure"
        },
        "FIGREF15": {
            "text": "150 fecal output as well as locomotion. Macroscopic scoring of organs was performed during 151 necropsies (day 7 post-infection).",
            "latex": null,
            "type": "figure"
        },
        "TABREF1": {
            "text": "Table S2316",
            "latex": null,
            "type": "table"
        },
        "TABREF2": {
            "text": "Lung weight: 38.34g/animal 6.70kg RML dorsal 10%;10% ventral; accessory lobe ventral 30%; LML 30% ventral, LLL dorsal 5%, ventral 10%, Peritoneal cavity: fibrin tags Pleural cavity: adhesions Lung adhesions",
            "latex": null,
            "type": "table"
        }
    },
    "back_matter": [
        {
            "text": "lower right) was scored individually based on the following criteria: 0 = normal examination; 1 161 = mild interstitial pulmonary infiltrates; 2 = moderate interstitial pulmonary infiltrates, perhaps 162 with partial cardiac border effacement and small areas of pulmonary consolidation (alveolar 163 patterns and air bronchograms); and 3 = pulmonary consolidation as the primary lung pathology, 164 seen as a progression from grade 2 lung pathology. At study completion, thoracic radiograph 165 findings were reported as a single radiograph score for each animal on each exam day. To obtain 166 this score, the scores assigned to each of the six lung lobes were added together and recorded as 167 the radiograph score for each animal on each exam day. Scores can range from 0 to 18 for each 168 animal on each exam day. ",
            "cite_spans": [],
            "ref_spans": [],
            "section": "annex"
        }
    ]
}