{
    "paper_id": "0a4b4158850f444c71f9b72f23a015bd2acc892a",
    "metadata": {
        "title": "Serum triglyceride levels and related factors as prognostic indicators in COVID-19 patients: A retrospective study",
        "authors": [
            {
                "first": "Peng",
                "middle": [],
                "last": "Zhong",
                "suffix": "",
                "affiliation": {
                    "laboratory": "",
                    "institution": "Capital Medical University",
                    "location": {
                        "settlement": "Beijing",
                        "country": "China"
                    }
                },
                "email": ""
            },
            {
                "first": "Zhenzhou",
                "middle": [],
                "last": "Wang",
                "suffix": "",
                "affiliation": {
                    "laboratory": "Key Laboratory of Trauma and Neural Regeneration",
                    "institution": "Peking University People's Hospital",
                    "location": {
                        "settlement": "Beijing",
                        "country": "China"
                    }
                },
                "email": "zhen_zhouwang@163.comz.w."
            },
            {
                "first": "Zhe",
                "middle": [],
                "last": "Du",
                "suffix": "",
                "affiliation": {
                    "laboratory": "Key Laboratory of Trauma and Neural Regeneration",
                    "institution": "Peking University People's Hospital",
                    "location": {
                        "settlement": "Beijing",
                        "country": "China"
                    }
                },
                "email": ""
            },
            {
                "first": "Zhenzhou",
                "middle": [],
                "last": "Correspondence",
                "suffix": "",
                "affiliation": {},
                "email": ""
            },
            {
                "first": "Zhe",
                "middle": [],
                "last": "Wang",
                "suffix": "",
                "affiliation": {},
                "email": ""
            },
            {
                "first": "",
                "middle": [],
                "last": "Du",
                "suffix": "",
                "affiliation": {},
                "email": ""
            }
        ]
    },
    "abstract": [
        {
            "text": "The role of triglycerides (TG) in coronavirus disease (COVID-19) is controversial. The objective of this study was to explore the relationship between TG levels and prognosis in COVID-19 patients and investigate the factors that affect TG.",
            "cite_spans": [],
            "ref_spans": [],
            "section": "Abstract"
        },
        {
            "text": "COVID-19 patients were divided into normal or high TG level groups. Their demographic data, medical history, signs and symptoms, laboratory results, and final clinical results were analyzed retrospectively. A total of 174 patients were included. TG level was 1.6 (interquartile range [IQR]: 1.",
            "cite_spans": [],
            "ref_spans": [],
            "section": "Abstract"
        }
    ],
    "body_text": [
        {
            "text": "well-correlated to the severity of the disease. 4 Research by Ehrlich et al. showed that elevated lipid metabolism may underline aspects of COVID-19 pathogenesis, as fenofibrate reverses the metabolic changes induced by SARS-CoV-2, blocking viral replication. 5 On the contrary, research by Wang et al. showed a negative correlation between serum TG levels and the time from disease onset to positive-to-negative transmission (PTNT) in nucleic acid tests. This prompted the authors to suggest that patients with COVID-19 receive high-fat diets to increase serum TG levels and decrease the PTNT. 6 However, the role of TG in COVID-19 is still unclear. Therefore, we retrospectively studied the characteristics of patients with different TG levels and analyzed the factors that affect TG levels, to preliminarily understand the pathophysiological mechanism of TG in COVID-19.",
            "cite_spans": [
                {
                    "start": 48,
                    "end": 49,
                    "text": "4",
                    "ref_id": "BIBREF3"
                },
                {
                    "start": 62,
                    "end": 76,
                    "text": "Ehrlich et al.",
                    "ref_id": null
                },
                {
                    "start": 260,
                    "end": 261,
                    "text": "5",
                    "ref_id": "BIBREF4"
                },
                {
                    "start": 595,
                    "end": 596,
                    "text": "6",
                    "ref_id": "BIBREF5"
                }
            ],
            "ref_spans": [],
            "section": ""
        },
        {
            "text": "Overall, 186 patients were diagnosed with COVID-19 from February 9, 2020 to February 29, 2020 in three wards of Wuhan Tongji Hospital, China. All patients were confirmed positive for SARS-CoV-2 nucleic acid by quantitative reverse-transcription polymerase chain reaction. To avoid the effect of drugs on TG levels, 12 patients were excluded (one case was treated with hydroxychloroquine for chronic systemic lupus erythematosus, six cases were treated with statins, and six cases were treated with lopinavir and ritonavir tablets). Thus, 174 patients were included in the study. According to \"The Third Report of the National Cholesterol Education Program Expert Panel on Detection, Evaluation, and Treatment of High Blood Cholesterol in Adults (Adult Treatment Panel III) final report,\" 7 patients with TG ≥ 1.7 mmol/L were included in the study and divided into two groups, high TG group (n = 78) and control group (n = 96). Information for all patients was retrospectively collected through the electronic medical record system, and included demographic characteristics, medical history, symptoms and signs, laboratory test results, SaO 2 at the time of admission without oxygen, and final clinical outcomes. Laboratory examination during the course of the disease showed leukocyte and lymphocyte levels were at their minimum values and TG, serum ferritin, C-reactive protein (CRP), interleukin (IL), tumor necrosis factor (TNF)-α, lactate dehydrogenase (LDH), erythrocyte sedimentation rate, creatine kinase, and fasting blood glucose levels were at their maximum values. Laboratory tests were carried out early morning in a fasted state, while the examination frequency was subject to disease changes throughout hospitalization. A total of 132 patients were tested for HbA1c, and no glucocorticoid drugs were used before the test. The diagnosis and treatment of COVID-19 were based on the \"New Coronavirus Pneumonia Diagnosis and Treatment Program (Trial Seventh Edition)\" 8 by the National Health Commission of the People's Republic of China. Comorbidities were treated according to the corresponding guidelines. Nonsurvivors and a small number of survivors used antibacterial drugs and glucocorticoids. All patients had good compliance with the treatment. All patients were followed up until April 6, 2020. This study was approved by the Ethics Committee of Peking University People's Hospital (No. 2020PHB110-01), China.",
            "cite_spans": [],
            "ref_spans": [],
            "section": "| Patients"
        },
        {
            "text": "Categorical variables are presented as frequencies and percentages, and continuous variables are presented as median and interquartile range (IQR). One-way analysis of variance (ANOVA) was used to calculate the difference between groups for continuous variables that fit normal distribution, and non-parametric tests were used for non-normally distributed continuous variables. The χ 2 test was applied to categorical variables. The log rank test was used for survival analysis to test the null hypothesis of no difference between the two groups. Simple regression and multiple linear regression were used to analyze the factors that affect TG. A value of p < .05 was considered statistically significant. All statistical analyses were performed using SPSS 24.0 (IBM).",
            "cite_spans": [],
            "ref_spans": [],
            "section": "| Statistical analyses"
        },
        {
            "text": "The demographic baseline characteristics of the patients are shown in Table 1 and laboratory test data are shown in Table 2 . All 174 patients enrolled in the study tested positive for SARS-CoV-2 RNA. The patients had a median age of 66 (IQR: 54.7-72.0, range: 24-95) years, and a male to female ratio of 88/86. A total of 117 patients (67.2%) had comorbidities, among which hypertension (46.0%) was the most common, followed by diabetes (29.3%), and cardio-cerebrovascular disease (17.2%). Eleven (6.3%) patients who received chronic hemodialysis for Stage 5 chronic kidney disease were infected with SARS-CoV-2 and received intermittent renal replacement therapy at the bedside (Table 1) .",
            "cite_spans": [],
            "ref_spans": [
                {
                    "start": 70,
                    "end": 77,
                    "text": "Table 1",
                    "ref_id": null
                },
                {
                    "start": 116,
                    "end": 123,
                    "text": "Table 2",
                    "ref_id": null
                },
                {
                    "start": 680,
                    "end": 689,
                    "text": "(Table 1)",
                    "ref_id": null
                }
            ],
            "section": "| RESULTS"
        },
        {
            "text": "SaO 2 without oxygen inhalation on admission was 95% (IQR: 90-97%) for all patients; 95.0% (88.5-97.2%) and 95.0% (90.0-97.0) in the high TG and control groups, respectively. There was no significant difference between the groups. Overall, 29 patients (16.7%) died during hospitalization, including 19 (23.1%) in the high TG group and 10 (11.5%) in the control group (absolute survival difference, 2.5% [95% CI: 1.2-5.1%], log-rank χ 2 = 5.7, and p = .017; Table 1 and Figure 1 ). All deceased patients were previously treated with mechanical ventilation.",
            "cite_spans": [],
            "ref_spans": [
                {
                    "start": 457,
                    "end": 464,
                    "text": "Table 1",
                    "ref_id": null
                },
                {
                    "start": 469,
                    "end": 477,
                    "text": "Figure 1",
                    "ref_id": null
                }
            ],
            "section": "| RESULTS"
        },
        {
            "text": "Laboratory tests showed that the TG level was 1.6 (IQR: 1.1-2.1) mmol/L for all patients; 2.2 (IQR: 1.8-2.7) mmol/L and 1.1 (IQR 1.0-1.3) mmol/L in the high TG and control groups, respectively. Serum ferritin, LDH, CRP, and IL-10 levels were significantly higher in the high TG group than in the control group (p < .05; Table 2 ).",
            "cite_spans": [],
            "ref_spans": [
                {
                    "start": 320,
                    "end": 327,
                    "text": "Table 2",
                    "ref_id": null
                }
            ],
            "section": "| RESULTS"
        },
        {
            "text": "Pearson correlation analysis showed that the TG level was positively correlated with fasting blood glucose, leukocyte, serum ferritin, LDH, CRP, and IL-10 levels ( Table 3) . To solve the problem of multicollinearity among related factors, we included them in multiple linear regression equations. The results showed that the factors influencing TG were serum ferritin and IL-10 levels (R 2 = .095; Figure 2 ).",
            "cite_spans": [],
            "ref_spans": [
                {
                    "start": 164,
                    "end": 172,
                    "text": "Table 3)",
                    "ref_id": null
                },
                {
                    "start": 399,
                    "end": 407,
                    "text": "Figure 2",
                    "ref_id": null
                }
            ],
            "section": "| RESULTS"
        },
        {
            "text": "This study showed that patients with elevated TG levels had a higher mortality rate than those with normal levels. TG is degraded by lipoprotein lipase to produce free fatty acids, which can activate the nuclear factor-κB pathway, leading to the high expression level of various proinflammatory cytokines, including TNF-α, IL-1β, IL-6, and monocyte chemoattractant protein-1. 9 Elevated levels of triglyceride-rich particles in the bloodstream may induce local inflammation and the activation of complement and coagulation cascades, ultimately promoting endothelial dysfunction. 10, 11 In addition, TG may be related to the excessive activation of macrophages that causes the deterioration of COVID-19 patients. In this study, regression analysis showed that TG levels were positively correlated with serum ferritin and IL-10 levels. In the course of inflammatory diseases, infections, and malignant diseases, macrophages expressing CD163 obtain iron by clearing hemoglobin. As a result, the synthesis of ferritin in the cells increases, and its release into the blood also increases. 12,13 IL-10 is derived from a variety of cells and is considered to be an inhibitor of inflammation and immunity. It can regulate the metabolism of macrophages by inhibiting the mammalian target of rapamycin complex 1. 14 Many studies, including pathological studies, have shown that macrophage overactivation plays a Fasting blood glucose (mmol/L) 4.11-6.05 5.7 (5.1-7.1) 6.0 (5.3-7.9) 5.6 (5.0-6.5) .321",
            "cite_spans": [
                {
                    "start": 376,
                    "end": 377,
                    "text": "9",
                    "ref_id": "BIBREF8"
                },
                {
                    "start": 579,
                    "end": 582,
                    "text": "10,",
                    "ref_id": "BIBREF9"
                },
                {
                    "start": 583,
                    "end": 585,
                    "text": "11",
                    "ref_id": "BIBREF10"
                }
            ],
            "ref_spans": [],
            "section": "| DISCUSSION"
        },
        {
            "text": "HbA1c (%) 4.0-6.0 6.4 (5.8-7.2) 6.5 (6.0-7.4) 6.2 (5.8-6.6) .069",
            "cite_spans": [],
            "ref_spans": [],
            "section": "| DISCUSSION"
        },
        {
            "text": "Leukocytes (×10 9 /L) 3.5-9.5 5.0 (4.1-6.1) 5.1 (4.3-6.5) 4.9 (3.8-5.9) .115",
            "cite_spans": [],
            "ref_spans": [],
            "section": "| DISCUSSION"
        },
        {
            "text": "Lymphocytes (×10 9 /L) 1.1-3. key role in the inflammatory response and resulting organ damage in patients with severe COVID-19. 15, 16 Activated macrophages can inhibit lipoprotein lipase production to increase TG levels by releasing TNF-α and IL-1. 13 Therefore, we have reason to believe that the positive correlation between TG level, serum ferritin, and IL-10 levels in patients with COVID-19 may be due to macrophage activation, with the level of TG representing the degree of macrophage activation. TG levels are affected by insulin resistance-related diseases (such as type 2 diabetes and impaired fasting glucose), drugs, and diet. 7 Unfortunately, we did not evaluate insulin resistance by plasma insulin, HOMA-R, and other indicators. We excluded familial hyperlipidemia, thereby also excluding the effects of hydroxychloroquine, lopinavir, ritonavir, and lipid-lowering drugs on TG, and 75.9% of the participants were tested for HbA1c. Pearson correlation analysis showed that the TG level was correlated with fasting blood glucose level (r = .156, p = .043) but multivariate regression analysis did not show this correlation.",
            "cite_spans": [
                {
                    "start": 129,
                    "end": 132,
                    "text": "15,",
                    "ref_id": "BIBREF14"
                },
                {
                    "start": 133,
                    "end": 135,
                    "text": "16",
                    "ref_id": "BIBREF15"
                },
                {
                    "start": 251,
                    "end": 253,
                    "text": "13",
                    "ref_id": "BIBREF12"
                },
                {
                    "start": 641,
                    "end": 642,
                    "text": "7",
                    "ref_id": "BIBREF6"
                }
            ],
            "ref_spans": [],
            "section": "| DISCUSSION"
        },
        {
            "text": "This study provides hints that TG metabolism is involved in the pathogenesis of COVID-19 from a clinical perspective, suggesting that this approach can be targeted for prognosis and treatment. All the patients in this study were hospitalized before the global epidemic of COVID-19. At that time, there was no effective intervention except oxygen therapy. The pathophysiological characteristics were more easily revealed in these patients as the natural progression of the disease could be analyzed in the absence of additional therapies. In other words, the lack of effective medication at the time presented with a unique opportunity in this small sample size retrospective research to reveal the relationship between TG and prognosis, serum ferritin, and IL-10.",
            "cite_spans": [],
            "ref_spans": [],
            "section": "| Study strength and limitations"
        },
        {
            "text": "This study has limitations. First of all, this is a small sample size retrospective study conducted in a single geographical area Therefore, the results should be considered as preliminary findings. In particular, the small number of deaths leaves uncertainty whether elevated TG is an independent risk factor for death in COVID-19 patients. Second, due to special circumstance, these patients could not be followed up long-term outside the hospital. The follow-up data is necessary to explore the relationship between inflammation and TG. Thus, larger trials with more prognostic indicators and long-term follow-up are needed to determine the relationship between TG and prognosis.",
            "cite_spans": [],
            "ref_spans": [],
            "section": "| Study strength and limitations"
        },
        {
            "text": "COVID-19 patients with above normal TG levels have a higher mortality rate. The TG level in COVID-19 patients is correlated to serum ferritin and IL-10 levels, which reflects the activation of macrophages. It is suggested that COVID-19 patients be monitored for elevated TG as both a prognostic indicator and potential therapeutic target for COVID-19.",
            "cite_spans": [],
            "ref_spans": [],
            "section": "| CONCLUSION"
        }
    ],
    "bib_entries": {
        "BIBREF0": {
            "ref_id": "b0",
            "title": "Risk factors associated with acute respiratory distress syndrome and death in patients with coronavirus disease 2019 pneumonia in Wuhan, China",
            "authors": [
                {
                    "first": "C",
                    "middle": [],
                    "last": "Wu",
                    "suffix": ""
                },
                {
                    "first": "X",
                    "middle": [],
                    "last": "Chen",
                    "suffix": ""
                },
                {
                    "first": "Y",
                    "middle": [],
                    "last": "Cai",
                    "suffix": ""
                }
            ],
            "year": 2020,
            "venue": "JAMA Intern Med",
            "volume": "180",
            "issn": "7",
            "pages": "934--943",
            "other_ids": {}
        },
        "BIBREF1": {
            "ref_id": "b1",
            "title": "Temporal changes in laboratory markers of survivors and non-survivors of adult inpatients with COVID-19",
            "authors": [
                {
                    "first": "S",
                    "middle": [
                        "M"
                    ],
                    "last": "Ouyang",
                    "suffix": ""
                },
                {
                    "first": "H",
                    "middle": [
                        "Q"
                    ],
                    "last": "Zhu",
                    "suffix": ""
                },
                {
                    "first": "Y",
                    "middle": [
                        "N"
                    ],
                    "last": "Xie",
                    "suffix": ""
                }
            ],
            "year": 2020,
            "venue": "BMC Infect Dis",
            "volume": "20",
            "issn": "1",
            "pages": "20--952",
            "other_ids": {}
        },
        "BIBREF2": {
            "ref_id": "b2",
            "title": "Glycosylated hemoglobin is associated with systemic inflammation, hypercoagulability, and prognosis of COVID-19 patients",
            "authors": [
                {
                    "first": "Z",
                    "middle": [],
                    "last": "Wang",
                    "suffix": ""
                },
                {
                    "first": "Z",
                    "middle": [],
                    "last": "Du",
                    "suffix": ""
                },
                {
                    "first": "F",
                    "middle": [],
                    "last": "Zhu",
                    "suffix": ""
                }
            ],
            "year": 2020,
            "venue": "Diabetes Res Clin Pract",
            "volume": "164",
            "issn": "",
            "pages": "",
            "other_ids": {}
        },
        "BIBREF3": {
            "ref_id": "b3",
            "title": "Large-scale plasma analysis revealed new mechanisms and molecules associated with the host response to SARS-CoV-2",
            "authors": [
                {
                    "first": "E",
                    "middle": [],
                    "last": "Barberis",
                    "suffix": ""
                },
                {
                    "first": "S",
                    "middle": [],
                    "last": "Timo",
                    "suffix": ""
                },
                {
                    "first": "E",
                    "middle": [],
                    "last": "Amede",
                    "suffix": ""
                }
            ],
            "year": 2020,
            "venue": "Int J Mol Sci",
            "volume": "21",
            "issn": "22",
            "pages": "",
            "other_ids": {}
        },
        "BIBREF4": {
            "ref_id": "b4",
            "title": "The SARS-CoV-2 Transcriptional Metabolic Signature In Lung Epithelium",
            "authors": [
                {
                    "first": "A",
                    "middle": [],
                    "last": "Ehrlich",
                    "suffix": ""
                },
                {
                    "first": "S",
                    "middle": [],
                    "last": "Uhl",
                    "suffix": ""
                },
                {
                    "first": "K",
                    "middle": [],
                    "last": "Ioannidis",
                    "suffix": ""
                }
            ],
            "year": null,
            "venue": "",
            "volume": "",
            "issn": "",
            "pages": "",
            "other_ids": {
                "DOI": [
                    "10.2139/ssrn.3650499"
                ]
            }
        },
        "BIBREF5": {
            "ref_id": "b5",
            "title": "Serum triglyceride level and hypertension are highly associated with the recovery of COVID-19 patients",
            "authors": [
                {
                    "first": "L",
                    "middle": [],
                    "last": "Wang",
                    "suffix": ""
                },
                {
                    "first": "Y",
                    "middle": [],
                    "last": "Zhang",
                    "suffix": ""
                },
                {
                    "first": "Y",
                    "middle": [],
                    "last": "Cheng",
                    "suffix": ""
                }
            ],
            "year": 2020,
            "venue": "Am J Transl Res",
            "volume": "12",
            "issn": "10",
            "pages": "6646--6654",
            "other_ids": {}
        },
        "BIBREF6": {
            "ref_id": "b6",
            "title": "NCEP Expert Panel on Detection E, and Treatment of High Blood Cholesterol in Adults Adult Treatment Panel I: Third Report of the National Cholesterol Education Program (NCEP) Expert Panel on Detection, Evaluation, and Treatment of High Blood Cholesterol in Adults",
            "authors": [],
            "year": 2002,
            "venue": "",
            "volume": "106",
            "issn": "",
            "pages": "3143--3421",
            "other_ids": {}
        },
        "BIBREF7": {
            "ref_id": "b7",
            "title": "The Chinese novel coronavirus pneumonia diagnosis and treatment plan (trial version seven",
            "authors": [],
            "year": 2021,
            "venue": "",
            "volume": "",
            "issn": "",
            "pages": "",
            "other_ids": {}
        },
        "BIBREF8": {
            "ref_id": "b8",
            "title": "Obesity, insulin resistance and free fatty acids",
            "authors": [
                {
                    "first": "G",
                    "middle": [],
                    "last": "Boden",
                    "suffix": ""
                }
            ],
            "year": 2011,
            "venue": "Curr Opin Endocrinol Diabetes Obes",
            "volume": "18",
            "issn": "2",
            "pages": "139--143",
            "other_ids": {}
        },
        "BIBREF9": {
            "ref_id": "b9",
            "title": "Elevated remnant-like particle cholesterol concentration: a characteristic feature of the atherogenic lipoprotein phenotype",
            "authors": [
                {
                    "first": "T",
                    "middle": [
                        "B"
                    ],
                    "last": "Twickler",
                    "suffix": ""
                },
                {
                    "first": "G",
                    "middle": [
                        "M"
                    ],
                    "last": "Dallinga-Thie",
                    "suffix": ""
                },
                {
                    "first": "J",
                    "middle": [
                        "S"
                    ],
                    "last": "Cohn",
                    "suffix": ""
                },
                {
                    "first": "M",
                    "middle": [
                        "J"
                    ],
                    "last": "Chapman",
                    "suffix": ""
                }
            ],
            "year": 2004,
            "venue": "Circulation",
            "volume": "109",
            "issn": "16",
            "pages": "1918--1925",
            "other_ids": {}
        },
        "BIBREF10": {
            "ref_id": "b10",
            "title": "The vascular implications of post-prandial lipoprotein metabolism",
            "authors": [
                {
                    "first": "D",
                    "middle": [
                        "R"
                    ],
                    "last": "Sullivan",
                    "suffix": ""
                },
                {
                    "first": "D",
                    "middle": [
                        "S"
                    ],
                    "last": "Celermajer",
                    "suffix": ""
                },
                {
                    "first": "Le",
                    "middle": [],
                    "last": "Couteur",
                    "suffix": ""
                },
                {
                    "first": "D",
                    "middle": [
                        "G"
                    ],
                    "last": "Lam",
                    "suffix": ""
                },
                {
                    "first": "C",
                    "middle": [
                        "W"
                    ],
                    "last": "",
                    "suffix": ""
                }
            ],
            "year": 2004,
            "venue": "Clin Biochem Rev",
            "volume": "25",
            "issn": "1",
            "pages": "19--30",
            "other_ids": {}
        },
        "BIBREF11": {
            "ref_id": "b11",
            "title": "Low glycosylated ferritin, a good marker for the diagnosis of hemophagocytic syndrome",
            "authors": [
                {
                    "first": "L",
                    "middle": [],
                    "last": "Fardet",
                    "suffix": ""
                },
                {
                    "first": "P",
                    "middle": [],
                    "last": "Coppo",
                    "suffix": ""
                },
                {
                    "first": "A",
                    "middle": [],
                    "last": "Kettaneh",
                    "suffix": ""
                },
                {
                    "first": "M",
                    "middle": [],
                    "last": "Dehoux",
                    "suffix": ""
                },
                {
                    "first": "J",
                    "middle": [],
                    "last": "Cabane",
                    "suffix": ""
                },
                {
                    "first": "O",
                    "middle": [],
                    "last": "Lambotte",
                    "suffix": ""
                }
            ],
            "year": 2008,
            "venue": "Arthritis Rheum",
            "volume": "58",
            "issn": "5",
            "pages": "1521--1527",
            "other_ids": {}
        },
        "BIBREF12": {
            "ref_id": "b12",
            "title": "Hemophagocytic lymphohistiocytosis",
            "authors": [
                {
                    "first": "J",
                    "middle": [
                        "M"
                    ],
                    "last": "Michot",
                    "suffix": ""
                },
                {
                    "first": "M",
                    "middle": [],
                    "last": "Hié",
                    "suffix": ""
                },
                {
                    "first": "L",
                    "middle": [],
                    "last": "Galicier",
                    "suffix": ""
                }
            ],
            "year": 2013,
            "venue": "Rev Med Interne",
            "volume": "34",
            "issn": "2",
            "pages": "85--93",
            "other_ids": {}
        },
        "BIBREF13": {
            "ref_id": "b13",
            "title": "Antiinflammatory effect of IL-10 mediated by metabolic reprogramming of macrophages",
            "authors": [
                {
                    "first": "W",
                    "middle": [],
                    "last": "Ip",
                    "suffix": ""
                },
                {
                    "first": "N",
                    "middle": [],
                    "last": "Hoshi",
                    "suffix": ""
                },
                {
                    "first": "D",
                    "middle": [
                        "S"
                    ],
                    "last": "Shouval",
                    "suffix": ""
                },
                {
                    "first": "S",
                    "middle": [],
                    "last": "Snapper",
                    "suffix": ""
                },
                {
                    "first": "R",
                    "middle": [],
                    "last": "Medzhitov",
                    "suffix": ""
                }
            ],
            "year": 2017,
            "venue": "Science",
            "volume": "356",
            "issn": "6337",
            "pages": "513--519",
            "other_ids": {}
        },
        "BIBREF14": {
            "ref_id": "b14",
            "title": "Clinical criteria for COVID-19-associated hyperinflammatory syndrome: a cohort study",
            "authors": [
                {
                    "first": "B",
                    "middle": [
                        "J"
                    ],
                    "last": "Webb",
                    "suffix": ""
                },
                {
                    "first": "I",
                    "middle": [
                        "D"
                    ],
                    "last": "Peltan",
                    "suffix": ""
                },
                {
                    "first": "P",
                    "middle": [],
                    "last": "Jensen",
                    "suffix": ""
                }
            ],
            "year": 2020,
            "venue": "Lancet Rheumatol",
            "volume": "2",
            "issn": "12",
            "pages": "754--763",
            "other_ids": {}
        },
        "BIBREF15": {
            "ref_id": "b15",
            "title": "Pathological inflammation in patients with COVID-19: a key role for monocytes and macrophages",
            "authors": [
                {
                    "first": "M",
                    "middle": [],
                    "last": "Merad",
                    "suffix": ""
                },
                {
                    "first": "J",
                    "middle": [
                        "C"
                    ],
                    "last": "Martin",
                    "suffix": ""
                }
            ],
            "year": 2020,
            "venue": "Nat Rev Immunol",
            "volume": "20",
            "issn": "6",
            "pages": "355--362",
            "other_ids": {}
        },
        "BIBREF16": {
            "ref_id": "b16",
            "title": "Serum triglyceride levels and related factors as prognostic indicators in COVID-19 patients: a retrospective study",
            "authors": [
                {
                    "first": "P",
                    "middle": [],
                    "last": "Zhong",
                    "suffix": ""
                },
                {
                    "first": "Z",
                    "middle": [],
                    "last": "Wang",
                    "suffix": ""
                },
                {
                    "first": "Z",
                    "middle": [],
                    "last": "Du",
                    "suffix": ""
                }
            ],
            "year": 2021,
            "venue": "Immun Inflamm Dis",
            "volume": "9",
            "issn": "",
            "pages": "1055--1060",
            "other_ids": {
                "DOI": [
                    "10.1002/iid3.469"
                ]
            }
        }
    },
    "ref_entries": {
        "FIGREF1": {
            "text": "CK, creatine kinase; CRP, C-reactive protein; ESR, erythrocyte sedimentation rate; Fbg, fibrinogen; HbA1c, glycosylated hemoglobin; IL, interleukin; IQR, interquartile range; LDH, lactate dehydrogenase; TG, triglycerides; TNF-α, tumor necrosis factor-α. F I G U R E 1 Comparison of survival rate between high TG group and control group. TG, triglycerides T A B L E 3 Pearson correlation analysis of TG in COVID-19 patients",
            "latex": null,
            "type": "figure"
        }
    },
    "back_matter": [
        {
            "text": "The authors would like to acknowledge the contribution of the survey team members. This study was supported by Natural Science Foundation of Beijing municipality AUTHOR CONTRIBUTIONS Peng Zhong and Zhenzhou Wang designed the study, wrote and revised the manuscript. Zhe Du reviewed the manuscript. All authors read and approved the final manuscript.",
            "cite_spans": [],
            "ref_spans": [],
            "section": "ACKNOWLEDGMENTS"
        },
        {
            "text": "The authors declare that there are no conflict of interests.",
            "cite_spans": [],
            "ref_spans": [],
            "section": "CONFLICT OF INTERESTS"
        },
        {
            "text": "Ethical clearance for this study was granted by the Ethic Committee of Peking University People's Hospital. Because only the medical records were reviewed, this case series was exempted from signing the informed consent.",
            "cite_spans": [],
            "ref_spans": [],
            "section": "ETHICS STATEMENT"
        },
        {
            "text": "The data sets are available from the corresponding author on reasonable request.",
            "cite_spans": [],
            "ref_spans": [],
            "section": "DATA AVAILABILITY STATEMENT"
        },
        {
            "text": "http://orcid.org/0000-0003-0311-2916",
            "cite_spans": [],
            "ref_spans": [],
            "section": "Zhe Du"
        }
    ]
}