{
    "paper_id": "0a5b486e00373f1cbb243965975513accfe354b4",
    "metadata": {
        "title": "",
        "authors": [
            {
                "first": "Annelet",
                "middle": [],
                "last": "Kruger",
                "suffix": "",
                "affiliation": {
                    "laboratory": "",
                    "institution": "University of Pretoria",
                    "location": {
                        "settlement": "Pretoria",
                        "country": "South Africa"
                    }
                },
                "email": ""
            },
            {
                "first": "Owen",
                "middle": [
                    "O"
                ],
                "last": "Eales",
                "suffix": "",
                "affiliation": {
                    "laboratory": "",
                    "institution": "University of Pretoria",
                    "location": {
                        "settlement": "Pretoria",
                        "country": "South Africa"
                    }
                },
                "email": "oweneales@gmail.com"
            },
            {
                "first": "Sanet",
                "middle": [],
                "last": "Jansen Van Vuuren",
                "suffix": "",
                "affiliation": {
                    "laboratory": "National Health Laboratory Service",
                    "institution": "Kungwini Welfare Organisation",
                    "location": {
                        "settlement": "Zwavelpoort, Pretoria",
                        "country": "South Africa"
                    }
                },
                "email": ""
            },
            {
                "first": "Owen",
                "middle": [],
                "last": "Eales",
                "suffix": "",
                "affiliation": {},
                "email": ""
            }
        ]
    },
    "abstract": [],
    "body_text": [
        {
            "text": "The concept of Health Catchment Areas (HCA), as a defined geographic portion of the Health District, has been used by the Department of Family Medicine at the University of Pretoria (UP) to divide Tshwane District into manageable areas governed by family physicians in primary care. The family physician takes responsibility for all primary care facilities, old age homes, special needs facilities and health related activities in this area. The family physician previously fulfilled all their different roles through being physically present and moving around the HCA. As a result of the coronavirus disease 2019 (COVID-19) pandemic, the key roles of the Family Physician (clinician, consultant, capacity-builder, clinical trainer, leader of clinical governance, and champion of community orientated primary care [COPC]) had to be applied in a new context. 1",
            "cite_spans": [],
            "ref_spans": [],
            "section": "Introduction"
        },
        {
            "text": "This report describes the virtual support provided by two family physicians to Paul Jungnickel Home (PJH), a mental healthcare institution in their HCA in Tshwane, during the first wave of the pandemic in 2020. Paul Jungnickel Home is a residential care facility that offers medical and residential care to 160 severe and profoundly disabled adults. The Department of Family Medicine at UP has given clinical support and coordinated care for the home since 2010 and provided on-site support during two Shigella outbreaks. The COVID-19 pandemic presented the healthcare team at PJH with some very specific challenges. Patients with severe intellectual impairments struggled to adhere to general COVID-19 prevention measures such as wearing mask, social distancing and using hand sanitizer. Many of these patients had comorbidities, limited mobility and obesity. Because of these factors, the team expected rapid spread of the virus and a high mortality rate. In addition, these patients would not be prioritised for intensive care or ventilation, particularly in this resource limited setting.",
            "cite_spans": [],
            "ref_spans": [],
            "section": "Background"
        },
        {
            "text": "An on-site facility readiness assessment and disaster management plan were completed in April 2020, after the facility went into a strict lockdown. Everyone realised that it would not be business as usual, and that technology would play a big role in providing support.",
            "cite_spans": [],
            "ref_spans": [],
            "section": "Background"
        },
        {
            "text": "Telemedicine and the use of digital health technologies have long been discussed as a potential solution to many challenges, including primary care. The COVID-19 pandemic dramatically During the start of the first wave of the coronavirus disease 2019 (COVID-19) pandemic, two family physicians in Tshwane, South Africa, reviewed the people at high-risk within their Health Catchment Area. The largest residential mental health care facility in Gauteng fell under their care, and they were responsible for providing care and support to this facility. Family physicians have to lead the primary care team and simultaneously take care of the well-being of their team members. This report discusses how these family physicians used digital platforms and virtual care to successfully coordinate and manage the response to an outbreak of COVID-19 at this mental healthcare facility. catalysed the uptake of these technologies in a matter of weeks. 2 Telemedicine assisted in providing early interventions in the context of the restriction of movement during lockdown. It minimised infection risk to non-infected individuals, contributed to the effective use of doctors' time and assisted in optimising the workload. 3 The use of WhatsApp has been promoted as a tool to provide clinical assistance and screen potential urgent cases. 4 Informed by existing literature on the topic, a virtual coordination of care plan was devised to support the patients of PJH in their home-based care setting.",
            "cite_spans": [
                {
                    "start": 942,
                    "end": 943,
                    "text": "2",
                    "ref_id": "BIBREF1"
                },
                {
                    "start": 1210,
                    "end": 1211,
                    "text": "3",
                    "ref_id": "BIBREF2"
                },
                {
                    "start": 1326,
                    "end": 1327,
                    "text": "4",
                    "ref_id": "BIBREF3"
                }
            ],
            "ref_spans": [],
            "section": "Virtual coordination of care"
        },
        {
            "text": "The first COVID-19 case in PJH, diagnosed on 28 June 2020, was a staff member and three days later the first resident tested positive. A WhatsApp group with the nursing sisters and the family physicians was formed to facilitate real-time communication. Additionally, daily meetings were arranged via Zoom. Each of these two communication platforms provided unique features and opportunities. The WhatsApp group facilitated real-time communication where questions, results and clinical images could be shared and responded to. Zoom provided the opportunity to do daily 'virtual ward rounds' where patients could be discussed and advice given. Directions on the use of blood tests, oxygen concentrators, antibiotics and steroids were given daily. The information gained by making use of these platforms made it simple for the family physicians to refer patients to hospital if they could not be managed at the PJH.",
            "cite_spans": [],
            "ref_spans": [],
            "section": "Keywords"
        },
        {
            "text": "Between June 2020 and August 2020, only 13 patients out of a total of 160 patients tested positive. The effective and timeous quarantine and isolation procedures contributed to the containment of the disease within PJH. Of the infected patients, two were referred to hospital, four needed oxygen therapy at PJH and only one patient passed away.",
            "cite_spans": [],
            "ref_spans": [],
            "section": "Keywords"
        },
        {
            "text": "Through the support of PJH by the Department of Family Medicine, valuable lessons were learnt on being responsive to challenges and thinking outside the box. Without being physically present, it was still possible to fulfil all the key roles of a family physician in the HCA. The use of technology to provide virtual care was a timesaving measure and allowed for real time support that was quicker than the traditional face-to-face interactions. Team building and strengthening of networks in the HCA specifically benefited from the use of virtual platforms and WhatsApp groups. Figure 1 summarises the different roles of the family physician and how technology made them possible.",
            "cite_spans": [],
            "ref_spans": [
                {
                    "start": 579,
                    "end": 587,
                    "text": "Figure 1",
                    "ref_id": null
                }
            ],
            "section": "Lessons learnt"
        },
        {
            "text": "The nursing manager of PJH summarised the impact of this support during the COVID-19 pandemic well: ",
            "cite_spans": [],
            "ref_spans": [],
            "section": "Lessons learnt"
        },
        {
            "text": "The support to the PJH represents one of the many contributions that family physicians in primary care made during the first wave of the COVID-19 pandemic in Tshwane District. Assistance with planning, co-ordinating clinical care and responsiveness led to an excellent outcome during the COVID-19 outbreak and affirms the importance of the different roles that family physicians play in the South African health context. It also shows the advantages of using innovative strategies and technology to fulfil these different roles.",
            "cite_spans": [],
            "ref_spans": [],
            "section": "Conclusion"
        }
    ],
    "bib_entries": {
        "BIBREF0": {
            "ref_id": "b0",
            "title": "The contribution of family physicians to district health services: A national position paper for South Africa",
            "authors": [
                {
                    "first": "R",
                    "middle": [],
                    "last": "Mash",
                    "suffix": ""
                },
                {
                    "first": "G",
                    "middle": [],
                    "last": "Ogunbanjo",
                    "suffix": ""
                },
                {
                    "first": "S",
                    "middle": [
                        "S"
                    ],
                    "last": "Naidoo",
                    "suffix": ""
                },
                {
                    "first": "D",
                    "middle": [],
                    "last": "Hellenberg",
                    "suffix": ""
                }
            ],
            "year": 2015,
            "venue": "S Afr Fam Pract",
            "volume": "57",
            "issn": "3",
            "pages": "54--61",
            "other_ids": {}
        },
        "BIBREF1": {
            "ref_id": "b1",
            "title": "Digital health and care in pandemic times: Impact COVID-19",
            "authors": [
                {
                    "first": "N",
                    "middle": [],
                    "last": "Peek",
                    "suffix": ""
                },
                {
                    "first": "M",
                    "middle": [],
                    "last": "Sujan",
                    "suffix": ""
                },
                {
                    "first": "P",
                    "middle": [],
                    "last": "Scott",
                    "suffix": ""
                }
            ],
            "year": 2020,
            "venue": "BMJ Health Care Inform",
            "volume": "27",
            "issn": "1",
            "pages": "2--4",
            "other_ids": {
                "DOI": [
                    "10.1136/bmjhci-2020-100166"
                ]
            }
        },
        "BIBREF2": {
            "ref_id": "b2",
            "title": "Role of telemedicine in healthcare during COVID-19 pandemic in developing countries",
            "authors": [
                {
                    "first": "M",
                    "middle": [
                        "A"
                    ],
                    "last": "Kadir",
                    "suffix": ""
                }
            ],
            "year": 2020,
            "venue": "Telehealth Med Today",
            "volume": "5",
            "issn": "2",
            "pages": "1--5",
            "other_ids": {
                "DOI": [
                    "10.30953/tmt.v5.187"
                ]
            }
        },
        "BIBREF3": {
            "ref_id": "b3",
            "title": "A simple tool to a complex reality -WhatsApp use in a developing country during COVID-19 pandemic",
            "authors": [
                {
                    "first": "L",
                    "middle": [
                        "A"
                    ],
                    "last": "Gueiros",
                    "suffix": ""
                },
                {
                    "first": "T",
                    "middle": [
                        "S"
                    ],
                    "last": "Melo",
                    "suffix": ""
                },
                {
                    "first": "V",
                    "middle": [
                        "C"
                    ],
                    "last": "Carrard",
                    "suffix": ""
                }
            ],
            "year": 2021,
            "venue": "Oral Dis",
            "volume": "27",
            "issn": "S3",
            "pages": "796--797",
            "other_ids": {
                "DOI": [
                    "10.1111/odi.13495"
                ]
            }
        }
    },
    "ref_entries": {
        "TABREF0": {
            "text": ": family medicine; coordination of care; virtual; health catchment area; WhatsApp; Zoom. contribution of family physicians to residential mental health care during the COVID-19 pandemic in Tshwane District, South Africa",
            "latex": null,
            "type": "table"
        },
        "TABREF1": {
            "text": "'The fact that only one patient at PJH [Paul Jungnickel Home] died from COVID-19 [coronavirus disease 2019] is truly remarkable. It would not have been possible without the support of the two family physicians during this crisis time. They empowered us as nurses and assisted in procuring the necessary tools to provide treatment to very special and complex patients in their own safe, home environment. Their moral support was invaluable.' (S.J.v.V., Nursing manger, 4 May 2021)",
            "latex": null,
            "type": "table"
        }
    },
    "back_matter": [
        {
            "text": "The authors wish to acknowledge Dr M. Jordaan and Prof. I. Govender for proof reading of the article.",
            "cite_spans": [],
            "ref_spans": [],
            "section": "Acknowledgements"
        },
        {
            "text": "The authors received no financial support for the research, authorship and/or publication of this article.",
            "cite_spans": [],
            "ref_spans": [],
            "section": "Funding information"
        },
        {
            "text": "Data sharing is not applicable to this article, as no new data were created or analysed in this study.",
            "cite_spans": [],
            "ref_spans": [],
            "section": "Data availability"
        },
        {
            "text": "The views and opinions expressed are those of the authors and do not necessarily reflect the views of the affiliated agency.",
            "cite_spans": [],
            "ref_spans": [],
            "section": "Disclaimer"
        },
        {
            "text": "The authors declare that they have no financial or personal relationships that may have inappropriately influenced them in writing this article. ",
            "cite_spans": [],
            "ref_spans": [],
            "section": "Competing interests"
        },
        {
            "text": "This article followed all ethical standards for research without direct contact with human or animal subjects.",
            "cite_spans": [],
            "ref_spans": [],
            "section": "Ethical considerations"
        }
    ]
}