{
    "paper_id": "0a60b25867f5bf0a49deba6e7f4bd35ef785a4ca",
    "metadata": {
        "title": "The nowhere people: Lived experiences of migrant workers during Covid-19 in India",
        "authors": [
            {
                "first": "Chetna",
                "middle": [],
                "last": "Duggal",
                "suffix": "",
                "affiliation": {
                    "laboratory": "",
                    "institution": "Tata Institute of Social Sciences",
                    "location": {
                        "settlement": "Mumbai",
                        "country": "India"
                    }
                },
                "email": ""
            },
            {
                "first": "Sukanya",
                "middle": [],
                "last": "Ray",
                "suffix": "",
                "affiliation": {
                    "laboratory": "",
                    "institution": "Tata Institute of Social Sciences",
                    "location": {
                        "settlement": "Mumbai",
                        "country": "India"
                    }
                },
                "email": ""
            },
            {
                "first": "Rajani",
                "middle": [],
                "last": "Konantambigi",
                "suffix": "",
                "affiliation": {
                    "laboratory": "",
                    "institution": "Tata Institute of Social Sciences",
                    "location": {
                        "settlement": "Mumbai",
                        "country": "India"
                    }
                },
                "email": ""
            },
            {
                "first": "Arushi",
                "middle": [],
                "last": "Kothari",
                "suffix": "",
                "affiliation": {
                    "laboratory": "",
                    "institution": "University of Delhi",
                    "location": {
                        "settlement": "New Delhi",
                        "country": "India"
                    }
                },
                "email": ""
            }
        ]
    },
    "abstract": [
        {
            "text": "The Covid-19 pandemic has brought about a wave of changes in the lives of people across the world, especially those from marginalized communities. The study aimed to understand the lived experiences of migrant workers during the early months of the pandemic using a qualitative phenomenological approach. Thirteen men working as migrant workers in Mumbai, India were interviewed telephonically and the data obtained was analysed using thematic analysis. Migrant workers highlighted the challenges they experienced in getting back home, fears of dying alone away from home, the stress of unemployment and poverty and its impact on them and their families. They expressed feelings of guilt, shame, and helplessness about not knowing what will happen in the future. Using an intersectional lens the study highlights how the identity of being a migrant worker further marginalised these individuals, thereby impacting their well-being and presents implications for mental health policy and practice.",
            "cite_spans": [],
            "ref_spans": [],
            "section": "Abstract"
        }
    ],
    "body_text": [
        {
            "text": "The Covid-19 pandemic has created a new 'normal' that was unthinkable till a year and a half ago. The pandemic has not just been a public health crisis; it has led to a new psychosocial experience wherein terms like 'lockdown' and 'social distancing' have become a part of daily discourse. In fact, never has an event in the recent past had such an overwhelming impact that an entire period of time is referred to by the name of the crisis itself. The phrase \"Corona times\" or \"Covid times\" is used to depict the entirety of the psychological and social disruptions and transformations that have occurred since the pandemic struck most countries across the world. The experience of the pandemic, however, has been far from homogeneous. While it is true that Covid-19 has had a devastating impact on the lives and livelihoods of people, individuals' experiences have been determined by their social location and their positions of privilege. During these times, those who are socio-economically advantaged have had access to essential services, quality health and mental health care, and insurance facilities. Simultaneously, traditionally disadvantaged groups have faced unique risks and consequences that have pushed them even further away from the mainstream.",
            "cite_spans": [],
            "ref_spans": [],
            "section": ""
        },
        {
            "text": "When we focus on marginalised and disadvantaged groups, the discourse on access, equity, equality and social justice needs to be embedded within the larger idea of intersectionality. Crenshaw (as cited in Steinmetz, 2020, para 3) defined intersectionality as \"a lens, a prism, for seeing the way in which various forms of inequality often operate together and exacerbate each other...and the experience (of inequality) is not just the sum of its parts. Intersectionality as an idea originally focused on the intersection between race and gender, but has significantly expanded to focusing on \"simultaneous oppressions\" that individuals and groups experience by virtue of many other social identities such as gender, caste, class, race, geography, etc. (Carastathis, 2014, p.307) . For instance, Lewis (2020) has described the coronavirus pandemic as a disaster for feminism, especially because of the unequal burden that women have suffered due to lockdown. Bowleg (2020) coined the phrase \"We're Not All in This Together\" in the context of Covid-19 pandemic and highlighted that the 'collective we' in our imagination is not so uniform and homogeneous; and that structural inequalities demand special attention be given to needs of those who are invisibilised in mainstream public discourse.",
            "cite_spans": [
                {
                    "start": 752,
                    "end": 778,
                    "text": "(Carastathis, 2014, p.307)",
                    "ref_id": null
                },
                {
                    "start": 795,
                    "end": 807,
                    "text": "Lewis (2020)",
                    "ref_id": "BIBREF19"
                },
                {
                    "start": 958,
                    "end": 971,
                    "text": "Bowleg (2020)",
                    "ref_id": "BIBREF2"
                }
            ],
            "ref_spans": [],
            "section": ""
        },
        {
            "text": "It is within this framework that this paper attempts to bring to the forefront the voices of migrant workers in India, a group that experienced an acute humanitarian crisis after the lockdown was announced in India on 23 March 2020.",
            "cite_spans": [],
            "ref_spans": [],
            "section": ""
        },
        {
            "text": "Due to unequal growth and urbanisation across the different states, inter-state migrants move from less-developed areas to more-developed areas such as metropolitan cities in the hope of earning a better livelihood (Kundu & Sarangi, 2007) . Maharashtra accounts for one of the largest share of migrants who have moved to the state for better employment opportunities with about 60 lakh migrants as per Census 2011 (Iyer, 2020) . Migrant workers form an essential part of the backbone of metropolitan cities helping make up for labour shortfalls at minimum wages. Yet at another level they truly exist at the periphery in shanties and slums with bare minimum facilities. Due to the mobile nature of their existence (most are registered as voters in their hometowns), they often form a non-voting group in their destination cities-and thus are often rendered politically insignificant despite their large numbers (Bijoor, 2020) . \"They\" are invisible, yet their mere presence makes \"us\" more visible, by allowing for well-functioning cities.",
            "cite_spans": [
                {
                    "start": 215,
                    "end": 238,
                    "text": "(Kundu & Sarangi, 2007)",
                    "ref_id": "BIBREF17"
                },
                {
                    "start": 414,
                    "end": 426,
                    "text": "(Iyer, 2020)",
                    "ref_id": "BIBREF14"
                },
                {
                    "start": 911,
                    "end": 925,
                    "text": "(Bijoor, 2020)",
                    "ref_id": "BIBREF1"
                }
            ],
            "ref_spans": [],
            "section": "Migrant Workers during Covid-19: A Humanitarian Crisis"
        },
        {
            "text": "The first case of Covid-19 in India was detected at the end of January 2020, after which the number of cases showed low growth in February 2020, with most cases restricted to those who had travelled abroad. However from March 2020 onwards, the number of cases started rising steadily and fears of community transmission (stage in the spread of an infection when it becomes impossible to know the source of infection in a given community) grew, resulting in a 3 week long strict lockdown being announced in March 2020 (Vara, 2020) , which was further extended to another few months. During the lockdown, to prevent the further spread of the infection and shore up medical facilities, the government banned all non-essential movement and activities across the entire country.",
            "cite_spans": [
                {
                    "start": 517,
                    "end": 529,
                    "text": "(Vara, 2020)",
                    "ref_id": "BIBREF23"
                }
            ],
            "ref_spans": [],
            "section": "Migrant Workers during Covid-19: A Humanitarian Crisis"
        },
        {
            "text": "As work opportunities and piecemeal savings dried up due to the lockdown and uncertainty set in about the nature and duration of the lockdown, migrants started demanding the right to travel back to their hometowns and villages. In the absence of any public transportation available till May 2020, many started walking back home, hundreds of kilometers away from their destination cities. Others paid exorbitant amounts to arrange for private transport, which further put stress on their already precarious circumstances. Government data suggest that about 6700000 migrants travelled home from their cities of work during the lockdown period, precipitating an unprecedented psychosocial and structural crisis (Mathew, 2020) . Chander et al. (2020) focused on the experiences of migrant workers living in shelter camps in Bangalore, India during the pandemic. They found that some of the key concerns faced by the migrant workers included uncertainty about the future, fear of being abandoned by their employers, substance use issues and concerns about other health issues. Similarly, Choudhari (2020) highlighted the fact that migrant workers are uniquely vulnerable due to their socio-economic status, poor living conditions and chronic malnutrition, absence of family support, absence of effective laws for the unorganised sector and barriers in accessing psychiatric help. Choudhari (2020) also emphasized these vulnerabilities as a breeding ground for peritraumatic psychological distress for internal migrant workers.",
            "cite_spans": [
                {
                    "start": 708,
                    "end": 722,
                    "text": "(Mathew, 2020)",
                    "ref_id": "BIBREF20"
                },
                {
                    "start": 725,
                    "end": 746,
                    "text": "Chander et al. (2020)",
                    "ref_id": "BIBREF6"
                },
                {
                    "start": 1083,
                    "end": 1099,
                    "text": "Choudhari (2020)",
                    "ref_id": "BIBREF7"
                }
            ],
            "ref_spans": [],
            "section": "Migrant Workers during Covid-19: A Humanitarian Crisis"
        },
        {
            "text": "This paper documents the lived experiences of thirteen men migrant workers during the Covid-19 pandemic in the months of April-June 2020.",
            "cite_spans": [],
            "ref_spans": [],
            "section": "Method"
        },
        {
            "text": "With the aim to document the lived experiences of migrant workers during the pandemic, a qualitative approach to inquiry was adopted. Knapik (2006) has highlighted that qualitative research \"focuses on learning about people's often deeply meaningful and emotionally laden personal experiences\" (p.77). The phenomenological paradigm was used to guide this research, with the aim to privilege the voices of the participants and understand their unique experiences related to Covid-19 within their intersectional realities. Qualitative phenomenological research focuses on the 'what' and 'how' of the experience (Moustakas, 1994) . Carel et al. (2020) have highlighted the importance of phenomenological work in the context of the pandemic due to the disruptions in interpersonal and social experiences caused due to various preventive measures. Some of these changes have brought people together while others have magnified existing disparities. In exploring the lived experiences of a marginalized and vulnerable group, this study brings forth the realities of the pandemic for migrant workers in India.",
            "cite_spans": [
                {
                    "start": 134,
                    "end": 147,
                    "text": "Knapik (2006)",
                    "ref_id": "BIBREF15"
                },
                {
                    "start": 609,
                    "end": 626,
                    "text": "(Moustakas, 1994)",
                    "ref_id": "BIBREF21"
                },
                {
                    "start": 629,
                    "end": 648,
                    "text": "Carel et al. (2020)",
                    "ref_id": "BIBREF5"
                }
            ],
            "ref_spans": [],
            "section": "Approach to Inquiry"
        },
        {
            "text": "Qualitative research methods such as interviews allow for an in-depth understanding of individuals' experiences (DiCicco-Bloom & Crabtree, 2006) . In-depth interviewing as a technique helped to explore individual narratives and how they may have been shaped by intersectional realities. This allowed for understanding the complexity and the nuances of peoples' lives and experiences of Covid-19 in a manner that is experience-near and reflective of their contextual realities. An interview guide was developed to explore the following domains -understanding about the pandemic, practices followed, meaning making, the psychological, social and economic impact of Covid-19. Some of the questions asked were: Why do you think the pandemic happened? What kind of precautions are you taking? How has the pandemic impacted your work? How has Covid-19 impacted you, your family and your relationships? How have you been managing during the Covid-19 pandemic?",
            "cite_spans": [
                {
                    "start": 112,
                    "end": 144,
                    "text": "(DiCicco-Bloom & Crabtree, 2006)",
                    "ref_id": "BIBREF10"
                }
            ],
            "ref_spans": [],
            "section": "Tool"
        },
        {
            "text": "The study was conducted in May 2020 when there was a strict lockdown in the entire country. The participants were contacted through relief organisations and NGOs that were working with migrant workers in Mumbai. Since most migrant workers had moved back to their home villages outside of Mumbai, they were contacted telephonically. Telephonic interviews were conducted as most participants had moved back to their villages and it was not possible to meet them in person due to lockdown restrictions. Many participants lived in areas with poor connectivity or did not have the minimum currency in their phones to speak on the phone, which added further challenges to getting access to participants. The interviews were conducted over the phone once consent was obtained. All interviews were conducted in vernacular languages of Hindi and Bengali by the research assistants and later translated into English.",
            "cite_spans": [],
            "ref_spans": [],
            "section": "Procedure"
        },
        {
            "text": "Participants in the study were men in the age range of 20-32 years belonging to villages in West Bengal and Uttar Pradesh who had been living and working in Mumbai, Maharashtra, prior to the lockdown. The demographic details of the participants have been mentioned in the table below ( Table 1) . The names and identifying information of the participants were changed to ensure anonymity.",
            "cite_spans": [],
            "ref_spans": [
                {
                    "start": 286,
                    "end": 294,
                    "text": "Table 1)",
                    "ref_id": "TABREF0"
                }
            ],
            "section": "Participants"
        },
        {
            "text": "The research was reviewed and cleared for ethical compliance by the Institutional Review Board (IRB) at Tata Institute of Social Sciences. The research assistants explained the purpose of the study to the participants and took oral consent to participate in the study. They were provided with helpline numbers as well as contact persons in relief organisations who could address their specific concerns in case they were not already connected to one. The research assistants were trained and supervised by the lead researchers so as to ensure that the research process followed the highest degree of ethical standards. Confidentiality and anonymity were maintained and participants were allowed to withdraw at any point if they felt uncomfortable. Participation in the study was completely voluntary and no financial incentive was offered in exchange of participation.",
            "cite_spans": [],
            "ref_spans": [],
            "section": "Ethics"
        },
        {
            "text": "To establish trustworthiness of the data, regular peer debriefing and research meetings were conducted to develop feedback and consensus mechanisms regarding the research process. Each step of the analysis was documented and feedback shared with the team to ensure confirmability. Thick description of various themes have been presented and researchers' dilemmas and reflexivity have also been integrated.",
            "cite_spans": [],
            "ref_spans": [],
            "section": "Ethics"
        },
        {
            "text": "The process of conducting research also has many insights to offer in understanding an experience. It creates an opportunity for researchers to reflect on the limits and possibilities of understanding an experience and finally helps them understand their own place in the research process. In our research, since most participants did not have any savings to rely on, they often asked the interviewers if they knew of any way that the government could provide them financial relief and support. This was a challenging moment for the research team-while we could offer contacts for relief agencies and non-governmental organisations, we were not in a position to offer immediate financial aid. The process of immersing ourselves in the interview data also generated a lot of questions. What could we offer to this group besides a space to share and voice their concerns? How do we manage our own distress and what space does it occupy in the research process? Is there a them vs. us? How do we reimagine a language of inclusion? These questions need to be reflected on and also highlight the nature of power exerted within the research process and its impact on the 'researcher' as well as the 'researched'. Certain practices were considered to ensure that we were sensitive and responsive to our participants and our team. We were mindful of the language that we used and made an honest effort to avoid objectifying the experiences of migrant workers. For instance, in the use of the pronoun they/them, we retained an awareness that it could very well be me or us facing similar dilemmas had we been in the position that our participants were in. We recognize and acknowledge the fact that individual circumstances, social location and context have a very important role to play in the psychological experience of Covid-19.",
            "cite_spans": [],
            "ref_spans": [],
            "section": "'Being a researcher' in a Crisis Period"
        },
        {
            "text": "One of the challenges of interviewing participants telephonically who are presently in distress is the limitation to how much probing is possible. Even though consent for participation in the study was taken, participants were not always available for detailed conversation, or were hesitant to speak on the phone for a long duration, as they were dealing with many constraints and challenges, including financial insecurity and distress. At these times, it was not considered appropriate to probe further or shift focus to explore other aspects of their experiences. We believe that especially while working with people in traumatic crises it is absolutely essential to respect their realities and the limits placed by those on the research process. An ethical choice was made to prioritise participant comfort and readiness over the 'thickness of data'. Brzuzy et al. (1997) have also highlighted this dilemma as an ethical 'tension' (p.79), between the need to get in-depth information and the possibility of retraumatization.",
            "cite_spans": [
                {
                    "start": 856,
                    "end": 876,
                    "text": "Brzuzy et al. (1997)",
                    "ref_id": "BIBREF3"
                }
            ],
            "ref_spans": [],
            "section": "'Being a researcher' in a Crisis Period"
        },
        {
            "text": "The conversations with the participants deeply impacted the research team and generated distress and concern, often leaving the team feeling helpless with an acute awareness of the privileges that we had. This became especially challenging when participants spoke of their socio-economic hardships and contrasted them with those who were more privileged. The team members who were transcribing the interviews also reported distress on hearing the recordings of the plight experienced by the participants. An effort was made to help contain, validate and make sense of the experiences of the research and transcribing teams through regular debriefing meetings conducted by the lead researchers. In providing this supportive space, there was an acknowledgment that we as researchers hold our participants' distress in our minds, and our minds also become a part of the research field. In these co-constructing conversations, our experiences, dilemmas and questions are equally critical.",
            "cite_spans": [],
            "ref_spans": [],
            "section": "'Being a researcher' in a Crisis Period"
        },
        {
            "text": "The data obtained was recorded, transcribed verbatim and translated simultaneously from vernacular languages to English by bilingual research assistants. Key quotes or expressions were written in both the vernacular language and English so as to retain the essence of the expression. The data was read and re-read both by the research assistants as well as the lead researchers to generate codes. The codes and themes were finalised after discussions within the research team and member consensus was generated. The Modified Stevick-Colaizzi-Keen method as identified by Moustakas (1994) was used for analysis. It involved six steps of data analysis starting from a comprehensive description of experiences, identification of key statements followed by grouping them in meaningful units, generation of a description of the what was experienced and how it was experienced and finally the creation of a composite description that includes both the how and what of the experience.",
            "cite_spans": [
                {
                    "start": 571,
                    "end": 587,
                    "text": "Moustakas (1994)",
                    "ref_id": "BIBREF21"
                }
            ],
            "ref_spans": [],
            "section": "Analysis"
        },
        {
            "text": "The following section discusses the experiences of migrant workers as they began their journey back home, their negotiation of the reality of Covid-19 and the challenges and losses that they faced along the way. Finally, the impact of Covid-19 on them and their relationships is discussed alongside the economic pressures that they were experiencing.",
            "cite_spans": [],
            "ref_spans": [],
            "section": "Results"
        },
        {
            "text": "Starting their Journey: When Home Seems Too Far Participants decided to return home from Mumbai to their native villages in West Bengal and Uttar Pradesh after the announcement of the lockdown in March 2020. Their decision to go back was motivated by different pressures-fear of getting Covid-19 and having no one around, no money or social protection to sustain themselves in one of the most expensive cities of India and wanting to be with family in the midst of a pandemic. Many of them had to borrow money to arrange for travel back home (since inter-state public and private transport was suspended). Amal, a 32-year-old tailor spoke of his experience and said, \"We rented a bus to come home. For the fare, our family had to deposit their valuables as security in return for money and send that to us with which we paid for our journey.\" Going back to their villages was an ordeal for most participants, especially the struggle to find affordable transportation. And not everyone made it back home. Rehman said \"The day we were returning from Bombay… maybe 50 of them died. Who died there? Did rich people die? It was the poor people that died.\" Another participant, Imran, a 20-year-old mason, at the time of the research interviews, had still not been able to get back home. He spoke of his experience and shared that \"Since I am not at home, I do not like anything at all…only thinking when I will be back at home and stay with my parents…this is all I am thinking about…please make some arrangement, otherwise I will die.\" The research team provided him with contacts of relief organisations, but the sheer desperation and panic at not being able to get back home brought about a lot of tension and worry for him. He further shared that \"I feel morose that my friends are at home now…while I am stuck in a foreign land (\"bideshe pore achi\").",
            "cite_spans": [],
            "ref_spans": [],
            "section": "Results"
        },
        {
            "text": "Negotiating the Realities of Covid-19 Most participants took necessary precautions both when they were in Mumbai and when they came back to deal with the pandemic. They would leave their homes only to buy essentials, wear masks while going out, wash their hands regularly and maintain social distancing. None of them mentioned experiencing any physical symptoms and those who had to undergo mandatory testing did not test positive for Covid-19. Majority of the participants said that they knew the symptoms and mechanism of transmission of the virus. Bipan spoke of the precautions that he took and said, \"I wasn't leaving my room much. Eating, cooking, we did everything at home, traveling out (jatayat), to the market, nowhere…\".",
            "cite_spans": [],
            "ref_spans": [],
            "section": "Results"
        },
        {
            "text": "Participants also expressed empathy for those who had been diagnosed with the virus and were suffering or had lost their lives because of it. They said that it was not just the person who is diagnosed who suffers, but also their families and other loved ones. Most participants said that they wouldn't discriminate against someone who has tested positive and would try to help however they can, despite the fact that they themselves are in a dire situation financially. Bipan expressed this and said that \"I get sad, that… that there is so much suffering in people, that is a really unhappy subject.\" They also highlighted the emotionally supportive role played by the village community in this regard. Rehman shared that \"We villagers console people during sickness and death-sickness of any kind...and even if they cannot help, they'd go and visit their place and sit and talk with them (keep them company).\"",
            "cite_spans": [],
            "ref_spans": [],
            "section": "Results"
        },
        {
            "text": "The Fear of the Pandemic Participants were afraid of what would happen if they contracted the virus, especially considering the number of cases being reported in Mumbai and its population density. Nilesh who was living with his family in Mumbai at the time shared his experience of lockdown and the sense of isolation that it brought and said that Around me, no one had corona. But there was a lot of fear. How will people live without fear in such a situation? Children were inside the house because of fear, they did not go out at all. They didn't play at all. My wife also did not leave the house. Everyone just remained in their house with doors closed, so even talking did not happen the way it did earlier. (Nilesh) One of the participants expressed that he chose to come back from Mumbai because he feared that if he died in the city because of the virus his family would not get to see him one last time. Death was not a far-fetched idea anymore-it was right around the corner and all he wanted was his family to be around so that he would be \"seen and mourned\". Salim shared that I felt scared. I worried what if I don't get the chance to go back home, if I contract the disease by any chance and if I die over here, they won't send the body home, they will bury me here. Maybe my parents will receive a message or maybe a letter. These kinds of thoughts used to come to my mind, I couldn't sleep at night. (Salim) Participants said that they felt much safer in their villages where they said no cases had been reported at the time when they were interviewed. But they mentioned that when they came back to the village, initially they had fears about quarantine and isolation in case they tested positive. Alam, a 28year-old tailor, shared \"That is something that the police would tell us. That you cannot go near anyone. You cannot get out of the house. They would seal the area of the village. We would not be able to get out.\"",
            "cite_spans": [
                {
                    "start": 713,
                    "end": 721,
                    "text": "(Nilesh)",
                    "ref_id": null
                }
            ],
            "ref_spans": [],
            "section": "Results"
        },
        {
            "text": "Making Meaning of a Pandemic -Answering the 'why' Question Most participants attributed the pandemic to God/ nature's will. Some participants spoke about how this was punishment from nature/God/fate for the way humans treat each other. Rehman mentioned that, \"I'd say that humans are responsible. Humans have committed so many sins... Maybe someone is greedy, that I am getting rich, and I should get richer. Maybe they are doing bad things.\"",
            "cite_spans": [],
            "ref_spans": [],
            "section": "Results"
        },
        {
            "text": "The divine attribution was also used to explain what kept them protected from the virus and safe so far. Alam shared that, \"We did not get infected, all because of God.\" Yet another way of acknowledging the role of the divine power was through acceptance. Nausheed espoused this idea saying \"The biggest thing is-if God decides to let someone have this illness-if someone gets infected, then they would have to accept it in their stride.\" Thus, belief in the power of God played an important role in the participants' meaning making process of the pandemic.",
            "cite_spans": [],
            "ref_spans": [],
            "section": "Results"
        },
        {
            "text": "Multiple Losses, Overwhelming Challenges After losing their jobs due to the lockdown and coming back to their villages, most participants mentioned that they had not been able to find any work. They were surviving by borrowing money from multiple sources. Some participants did not have enough money to eat and the pressure to survive and make it through was the biggest concern on their mind. Shamil shared that I am feeling very upset, I have no idea what is going to happen in the future, I have no idea what to do. We are middle-class people, not hi-fi (sic) or affluent, we are simple daily wage workers. Our work has halted… (Shamil)",
            "cite_spans": [],
            "ref_spans": [],
            "section": "Results"
        },
        {
            "text": "As part of a brief psychosocial assessment, participants were asked general questions about their sleep, appetite and also how their mood had been. Rehman said, \"No, there is no pain (koshto) about that. When you are hungry, things like these do not matter at all. Try starving, and you will know (Naa kheye dekhben)\". When they did not have any money, they would just get by with what they have, often skipping meals or just eating rice with salt. This led to feelings of uncertainty and helplessness as highlighted by Alam, who said that \"There was uncertainty and complications regarding everythingfood, finances, we could not even get out of the house.\" Some participants also spoke of how losing their job left them questioning their self-worth. Shahin is a 19-year-old factory manager who used to support his entire family by working in Mumbai. He mentioned that since being back, he has not been able to find another job and has to now depend on his father, something that makes him feel \"very irritated.\" The shift from being the main breadwinner of the family to now being a dependent overnight has far-reaching consequences on people's view of themselves and their sense of independence and agency.",
            "cite_spans": [],
            "ref_spans": [],
            "section": "Results"
        },
        {
            "text": "The stress of unemployment and financial hardships also impacted participants' relationships with members of their family, especially partners. Alam spoke of how his wife and he would end up fighting because he was not working and said that,",
            "cite_spans": [],
            "ref_spans": [],
            "section": "Impact on Relationships and Family"
        },
        {
            "text": "We have a child, at times, my wife and I are quarrelling...What could I possibly be doing? She is asking me to go to work here, or go to work there. They have to employ me first, only then I could go work for them, right? So, I am just sitting around and loitering around, there is nothing else to do. (Alam)",
            "cite_spans": [],
            "ref_spans": [],
            "section": "Impact on Relationships and Family"
        },
        {
            "text": "Participants also mentioned their worries about their children and their education. With schools being closed indefinitely, parents faced many worries about their children's future, especially when they lacked the finances and resources to ensure their continued learning. Nilesh shared that Now you are asking about family…my children's studies are also stuck. There is so much loss that is happening academically speaking. Because we were poor, we went out and tried to get an education for our children and all of that seems like it has gone to waste. I am very concerned about my children's schooling and studies.",
            "cite_spans": [],
            "ref_spans": [],
            "section": "Impact on Relationships and Family"
        },
        {
            "text": "An entire year has gone. So, there has to be some thought that the government has to do to deal with this loss, the children of all these poor people will be left without school. (Nilesh)",
            "cite_spans": [],
            "ref_spans": [],
            "section": "Impact on Relationships and Family"
        },
        {
            "text": "The disruption to the education system, especially for those without access to devices and internet connectivity highlights another space wherein access seemed to be determined by social location. Education in developing countries is often seen as a means for upward social mobility and Nilesh's worries about an entire lost year of studying reinforces these concerns for the future.",
            "cite_spans": [],
            "ref_spans": [],
            "section": "Impact on Relationships and Family"
        },
        {
            "text": "Economic Impact: Pushed Further to the Edges The economic burden of the pandemic impacted the migrant workers at multiple levels, which often went unnoticed. Participants experienced a sense of helplessness and worry about their unique circumstances. Nausheed shared his experience and said I have to keep on trying. Because we are poor people, we need to keep trying.... I mean-the rich people do not have to worry. They might have money set aside that they can put to use... We do not have luxuries like that, so we have to do this. If we do not work hard for a day, we would not be able to make ends meet. (Nausheed) While discussing the rise of prices of essential commodities during the first phase of lockdown, Alam shared that \"Government cannot see who is able to buy them, and who is not, right? They would do laathi (baton) charge in Dharavi….\" Thus, institutional control to bring 'order' and ensure social distancing may inadvertently overlook the very real distress of marginalised groups, thereby worsening the impact of Covid-19 on them.",
            "cite_spans": [],
            "ref_spans": [],
            "section": "Impact on Relationships and Family"
        },
        {
            "text": "These young men who had returned home faced multiple pressures wherein they had no way to support their families and had to deal with the personal and social consequences of unemployment. This was worsened by cyclone Amphan that hit West Bengal in May 2020 (most participants were from West Bengal) and damaged all the crops that were to be harvested, thus reducing any possibility of agrarian income in helping them tide over their financial distress. They were keenly aware that they were poor with nothing to fall back on, unlike the rich. They felt that the lockdown and associated difficulties hit the poor the hardest, while the rich could get by without facing any hardship. This dimension of poverty was brought out by a few participants saying I can only think of one thing-troubles for the poor. It is nothing for the rich people. The poor people who are slaving night and day (khete morcche). The people who slave every day to eat… It is trouble for them. Now, these people had to walk home, get run over by buses, run over by trains. We hear this all the time when we listen to the news…. Did rich people die? It was the poor people that died. This is trouble for the poor people….",
            "cite_spans": [],
            "ref_spans": [],
            "section": "Impact on Relationships and Family"
        },
        {
            "text": "What Rehman is highlighting also needs to be understood through a macro lens while recognizing that the pandemic influences different groups differently. The fact that he is poor and not a person in power is critical in understanding his experience of the pandemic and its consequences. Not all of us have equal chances in making it to the 'other side', and that hope for a better future often rests on present realities.",
            "cite_spans": [],
            "ref_spans": [],
            "section": "Impact on Relationships and Family"
        },
        {
            "text": "The crisis generated by Covid-19 and the subsequent lockdown has had a far-reaching impact on the migrant community working in India's urban centers. The present study was a qualitative phenomenological inquiry into the lived experiences of thirteen men migrant workers who had to move back home overnight due to the shutting down of most workplaces in Mumbai, Maharashtra after the announcement of the lockdown. In terms of understanding the nature of the pandemic and keeping themselves safe, participants mentioned taking adequate preventive practices to protect themselves by wearing masks, maintaining social distancing and abiding by lockdown guidelines. In making sense of why the pandemic happened, some participants attributed it to a divine cause, seeing it as a punishment for human actions. Ferrari (2015) in his analysis of Bengali folklore highlighted that illness is often seen as a divine punishment due to past misdeeds, thus providing an insight into the interface of cultural constructions of illness with individual experiences. Some participants relied on God to protect them from the virus and espoused acceptance of God's will in determining whether they caught the virus or not.",
            "cite_spans": [
                {
                    "start": 803,
                    "end": 817,
                    "text": "Ferrari (2015)",
                    "ref_id": "BIBREF12"
                }
            ],
            "ref_spans": [],
            "section": "Discussion"
        },
        {
            "text": "In sharing the impact of the lockdown, the participants emphasized how they lived from one day to another, few of them mortgaging their meager belongings to get back home. The decision to go back home was driven by a combination of factors such as losing their jobs and feeling safer in their villages since no cases had been reported there at that point, The fear of having to dying alone away from home was also a factor in this decision. For the participants of our study, the journey from Mumbai to their homes was not an easy one. They had to deal with many logistical and financial difficulties from arranging transport to dealing with news of other people dying on the way home. Participants highlighted several psychosocial difficulties that they were facing due to the pandemic. From being the sole earners supporting entire families back home they became jobless overnight, with little clarity or direction on what would come next. Simultaneously, migrant workers had to deal with many uncertainties that often extended beyond their immediate concerns. They were not just worried about their own survival but also about their families and children, especially childrens' education. A recent report by United Nations Educational, Scientific and Cultural Organization [UNESCO] , United Nations Children's Fund [UNICEF] and World Bank has estimated that nearly 1.5 billion children have been affected by school closures globally, which is likely to lead to a learning loss especially for children belonging to low-income countries (UNESCO, UNICEF, & World Bank, 2020) . Thus, concerns about employment, money, poverty, hunger and childrens' education became huge psychosocial stressors that they had to negotiate on a daily basis.",
            "cite_spans": [
                {
                    "start": 1276,
                    "end": 1284,
                    "text": "[UNESCO]",
                    "ref_id": null
                },
                {
                    "start": 1318,
                    "end": 1326,
                    "text": "[UNICEF]",
                    "ref_id": null
                },
                {
                    "start": 1538,
                    "end": 1574,
                    "text": "(UNESCO, UNICEF, & World Bank, 2020)",
                    "ref_id": null
                }
            ],
            "ref_spans": [],
            "section": "Discussion"
        },
        {
            "text": "These stressors deeply impacted the participants. Participants reported that they were afraid of dying alone in the city without their families around so they decided to go back home. At the same time the stress of being back home without any way of financially supporting themselves and their families generated great amounts of uncertainty and helplessness in the participants. They experienced feelings of guilt and frustration at not being able to find a job and worried constantly about the future. Participants reported experiencing worries about the future, helplessness and a fear that the world and 'normal life' was about to change indefinitely. Their sense of personal agency and certainty was taken away almost overnight which generated distress in them. Kumar et al. (2020) studied the psychological impact of Covid-19 with 98 migrant workers in India and found that nearly 75% of the migrants screened positive for depression and nearly half of the sample screened positive for both depression and anxiety. They attributed the high levels of depression in the migrant groups to financial insecurity, worries about their own health as well of loved ones and concerns around being alone and not being able to support their families. The distress experienced by migrant workers has been understood through multiple lenses-diagnostically as depression and anxiety, psychosocially as an interface of contextual factors and individual subjectivities, and within larger structures of governance, poverty, class, socio-economic status and so on. Yet at the same time, there needs to be a keen awareness that this experience cannot be located within the individual alone. Further, the distress and challenges experienced by participants also had an adverse impact on their families and their relationships with significant others. Lamba (2020) has argued that the pandemic may have an intergenerational impact as individuals and families experience multiple losses that are often ambiguous and are left to grapple with difficult and often unanswerable questions about what comes next.",
            "cite_spans": [
                {
                    "start": 767,
                    "end": 786,
                    "text": "Kumar et al. (2020)",
                    "ref_id": "BIBREF16"
                },
                {
                    "start": 1836,
                    "end": 1848,
                    "text": "Lamba (2020)",
                    "ref_id": "BIBREF18"
                }
            ],
            "ref_spans": [],
            "section": "Discussion"
        },
        {
            "text": "Thus the understanding of the multi-layered nature of the distress experienced by migrant workers calls for a trauma informed lens towards mental health care. Clervil et al. (2013) have argued for trauma informed care for displaced populations and highlighted the sense of helplessness and lack of control that displaced groups experience in the aftermath of a traumatic event (in this case the pandemic and the lockdown). Hopper et al. (2010) have defined trauma-informed care as \"a strengths based framework that is grounded in an understanding of and responsiveness to the impact of trauma, that emphasizes physical, psychological, and emotional safety for both providers and survivors, and that creates opportunities for survivors to rebuild a sense of control and empowerment\" (p.82). Some of the important principles of trauma informed care include promoting safety, supporting choice, autonomy and control, sharing governance and power, integrative and culturally sensitive care and ultimately instilling hope about recovery (Hopper et al., 2010) . These need to be the guiding light of mental health interventions and policy formulation. Further, Endale et al. (2020) have highlighted that support services to displaced groups during the pandemic need to provide psychological first aid, which includes providing information and reassurance about the pandemic as well as about resources to meet their immediate needs, proactive outreach to mitigate the impact of isolation, extensive case management to provide different kinds of support services and telemedicine and online communication for individual and family mental health. The Ministry of Health and Family Welfare, Government of India has called for social protection for migrant workers to help them deal with the social, emotional and psychological trauma that they have gone through especially during lockdown (Press Trust of India, 2020). We must also question how mental health work needs to be conceptualised and implemented with groups that are facing such acute psychosocial distress-wherein individual realities are deeply embedded in intersectional realities. Is it possible for mental health workers to focus on healing and recovery while also acknowledging and integrating the systemic influences and if so what would be the nature of that work. Psychosocial support during crises and disasters needs to look at liaising with other relief organisations and agencies providing care and relief. Mental health work in this context then, needs to be embedded with developmental and relief programmes and cannot simply exist as an isolated intervention. For instance, provision of basic relief materials can be combined with psychological first-aid and at each step we must recognise the need for responsive, empathic and socially just interventions and support. Further, it is equally important to give due attention to training of professionals and frontline workers. In resource-stressed countries like India, mental health work with migrant workers needs frontline workers and staff who receive adequate training and supervision in trauma informed care, environments which are safe and respect the privacy and confidentiality of individuals, and culturally sensitive assessment and goal planning (Clervil et al., 2013) .",
            "cite_spans": [
                {
                    "start": 159,
                    "end": 180,
                    "text": "Clervil et al. (2013)",
                    "ref_id": "BIBREF8"
                },
                {
                    "start": 423,
                    "end": 443,
                    "text": "Hopper et al. (2010)",
                    "ref_id": "BIBREF13"
                },
                {
                    "start": 1032,
                    "end": 1053,
                    "text": "(Hopper et al., 2010)",
                    "ref_id": "BIBREF13"
                },
                {
                    "start": 1155,
                    "end": 1175,
                    "text": "Endale et al. (2020)",
                    "ref_id": null
                },
                {
                    "start": 3273,
                    "end": 3295,
                    "text": "(Clervil et al., 2013)",
                    "ref_id": "BIBREF8"
                }
            ],
            "ref_spans": [],
            "section": "Discussion"
        },
        {
            "text": "Further, the intersection of class, migration status, gender and religion may generate unique challenges and mental health practitioners may need to be cognizant of these interlocking systems in understanding and working with individuals and groups. For instance, participants highlighted how the disturbance in gender roles because of unemployment impacted their relationships. In this context some of the questions that need to be looked at include what role does gender play in the experience of the lockdown, especially since most migrant workers were the sole male breadwinners of their families? How does unemployment and masculinity interface in the context of the pandemic? Does the pressure of being 'the man of the house' add pressures on men? Are certain religious and cultural groups further marginalised?",
            "cite_spans": [],
            "ref_spans": [],
            "section": "Discussion"
        },
        {
            "text": "Governmental policies and programmes also need to be responsive to the needs of migrant workers. This was also highlighted by several participants in the study who compared themselves to 'rich people' and shared that they faced immense difficulties because they were poor. The only thing that they were focused on presently was survival. Other researchers have also highlighted the need for decisive and proactive governmental intervention. Espinel et al. (2020) explored the experiences of Venezuelan migrants in Colombia during Covid-19 and emphasized that migrants need to be prioritised in the public health care system, especially because of their vulnerability to a wide range of mental health concerns due to the hardships that they face in the process of migration.",
            "cite_spans": [
                {
                    "start": 441,
                    "end": 462,
                    "text": "Espinel et al. (2020)",
                    "ref_id": "BIBREF11"
                }
            ],
            "ref_spans": [],
            "section": "Discussion"
        },
        {
            "text": "Finally, migrants form such a critical part of the economy of flourishing cities-yet remain unseen and unheard in the midst of one of the biggest crises that the world has seen. Mumbai, being the commercial capital of the country has often been considered as \"karmabhoomi\". 1 The city acts as a symbol of opportunity, hope and possibilities for thousands of people who move here every year in search of a better life. Due to the Covid-19 pandemic and subsequent lockdown, migrant workers became 'the nowhere people'. Their lives were transformed almost overnight and they found themselves displaced; belonging to 'nowhere' geographically, as their places of work shut down indefinitely and going back home became an overwhelming challenge with lockdown restrictions. This dislocation was not just geographical, they were forced to abandon their hopes and dreams of a better life which left them feeling lost and helpless. Their socio-economic vulnerability along with structural inequalities meant that they don't really belong anywhere-not to the states where they migrated to nor to the states where their families reside. And so perhaps migrants form a separate group altogether-'the nowhere people' who have been left to fend for themselves in a turbulent time. Bansal (2020) in her paper on Covid-19 and its implications for a \"post-coronial psychology\" has argued that migrants were either seen as objects of pity or as carriers of infection to the rural hinterland in mainstream discourse-and that there was an urgent need to view them with dignity and respect, and perhaps more importantly not just as \"them\" but as \"us\". Bansal (2020) calls for a critical-cultural reflection of local and global frameworks and an imagination of the \"new normal\" which is cognisant of the structural inequities of society and is equally responsive to it. Thus our understanding of migrant workers as a group also needs deep reflection and enquiry.",
            "cite_spans": [
                {
                    "start": 1266,
                    "end": 1279,
                    "text": "Bansal (2020)",
                    "ref_id": "BIBREF0"
                }
            ],
            "ref_spans": [],
            "section": "Discussion"
        },
        {
            "text": "This research aimed to understand the experiences of migrant workers working in Mumbai, India during the Covid-19 pandemic. The research used an intersectional frame to understand how different social identities of migrant status, gender and class coalesce together to generate unique forms of marginalization. It calls for future policy and practice work to acknowledge and integrate the lived experiences of those who remain on the edges, invisible yet critical backbones of a well-functioning and harmonious society. Finally, it emphasises that the pandemic is just a mirror being held up to all of us-and the 'reflections' and 'lessons' need to be carried forward, remembered, documented and transformed into action that is meaningful to the lives of people.",
            "cite_spans": [],
            "ref_spans": [],
            "section": "Conclusion"
        }
    ],
    "bib_entries": {
        "BIBREF0": {
            "ref_id": "b0",
            "title": "Big and small stories from India in the COVID19 plot: Directions for a 'post coronial' psychology",
            "authors": [
                {
                    "first": "P",
                    "middle": [],
                    "last": "Bansal",
                    "suffix": ""
                }
            ],
            "year": 2020,
            "venue": "Integr. Psych. Behav",
            "volume": "55",
            "issn": "",
            "pages": "47--72",
            "other_ids": {
                "DOI": [
                    "10.1007/s12124-020-09585-6"
                ]
            }
        },
        "BIBREF1": {
            "ref_id": "b1",
            "title": "The migrant workers are the builders of modern India. Time to take care of them. The Indian Express",
            "authors": [
                {
                    "first": "H",
                    "middle": [],
                    "last": "Bijoor",
                    "suffix": ""
                }
            ],
            "year": 2020,
            "venue": "",
            "volume": "",
            "issn": "",
            "pages": "",
            "other_ids": {}
        },
        "BIBREF2": {
            "ref_id": "b2",
            "title": "We're not all in this together: On COVID-19, intersectionality, and structural inequality",
            "authors": [
                {
                    "first": "L",
                    "middle": [],
                    "last": "Bowleg",
                    "suffix": ""
                }
            ],
            "year": 2020,
            "venue": "American Journal of Public Health",
            "volume": "110",
            "issn": "7",
            "pages": "",
            "other_ids": {
                "DOI": [
                    "10.2105/AJPH.2020.305766"
                ]
            }
        },
        "BIBREF3": {
            "ref_id": "b3",
            "title": "Conducting qualitative interviews with women survivors of trauma",
            "authors": [
                {
                    "first": "S",
                    "middle": [],
                    "last": "Brzuzy",
                    "suffix": ""
                },
                {
                    "first": "A",
                    "middle": [],
                    "last": "Ault",
                    "suffix": ""
                },
                {
                    "first": "E",
                    "middle": [
                        "A"
                    ],
                    "last": "Segal",
                    "suffix": ""
                }
            ],
            "year": 1997,
            "venue": "Affilia",
            "volume": "12",
            "issn": "1",
            "pages": "76--83",
            "other_ids": {}
        },
        "BIBREF4": {
            "ref_id": "b4",
            "title": "The concept of intersectionality in feminist theory",
            "authors": [
                {
                    "first": "A",
                    "middle": [],
                    "last": "Carastathis",
                    "suffix": ""
                }
            ],
            "year": 2014,
            "venue": "Philosophy Compass",
            "volume": "9",
            "issn": "5",
            "pages": "304--314",
            "other_ids": {}
        },
        "BIBREF5": {
            "ref_id": "b5",
            "title": "Reflecting on experiences of social distancing",
            "authors": [
                {
                    "first": "H",
                    "middle": [],
                    "last": "Carel",
                    "suffix": ""
                },
                {
                    "first": "M",
                    "middle": [],
                    "last": "Ratcliffe",
                    "suffix": ""
                },
                {
                    "first": "T",
                    "middle": [],
                    "last": "Froese",
                    "suffix": ""
                }
            ],
            "year": 2020,
            "venue": "",
            "volume": "",
            "issn": "",
            "pages": "",
            "other_ids": {}
        },
        "BIBREF6": {
            "ref_id": "b6",
            "title": "Addressing the mental health concerns of migrant workers during the COVID-19 pandemic: An experiential account",
            "authors": [
                {
                    "first": "R",
                    "middle": [],
                    "last": "Chander",
                    "suffix": ""
                },
                {
                    "first": "M",
                    "middle": [],
                    "last": "Murugesan",
                    "suffix": ""
                },
                {
                    "first": "D",
                    "middle": [],
                    "last": "Ritish",
                    "suffix": ""
                },
                {
                    "first": "D",
                    "middle": [],
                    "last": "Damodharan",
                    "suffix": ""
                },
                {
                    "first": "V",
                    "middle": [],
                    "last": "Arunachalam",
                    "suffix": ""
                },
                {
                    "first": "R",
                    "middle": [],
                    "last": "Parthasarathy",
                    "suffix": ""
                }
            ],
            "year": 2020,
            "venue": "International Journal of Social Psychiatry",
            "volume": "",
            "issn": "",
            "pages": "",
            "other_ids": {
                "DOI": [
                    "10.1177/0020764020937736"
                ]
            }
        },
        "BIBREF7": {
            "ref_id": "b7",
            "title": "COVID 19 pandemic: Mental health challenges of internal migrant workers of India",
            "authors": [
                {
                    "first": "R",
                    "middle": [],
                    "last": "Choudhari",
                    "suffix": ""
                }
            ],
            "year": 2020,
            "venue": "Asian Journal of Psychiatry",
            "volume": "54",
            "issn": "",
            "pages": "",
            "other_ids": {}
        },
        "BIBREF8": {
            "ref_id": "b8",
            "title": "Trauma-informed care for displaced populations: A guide for community-based service providers",
            "authors": [
                {
                    "first": "R",
                    "middle": [],
                    "last": "Clervil",
                    "suffix": ""
                },
                {
                    "first": "K",
                    "middle": [],
                    "last": "Guarino",
                    "suffix": ""
                },
                {
                    "first": "C",
                    "middle": [
                        "J"
                    ],
                    "last": "Decandia",
                    "suffix": ""
                },
                {
                    "first": "C",
                    "middle": [
                        "A"
                    ],
                    "last": "Beach",
                    "suffix": ""
                }
            ],
            "year": 2013,
            "venue": "The National Center on Family Homelessness",
            "volume": "",
            "issn": "",
            "pages": "",
            "other_ids": {}
        },
        "BIBREF9": {
            "ref_id": "b9",
            "title": "Mapping the margins: Intersectionality, identity politics, and violence against women of color",
            "authors": [
                {
                    "first": "K",
                    "middle": [],
                    "last": "Crenshaw",
                    "suffix": ""
                }
            ],
            "year": 2020,
            "venue": "Stan. L. Rev",
            "volume": "43",
            "issn": "",
            "pages": "",
            "other_ids": {}
        },
        "BIBREF10": {
            "ref_id": "b10",
            "title": "The qualitative research interview",
            "authors": [
                {
                    "first": "Dicicco",
                    "middle": [],
                    "last": "Bloom",
                    "suffix": ""
                },
                {
                    "first": "B",
                    "middle": [],
                    "last": "Crabtree",
                    "suffix": ""
                },
                {
                    "first": "B",
                    "middle": [
                        "F"
                    ],
                    "last": "",
                    "suffix": ""
                }
            ],
            "year": 2006,
            "venue": "Medical Education",
            "volume": "40",
            "issn": "4",
            "pages": "314--321",
            "other_ids": {}
        },
        "BIBREF11": {
            "ref_id": "b11",
            "title": "Venezuelan migrants in Colombia: COVID-19 and mental health",
            "authors": [
                {
                    "first": "Z",
                    "middle": [],
                    "last": "Espinel",
                    "suffix": ""
                },
                {
                    "first": "R",
                    "middle": [],
                    "last": "Chaskel",
                    "suffix": ""
                },
                {
                    "first": "R",
                    "middle": [
                        "C"
                    ],
                    "last": "Berg",
                    "suffix": ""
                },
                {
                    "first": "H",
                    "middle": [
                        "J"
                    ],
                    "last": "Florez",
                    "suffix": ""
                },
                {
                    "first": "S",
                    "middle": [
                        "L"
                    ],
                    "last": "Gaviria",
                    "suffix": ""
                },
                {
                    "first": "O",
                    "middle": [],
                    "last": "Bernal",
                    "suffix": ""
                },
                {
                    "first": "K",
                    "middle": [],
                    "last": "Berg",
                    "suffix": ""
                },
                {
                    "first": "C",
                    "middle": [],
                    "last": "Muñoz",
                    "suffix": ""
                },
                {
                    "first": "M",
                    "middle": [
                        "G"
                    ],
                    "last": "Larkin",
                    "suffix": ""
                },
                {
                    "first": "J",
                    "middle": [
                        "M"
                    ],
                    "last": "Shultz",
                    "suffix": ""
                }
            ],
            "year": 2020,
            "venue": "The Lancet Psychiatry",
            "volume": "7",
            "issn": "8",
            "pages": "653--655",
            "other_ids": {}
        },
        "BIBREF12": {
            "ref_id": "b12",
            "title": "Illness Is Nothing But Injustice: The Revolutionary Element in Bengali Folk Healing",
            "authors": [
                {
                    "first": "F",
                    "middle": [
                        "M"
                    ],
                    "last": "Ferrari",
                    "suffix": ""
                }
            ],
            "year": 2015,
            "venue": "The Journal of American Folklore",
            "volume": "128",
            "issn": "507",
            "pages": "46--64",
            "other_ids": {}
        },
        "BIBREF13": {
            "ref_id": "b13",
            "title": "Shelter from the storm: Trauma-informed Care in Homelessness Services Settings Endale",
            "authors": [
                {
                    "first": "E",
                    "middle": [
                        "K"
                    ],
                    "last": "Hopper",
                    "suffix": ""
                },
                {
                    "first": "E",
                    "middle": [
                        "L"
                    ],
                    "last": "Bassuk",
                    "suffix": ""
                },
                {
                    "first": "J",
                    "middle": [
                        "; T"
                    ],
                    "last": "Olivet",
                    "suffix": ""
                },
                {
                    "first": "N",
                    "middle": [],
                    "last": "St Jean",
                    "suffix": ""
                },
                {
                    "first": "D",
                    "middle": [],
                    "last": "Birman",
                    "suffix": ""
                }
            ],
            "year": 2010,
            "venue": "",
            "volume": "",
            "issn": "",
            "pages": "",
            "other_ids": {}
        },
        "BIBREF14": {
            "ref_id": "b14",
            "title": "10. Migration in India and the impact of the lockdown on migrants",
            "authors": [
                {
                    "first": "M",
                    "middle": [],
                    "last": "Iyer",
                    "suffix": ""
                }
            ],
            "year": 2020,
            "venue": "",
            "volume": "",
            "issn": "",
            "pages": "",
            "other_ids": {}
        },
        "BIBREF15": {
            "ref_id": "b15",
            "title": "The qualitative research interview: Participants' responsive participation in knowledge making",
            "authors": [
                {
                    "first": "M",
                    "middle": [],
                    "last": "Knapik",
                    "suffix": ""
                }
            ],
            "year": 2006,
            "venue": "International Journal of Qualitative Methods",
            "volume": "5",
            "issn": "3",
            "pages": "77--93",
            "other_ids": {}
        },
        "BIBREF16": {
            "ref_id": "b16",
            "title": "The psychological impact of COVID-19 pandemic and lockdown on the migrant workers: A cross-sectional survey",
            "authors": [
                {
                    "first": "K",
                    "middle": [],
                    "last": "Kumar",
                    "suffix": ""
                },
                {
                    "first": "A",
                    "middle": [],
                    "last": "Mehra",
                    "suffix": ""
                },
                {
                    "first": "S",
                    "middle": [],
                    "last": "Sahoo",
                    "suffix": ""
                },
                {
                    "first": "R",
                    "middle": [],
                    "last": "Nehra",
                    "suffix": ""
                },
                {
                    "first": "S",
                    "middle": [],
                    "last": "Grover",
                    "suffix": ""
                }
            ],
            "year": 2020,
            "venue": "Asian Journal of Psychiatry",
            "volume": "53",
            "issn": "",
            "pages": "",
            "other_ids": {}
        },
        "BIBREF17": {
            "ref_id": "b17",
            "title": "Migration, employment status and poverty: An analysis across urban centres",
            "authors": [
                {
                    "first": "A",
                    "middle": [],
                    "last": "Kundu",
                    "suffix": ""
                },
                {
                    "first": "N",
                    "middle": [],
                    "last": "Sarangi",
                    "suffix": ""
                }
            ],
            "year": 2007,
            "venue": "html#:~:text= This%20paper%20analyses%20the%20pattern",
            "volume": "",
            "issn": "",
            "pages": "299--306",
            "other_ids": {}
        },
        "BIBREF18": {
            "ref_id": "b18",
            "title": "Does the coronavirus pandemic carry signs of a generational trauma? Scroll",
            "authors": [
                {
                    "first": "N",
                    "middle": [],
                    "last": "Lamba",
                    "suffix": ""
                }
            ],
            "year": 2020,
            "venue": "",
            "volume": "",
            "issn": "",
            "pages": "",
            "other_ids": {}
        },
        "BIBREF19": {
            "ref_id": "b19",
            "title": "The coronavirus is a disaster for feminism",
            "authors": [
                {
                    "first": "H",
                    "middle": [],
                    "last": "Lewis",
                    "suffix": ""
                }
            ],
            "year": 2020,
            "venue": "The Atlantic",
            "volume": "19",
            "issn": "03",
            "pages": "",
            "other_ids": {}
        },
        "BIBREF20": {
            "ref_id": "b20",
            "title": "67 lakh migrants return to 116 dists in 6 states. The Indian Express",
            "authors": [
                {
                    "first": "L",
                    "middle": [],
                    "last": "Mathew",
                    "suffix": ""
                }
            ],
            "year": 2020,
            "venue": "",
            "volume": "",
            "issn": "",
            "pages": "",
            "other_ids": {}
        },
        "BIBREF21": {
            "ref_id": "b21",
            "title": "Migrant workers need social protection to overcome trauma in lockdown: Health ministry. India Today",
            "authors": [
                {
                    "first": "C",
                    "middle": [],
                    "last": "Moustakas",
                    "suffix": ""
                }
            ],
            "year": 1994,
            "venue": "",
            "volume": "",
            "issn": "",
            "pages": "",
            "other_ids": {}
        },
        "BIBREF22": {
            "ref_id": "b22",
            "title": "Survey on National Education Responses to COVID-19 School Closures, round 2",
            "authors": [],
            "year": 2020,
            "venue": "",
            "volume": "",
            "issn": "",
            "pages": "",
            "other_ids": {}
        },
        "BIBREF23": {
            "ref_id": "b23",
            "title": "Coronavirus in India: How the COVID-19 could impact the fast-growing economy. Pharmaceutical technology",
            "authors": [
                {
                    "first": "V",
                    "middle": [],
                    "last": "Vara",
                    "suffix": ""
                }
            ],
            "year": 2020,
            "venue": "",
            "volume": "",
            "issn": "",
            "pages": "",
            "other_ids": {}
        },
        "BIBREF24": {
            "ref_id": "b24",
            "title": "Publisher's Note Springer Nature remains neutral with regard to jurisdictional claims in published maps and institutional affiliations",
            "authors": [],
            "year": null,
            "venue": "",
            "volume": "",
            "issn": "",
            "pages": "",
            "other_ids": {}
        }
    },
    "ref_entries": {
        "TABREF0": {
            "text": "",
            "latex": null,
            "type": "table"
        }
    },
    "back_matter": [
        {
            "text": "Acknowledgements We would like to thank all the participants for giving us their valuable time during the time of a crisis.",
            "cite_spans": [],
            "ref_spans": [],
            "section": "acknowledgement"
        },
        {
            "text": "The datasets generated during the study are not publicly available due to participant privacy but are available from corresponding author on reasonable request.Author Contributions All authors have been actively involved in the work and hold themselves jointly and individually responsible for its content.Funding This study was funded by the Research Council, Tata Institute of Social Sciences (TISS).",
            "cite_spans": [],
            "ref_spans": [],
            "section": "Data Availability Statement"
        },
        {
            "text": "Conflict of Interest The authors declare that they have no relevant financial or non-financial interest to disclose.",
            "cite_spans": [],
            "ref_spans": [],
            "section": "Declarations"
        },
        {
            "text": "The institutional review board at Tata Institute of Social Sciences approved all study procedures.Informed Consent Participants provided informed oral consent to participate in the study. All relevant ethical safeguards have been met.",
            "cite_spans": [],
            "ref_spans": [],
            "section": "Ethics Approval"
        }
    ]
}