{
    "paper_id": "0a64ce966a0d70aaea8d280093b2cfdd68b494c0",
    "metadata": {
        "title": "Journal Pre-proof The antiviral activity of iota-, kappa-, and lambda-carrageenan against COVID-19: A critical review The antiviral activity of iota-, kappa-, and lambda- carrageenan against COVID-19: a critical review",
        "authors": [
            {
                "first": "S",
                "middle": [],
                "last": "Si",
                "suffix": "",
                "affiliation": {
                    "laboratory": "Research Division for Natural Product Technology (BPTBA)",
                    "institution": "Indonesian Institute of Sciences (LIPI)",
                    "location": {
                        "addrLine": "Address: Jl. Jogja-Wonosari 31.5",
                        "postCode": "55861, 55861",
                        "settlement": "Wonosari, Wonosari",
                        "region": "D.I. Yogyakarta",
                        "country": "Indonesia., Indonesia"
                    }
                },
                "email": ""
            },
            {
                "first": "Andri",
                "middle": [],
                "last": "Frediansyah",
                "suffix": "",
                "affiliation": {
                    "laboratory": "Research Division for Natural Product Technology (BPTBA)",
                    "institution": "Indonesian Institute of Sciences (LIPI)",
                    "location": {
                        "addrLine": "Address: Jl. Jogja-Wonosari 31.5",
                        "postCode": "55861, 55861",
                        "settlement": "Wonosari, Wonosari",
                        "region": "D.I. Yogyakarta",
                        "country": "Indonesia., Indonesia"
                    }
                },
                "email": "andri.frediansyah@lipi.go.id"
            },
            {
                "first": "S",
                "middle": [
                    "Nat Andri"
                ],
                "last": "Frediansyah",
                "suffix": "",
                "affiliation": {
                    "laboratory": "Research Division for Natural Product Technology (BPTBA)",
                    "institution": "Indonesian Institute of Sciences (LIPI)",
                    "location": {
                        "addrLine": "Address: Jl. Jogja-Wonosari 31.5",
                        "postCode": "55861, 55861",
                        "settlement": "Wonosari, Wonosari",
                        "region": "D.I. Yogyakarta",
                        "country": "Indonesia., Indonesia"
                    }
                },
                "email": ""
            },
            {
                "first": "",
                "middle": [],
                "last": "Si",
                "suffix": "",
                "affiliation": {
                    "laboratory": "Research Division for Natural Product Technology (BPTBA)",
                    "institution": "Indonesian Institute of Sciences (LIPI)",
                    "location": {
                        "addrLine": "Address: Jl. Jogja-Wonosari 31.5",
                        "postCode": "55861, 55861",
                        "settlement": "Wonosari, Wonosari",
                        "region": "D.I. Yogyakarta",
                        "country": "Indonesia., Indonesia"
                    }
                },
                "email": ""
            }
        ]
    },
    "abstract": [
        {
            "text": "1",
            "cite_spans": [],
            "ref_spans": [],
            "section": "Abstract"
        }
    ],
    "body_text": [
        {
            "text": "products, cosmetics, and food preparations due to its emulsifying, stabilizing, thickening, and gelling properties [39] [40] [41] . There are three major subtypes of carrageenan: kappa ( Figure   89 1a), iota (Figure 1b) , and lambda (Figure 1c) , which differ in their location and number of 90 sulphate moieties on the hexose scaffold skeleton and contain one, two, or three negatively 91 charged sulphate ester groups per disaccharide repeating unit, respectively 42 . The US Food ",
            "cite_spans": [
                {
                    "start": 115,
                    "end": 119,
                    "text": "[39]",
                    "ref_id": null
                },
                {
                    "start": 120,
                    "end": 124,
                    "text": "[40]",
                    "ref_id": null
                },
                {
                    "start": 125,
                    "end": 129,
                    "text": "[41]",
                    "ref_id": null
                }
            ],
            "ref_spans": [
                {
                    "start": 187,
                    "end": 198,
                    "text": "Figure   89",
                    "ref_id": null
                },
                {
                    "start": 209,
                    "end": 220,
                    "text": "(Figure 1b)",
                    "ref_id": null
                },
                {
                    "start": 234,
                    "end": 245,
                    "text": "(Figure 1c)",
                    "ref_id": null
                }
            ],
            "section": ""
        },
        {
            "text": "A study published in 1987 found that iota-carrageenan, a sulfated polysaccharide derived 108 from marine red algae, effectively inhibited several viruses in cultured cells, including µg/ml and 0.2 to 1.9 µg/ml, for kappa-and lambda-carrageenan, respectively (as shown in ",
            "cite_spans": [],
            "ref_spans": [],
            "section": "In vitro evidence 107"
        },
        {
            "text": "In vivo evidence 183 In 1993, an in vivo study was carried out using ICR mice (abbreviated from Institute of show a similar trend to two previous studies ( Table 2) . there is no statistically significant difference in total symptom score between the treated and placebo groups 31 . As a result, between the treated and placebo groups, significant 240 differences in clearance disease (p=0.038), lower incidence of secondary infections by 241 other respiratory viruses (p=0.046), and viral load reduction (p=0.026) were observed 31 .",
            "cite_spans": [
                {
                    "start": 17,
                    "end": 20,
                    "text": "183",
                    "ref_id": null
                }
            ],
            "ref_spans": [
                {
                    "start": 156,
                    "end": 164,
                    "text": "Table 2)",
                    "ref_id": "TABREF2"
                }
            ],
            "section": "3.3"
        },
        {
            "text": "Thus, these studies showed that treatment with iota-carrageenan nasal spray is safe and 243 effective for children and adults experiencing early symptoms of the common cold 31 . ",
            "cite_spans": [],
            "ref_spans": [],
            "section": "242"
        }
    ],
    "bib_entries": {
        "BIBREF0": {
            "ref_id": "b0",
            "title": "The current pandemic of COVID-19 poses a serious threat to human civilization",
            "authors": [],
            "year": null,
            "venue": "",
            "volume": "",
            "issn": "",
            "pages": "",
            "other_ids": {}
        },
        "BIBREF1": {
            "ref_id": "b1",
            "title": "Except for corticosteroids, remdesivir has been approved by FDA",
            "authors": [],
            "year": null,
            "venue": "",
            "volume": "",
            "issn": "",
            "pages": "",
            "other_ids": {}
        },
        "BIBREF2": {
            "ref_id": "b2",
            "title": "Iota-, lambda-, and kappa-carrageenan all exhibit antiviral activity in varying degrees",
            "authors": [],
            "year": null,
            "venue": "",
            "volume": "",
            "issn": "",
            "pages": "",
            "other_ids": {}
        },
        "BIBREF3": {
            "ref_id": "b3",
            "title": "The anti-SARS-CoV-2 activities of various carrageenan subtypes was reviewed",
            "authors": [],
            "year": null,
            "venue": "",
            "volume": "",
            "issn": "",
            "pages": "",
            "other_ids": {}
        },
        "BIBREF4": {
            "ref_id": "b4",
            "title": "Clinical trials are warranted to validate the efficacy of iotacarrageenan",
            "authors": [],
            "year": null,
            "venue": "",
            "volume": "",
            "issn": "",
            "pages": "",
            "other_ids": {}
        }
    },
    "ref_entries": {
        "FIGREF0": {
            "text": "Drug Administration (21 CFR 172.620) has generally recognized its polymer as safe for 93 topical application and consumption 43 . Carrageenan, as a biomolecule, possesses a variety 94 of biological properties, including 44, 45 , antioxidant 46 , anti-bacteria 47 , anticoagulant 48-50 , 95 and immunomodulator 51, 52 . Numerous reports indicate that carrageenan is also an 96 antiviral, including against respiratory viruses. 53-55 . 97 ---------------------------------------------Figure 1. --------------------------------------------------------Representation of the stereo-chemically fundamental carrageenan repeating 100 sequence. (a) kappa-carrageenan consisted of 4-O-Sulfato-beta-D-galactopyranosyl unit 101 and 3,6-Anhydro-alpha-D-galactopyranosyl unit, (b) iota-carrageenan consisted 4",
            "latex": null,
            "type": "figure"
        },
        "FIGREF1": {
            "text": "Spike pseudotyped lentivirus (SSPL) at MOI of 0.1 in a dose-dependent manner with 161 IC50 of 2.58 μg/ml 75 . Additionally, Prieschl-Grassauer and her colleague compared the 162 effectiveness of iota-, kappa-, and lambda using SSPL at 10 and 100 μg/ml. Thus, they found 163 that iota-form effectively inhibited the virus at 10 μg/ml while kappa-and lambda-form 164 were only active at 100 μg/ml 75 . To get more deep-insight, SARS-CoV-2 isolated from a 61-165year-old patient and was amplified in Vero B4 cells and its inhibitory activities were 166 conducted using iota-carrageenan. The IC50 ranged from 0.046 to 1.54 g/ml 75 . The activity 167 of iota-form against SARS-CoV-2 was also studied using Vero E6 and showed less inhibition 168 compared with Vero B4 76, 77 . A study using two commercial pharmaceutical products,169 namely viruseptin nasal contained 1.2 mg/ml iota-and 0.4 mg/ml kappa-carrageenan (A) 170 and viruseptin oral contained 1.2 mg/ml iota-form (B), showed inhibitory activity against 171 SARS-CoV-2 at IC50 of 20 and 37μg/ml, respectively 78 . Without additives, in the pure form 172 of carrageenan, A and B inhibited SARS-CoV-2 at IC50 of 21 and 33 μg/ml, respectively 78 . 173 Thus, the result is quite similar between products with additives and in pure form. Another 174 research group investigated the inhibitory effect of iota-carrageenan on SARS-CoV-2 in 175 Vero E6 and discovered a similar trend: at 600, 60, and 6 g/ml, with a xylitol concentration 176 of 50 mg/ml, can indeed reduce over 4.25 log10 copies/ml viruses compared to control 79 .177 178 ---------------------------------------------Figure 2. ----------------------------------------------------------Carrageenan may be used to specifically target the viral attachment of SARS-CoV-2.",
            "latex": null,
            "type": "figure"
        },
        "FIGREF2": {
            "text": "Research mice) that had been infected with cytomegalovirus and treated 185 intraperitoneally with various doses of iota-carrageenan 80 . Iota-carrageenan at 0.5 mg 186 confers a greater protective effect on mice infected with murine cytomegalovirus via a 187 host-mediated mechanism 80 . In 1999, an in vivo study was conducted using HSV-2-infected 188 female Swiss Webster mice with a single dose (10 mg/ml) of lambda-and iota-carrageenan 189 81 . Post-exposure revealed that lambda-carrageenan provides significant protection (p < 190 0.05) against disease caused by intravaginal HSV-2 challenge 81 . However, that is not the 191 case for the iota-form 81 . Therefore, a single dose of kappa-carrageenan protected 9 of 10 192 BALB/c mice infected with HSV-2 intravaginally 82 . Another study showed that iota-193 carrageenan provides significant protection to BALB/cAnNCr mice-challenged HPV16 194 pseudovirus by either mechanical-or chemical disruption 83 . 195 196 In previous in vitro studies, all carrageenan subtypes showed antiviral activity against 197 influenza virus (Table 1). Thus, several researchers investigated combined therapy of 198 carrageenan with available influenza drugs on the market, including prodrug oseltamivir 199 and zanamivir, an active drug. A study using the combination of iota-carrageenan with 200 oseltamivir led to significantly enhanced survival of mice-infected H1N1 in comparison 201 with the respective mono-therapies 70 . The combination of kappa-and iota-carrageenan for 202 the treatment of lethally H7N7 infected C57Bl/6 mice showed better therapeutic effect (p < 203 0.0004) compared to the use of iota-form alone (p < 0.1507) 71 . Moreover, the combination 204 of kappa and iota-carrageenan with 3 mg/kg BW/day zanamivir used for treatment of 205 H7N7 infected C57Bl/6 mice revealed synergistically elevated survival of mice in 206 comparison of both mono-therapies 71 . However, no reports on the in vivo study using 207 kappa-, iota-, or lambda carrageenan have been published recently. Therefore, the evident 208 from molecular docking showed that carrageenan exhibited promising inhibitory action by Carrageenan (kappa-, iota-, and lambda-) efficacy against a variety of viruses in 213 vitro, including SARS-CoV-2.",
            "latex": null,
            "type": "figure"
        },
        "FIGREF3": {
            "text": "cold is caused by a variety of respiratory viruses, including human 217 rhinoviruses (HRV), coronaviruses, human enteroviruses (HEV), parainfluenza viruses, 218 respiratory syncytial virus (RSV), and influenza viruses. On the other hand, HRVs are the 219 most common cause of respiratory tract infection in all age groups 30, 85 . In 2008, under the 220 European clinical trial registry number 2007-007577-23, double blind randomized clinical 221 trials were conducted to evaluate the efficacy and safety of iota-carrageenan in treating 222 patients with the common cold 86 . Around 35 adult patients in the United Kingdom with 223 early symptoms of the common cold received 0.12 percent iota-carrageenan in saline 224 solution three times daily for up to four days, in comparison to a placebo. Its administration 225 has been shown to decrease viral load in nasal lavages (p=0.009) and symptoms of the 226 common cold (p=0.046). Additionally, several pro-inflammatory mediators such as IFN-2, 227 IL-8, IL-10, IL-1, IP-10, GRO, G-CSF, Fractalkine, and FGF-2 are produced 86 . Likewise, this 228 study also used a large sample size of adult patients (n= 211) in Austria from 2010 to 2011 229 and was registered as ISRCTN80148028 87 . The results indicated that administering iota-230 nasal carrageenan's spray significantly decreased the duration of symptoms (p = 0.037) 231 and viral titers in nasal fluids (p=0.024) 87 . Additional large-scale studies were conducted 232 in the United Kingdom (NCT01944631) 88 and Austria (NCT04533906), both of which 233",
            "latex": null,
            "type": "figure"
        },
        "FIGREF4": {
            "text": ", a randomized double-blind trial involving 153 children was conducted 236 between 2009 and 2010 under the registration number ISRCTN52519535 to determine the 237 efficacy of 12 percent iota-carrageenan in saline solution 31 . The report concluded that 238 J o u r n a l P r e -p r o o f",
            "latex": null,
            "type": "figure"
        },
        "FIGREF5": {
            "text": "-carrageenan inhibited SARS-CoV-2 in vitro with an IC50 of 1.54 g/ml (as shown in 246 Table 1), this effect was mediated by the interaction of positively charged domains on the 247 glycoprotein envelope involved in binding to protein glycans on the host cell surface Figure 2). SARS-CoV-2 S-protein is slightly more positively charged compared to S-spike 249 protein of SARS-CoV due to the addition of four positively charged residues and the 250 elimination of five negatively charged residues 89 . Moreover, it was effective at treating 251 common colds caused by both rhinoviruses and coronaviruses 85, 87 . Thus, the 252 transferability of these in vitro data into clinical effectiveness for COVID-19 could be 253 performed and evaluated.254 255 Iota-carrageenan could be administered directly to patients infected with COVID-19 via 256 nasal spray in conjunction with an oral antiviral such as ivermectin. Ivermectin was found 257 to have significant antiviral activity against SARS-CoV-2 in three clinical trials: 258 NCT04343092 (Effectiveness of ivermectin as adjunct therapy in COVID-19 management) 259 90 , NCT04422561 (Prophylactic ivermectin in COVID-19 contacts) 91, 92 , and NCT04381884 260 (Ivermectin effect on SARS-CoV-2 replication in patients with COVID-19)92 . --------------------------------------------Table 2. ------------------------------------------------------------264Table 2. A list of clinical trials involving carrageenan for the common cold and SARS-CoV-2265    infection that have been registered on ClinicalTrials.gov. efficacy of a topical treatment with iota carrageenan (nasal and buccal) and269 ivermectin (buccal). No adverse events were observed in the treated COVID-19 patients 270 over a 30-day period 93 . In 2021, a randomized controlled 1-1 clinical trial under 271 registration NCT04701710 was conducted to prioritize health personnel infected with 272 SARS-CoV-2 (n = 232) at Argentina's Public Healthcare Centre, using the same iota-273 carrageenan and ivermectin regimen as in the previous study 94 . The result indicated that 274 the number of subjects diagnosed with COVID-19 was significantly lower in the treated 275 group, at 3.4%, than in the control group, at 21.4% (p=0.0001) 94 . The treated group also 276 had a lower prevalence of mild to moderate COVID-19 presentation compared to the 277 control group 94 . This intensive preventive treatment with iota-carrageenan and ivermectin 278 was able to significantly reduce the number of infected health care workers 94 . The study 279 using iota-carrageenan in a single dose is still ongoing under the register numbers 280 NCT04793984, NCT04681001, and NCT04590365. Therefore, the results of these ongoing 281 clinical trials are required to provide conclusive evidence of iota-carrageenan's efficacy in 282 patients with COVID-19. Additionally, there is a dearth of data on carrageenan, particularly 283 regarding drug-drug, drug-gene, and drug-disease interactions. This information is critical 284 in predicting potential adverse events that may occur during treatment. subtypes, including kappa-, iota-, and lambda-, inhibit SARS-CoV-2 289 infection in vitro by interfering with virus adsorption and internalization. The antiviral 290 activity of iota-carrageenan as a single dose administered nasally is being studied in several 291 clinical trials, whereas its co-administration with ivermectin was studied in two clinical 292 trials and demonstrated improvement in outcome for COVID-19 patients. However, large-293 scale clinical trials should be conducted to demonstrate the efficacy of iota-carrageenan 294 and its kappa-and lambda-subtypes in the treatment of COVID-19 patients.",
            "latex": null,
            "type": "figure"
        },
        "TABREF0": {
            "text": ". In 1990, researchers discovered that kappa-carrageenan inhibited arenavirus charged amino acids at the viral envelop(Figure 2). The natural kappa-carrageenan from 131 red seaweed Gigartina skottsbergii showed anti HSV with the IC50 ranging from 0.9-1.6 and 132 0.4 μg/ml for mouse astrocytes and Vero cells, respectively 67 . Its kappa-form is also It became apparent that carrageenan has a broad spectrum of antiviral properties. Kappa-, iota-, and lambda-carrageenan are also reported to have shown antiviral activity through several viruses causing human respiratory disease which mostly belong to RNA viruses",
            "latex": null,
            "type": "table"
        },
        "TABREF1": {
            "text": "FundingThe author wishes to express his gratitude to Program for Prioritas Nasional Ilmu",
            "latex": null,
            "type": "table"
        },
        "TABREF2": {
            "text": "A list of clinical trials involving carrageenan for the common cold and SARS-CoV-2 infection that have been registered on ClinicalTrials.gov J o u r n a l P r e -p r o o f Prophylactic treatment with carragelose nasal spray to prevent SARS-CoV-2, COVID-19, infections in health care workers",
            "latex": null,
            "type": "table"
        }
    },
    "back_matter": []
}