{
    "paper_id": "0a6e0064fb876e5e6b3f0f56878ffd184d72fb04",
    "metadata": {
        "title": "Original Article The Association for Perioperative Practice The Association for Perioperative Practice Creating conference posters: Structure, form and content Introduction and aims",
        "authors": [
            {
                "first": "Eleanor",
                "middle": [],
                "last": "Barker",
                "suffix": "",
                "affiliation": {},
                "email": ""
            },
            {
                "first": "Veronica",
                "middle": [],
                "last": "Phillips",
                "suffix": "",
                "affiliation": {},
                "email": ""
            }
        ]
    },
    "abstract": [
        {
            "text": "This article aims to provide an overview of the form, structure and content of conference posters for researchers who intend to submit an academic poster to a conference. It focuses in particular on the design and layout of academic conference posters, making some suggestions for possible poster layouts. It also provides information about factors influencing conference selection. Finally, it summarises some top tips to be considered when creating a conference poster such as font selection and use of images.",
            "cite_spans": [],
            "ref_spans": [],
            "section": "Abstract"
        }
    ],
    "body_text": [
        {
            "text": "This article provides an overview of the process of designing and creating academic posters. It will discuss tools and resources that will be of use to researchers who intend to submit an academic poster to a conference.",
            "cite_spans": [],
            "ref_spans": [],
            "section": "Introduction and aims"
        },
        {
            "text": "Academic conference posters are a method of communicating academic research succinctly (Gopal et al 2017) . Posters give the opportunity to present the author's work in an attractive way. They can be created for a number of reasons, including communicating the progress that a research project is making, to look for collaborators for future research projects, as an alternative to a traditional conference presentation, as an effective entry to the development of professional presentations (Durkin 2011) or to further a career. Creating a poster provides the author with a pleasing visual record of their research, which can be displayed publicly after the conference. Academic posters are also created in order to increase a researcher's impact in a particular field of research, which may open up future research and employment opportunities.",
            "cite_spans": [
                {
                    "start": 87,
                    "end": 105,
                    "text": "(Gopal et al 2017)",
                    "ref_id": null
                },
                {
                    "start": 492,
                    "end": 505,
                    "text": "(Durkin 2011)",
                    "ref_id": "BIBREF2"
                }
            ],
            "ref_spans": [],
            "section": "Introduction and aims"
        },
        {
            "text": "The audience for a conference poster will depend on the nature of the conference. Many organisations hold their own internal conferences that communicate the results of projects that have been undertaken within departments, or to promote best practice. The audience at an academic conference will be researchers, academics, students and professionals who want to keep up to date with the latest research or who are looking for potential research collaborators. Sometimes scientists will be asked to present their research to members of the public in a poster. The content and presentation of the poster will need to be adapted to suit the intended audience. This article focuses on the design of academic conference posters in order to meet these needs.",
            "cite_spans": [],
            "ref_spans": [],
            "section": "Audience"
        },
        {
            "text": "When selecting a conference at which to present a poster, there are several factors which should be considered by the author. For example, researchers should consider which conference has the most relevant subject coverage. This may be a conference which the author has previously attended, one that is promoted by a colleague, or one that is advertised in a journal or mailing list. Lang et al (2019) identified five factors that students and practitioners should consider when selecting a conference to attend. These factors are:",
            "cite_spans": [
                {
                    "start": 384,
                    "end": 401,
                    "text": "Lang et al (2019)",
                    "ref_id": "BIBREF6"
                }
            ],
            "ref_spans": [],
            "section": "Conference selection"
        },
        {
            "text": "• The conference is targeted towards specific areas of interest • There are opportunities for networking • There are well-known and respected plenary speakers • There is an opportunity to present • The conference has been recommended by others or has been attended by the author previously.",
            "cite_spans": [],
            "ref_spans": [],
            "section": "Conference selection"
        },
        {
            "text": "Another factor which will influence conference selection is cost. In order to obtain funding from an employer or external funding organisation, it may be necessary to demonstrate how presenting at a conference will benefit the author and their organisation (Gray 2020).",
            "cite_spans": [],
            "ref_spans": [],
            "section": "Conference selection"
        },
        {
            "text": "The main purpose of creating an academic poster is the ability to communicate information in a concise and visually pleasing way (Gundogan et al 2016 , Rowe & Ilic 2011 . In order to present information as clearly as possible, a conference poster can have a similar structure to a research paperbut it will need to have a much smaller word count. This means initial planning to ensure the relevant information is conveyed within the poster using the words available.",
            "cite_spans": [
                {
                    "start": 129,
                    "end": 149,
                    "text": "(Gundogan et al 2016",
                    "ref_id": "BIBREF5"
                },
                {
                    "start": 150,
                    "end": 168,
                    "text": ", Rowe & Ilic 2011",
                    "ref_id": "BIBREF10"
                }
            ],
            "ref_spans": [],
            "section": "Poster layout"
        },
        {
            "text": "Before beginning to design and create an academic poster, the requirements of the conference should be clearly understood by the author. These requirements include the orientation of the poster: is it landscape or portrait? Does the conference specify which fonts must be used and what size? How long can the title be? If submission guidelines are not followed, it may lead to a conference poster submission being rejected (Berg & Hicks 2017).",
            "cite_spans": [],
            "ref_spans": [],
            "section": "Poster layout"
        },
        {
            "text": "Once the requirements have been read and understood, it is time to begin the design process. It is helpful to sketch a poster on paper first before creating it on a computer. The poster can be designed using boxes to represent the different sections, and the content can be added later. There should be a clear flow from section to section on a poster to make it as easy to read and follow as possible. Poster colour schemes should be carefully selected, keeping to only two or three colours. Red and green colour combinations should be avoided, as people with colour blindness will find this combination difficult to read. Colour can be used to emphasize the poster's primary focusfor example red to associate a poster with heart disease (Christenbery & Latham 2013) .",
            "cite_spans": [
                {
                    "start": 739,
                    "end": 767,
                    "text": "(Christenbery & Latham 2013)",
                    "ref_id": "BIBREF1"
                }
            ],
            "ref_spans": [],
            "section": "Poster layout"
        },
        {
            "text": "In order to make a poster attractive and easy to comprehend, around 30 to 40% should be empty space, for example between each section of the poster. There should be 40 to 50% of the space taken up with graphics, and 20 to 25% should contain text (Baker 2012) . If a poster contains too much text and too many graphics, it makes it much harder to read.",
            "cite_spans": [
                {
                    "start": 246,
                    "end": 258,
                    "text": "(Baker 2012)",
                    "ref_id": "BIBREF0"
                }
            ],
            "ref_spans": [],
            "section": "Poster layout"
        },
        {
            "text": "For an alternative design idea, see resources that Morrison has created (Morrison 2019) . This alternative poster design was developed in order to make it much easier for a poster's audience to understand the main finding that the author is communicating. In this design, all the important information is included but is not the main emphasis of the poster. It also incorporates the use of a QR code where the poster and supplementary material can be downloaded.",
            "cite_spans": [
                {
                    "start": 72,
                    "end": 87,
                    "text": "(Morrison 2019)",
                    "ref_id": "BIBREF7"
                }
            ],
            "ref_spans": [],
            "section": "Poster layout"
        },
        {
            "text": "A key part of any academic poster is its title. The title of an academic poster is the part that is going to grab people's attention and encourage them to read the poster. It is therefore vital that it clearly describes the topic of the poster and is short and catchy (Siedlecki 2017) . It should be the largest font size on a poster.",
            "cite_spans": [
                {
                    "start": 268,
                    "end": 284,
                    "text": "(Siedlecki 2017)",
                    "ref_id": "BIBREF11"
                }
            ],
            "ref_spans": [],
            "section": "Poster layout"
        },
        {
            "text": "The author of an academic poster should be clearly displayed on the poster along with the author's job title and contact details. This will allow anyone with questions to follow-up once the conference is over. In their study, Gopal et al (2017) found that only 41% of the posters they assessed included contact details either email or postal address. The author's organisation and/or funder may also require that their logos be added to the poster.",
            "cite_spans": [
                {
                    "start": 226,
                    "end": 244,
                    "text": "Gopal et al (2017)",
                    "ref_id": null
                }
            ],
            "ref_spans": [],
            "section": "Poster layout"
        },
        {
            "text": "The introduction is the opportunity to explain why the poster was created and set the context for the information presented in the poster. As in a research paper, the methods are used to explain how the research was conducted. If the poster is about a particular procedure or piece of equipment, a photograph can be used in place of words. The addition of photographs will make a poster more visually pleasing and will reduce the number of words required in the methods section.",
            "cite_spans": [],
            "ref_spans": [],
            "section": "Poster layout"
        },
        {
            "text": "Research results can be presented in several ways, such as graphs, charts or infographics. This again makes the poster more visually pleasing and aids the comprehension of the results. Data that are presented as graphs, charts or infographics ensure that the results of research can be understood much quicker than trying to read tables of data or large amounts of text.",
            "cite_spans": [],
            "ref_spans": [],
            "section": "Poster layout"
        },
        {
            "text": "The conclusions of the research can be presented as bullet points, the information can be listed in a concise way that the audience can easily find on the poster. This section may include what was learnt, the significance of the findings and opportunities for future research.",
            "cite_spans": [],
            "ref_spans": [],
            "section": "Poster layout"
        },
        {
            "text": "The main text of a poster should be readable from at least 1.5m away. Any labels on diagrams and references can be of a smaller size. Exact font sizes might be specified in the conference submission guidance, in which case these should be followed exactly. Any headings of the same importance should be of the same font size.",
            "cite_spans": [],
            "ref_spans": [],
            "section": "Poster layout"
        },
        {
            "text": "It is important that any other sources used during the creation of the poster are correctly referenced. It is usual to have around five references on a poster, all formatted correctly. Using a reference manager such as Endnote, Mendeley or Zotero can help to ensure that references are in the correct format. Endnote has a plugin which can be used with PowerPoint, for other reference managers, authors must create the references in Word and then copy and paste them to PowerPoint. As Gopal et al (2017) discovered in their study, even when predefined requirements are only size and orientation, 28% of posters did not meet both of these criteria.",
            "cite_spans": [
                {
                    "start": 485,
                    "end": 503,
                    "text": "Gopal et al (2017)",
                    "ref_id": null
                }
            ],
            "ref_spans": [],
            "section": "Poster layout"
        },
        {
            "text": "As Gundogan et al state (2016) an academic poster should be an aesthetically pleasing formattherefore an important element of any poster are the images that it contains. These could be photographs, diagrams, charts or graphs. If images are used they should be in PNG, GIF, JPEG or TIF formats as these are better for re-sizing without losing image clarity. If images from other sources are used, it is important that any copyright licences are complied with. If possible, an author should use their own images as they will own the copyright on those images. As Gopal et al (2017) illustrated in their study, only 29% of posters assessed had no copyright issues with the material they had included. Any images included in a poster should have a resolution of at least two hundred dots per inch or 80 dots per centimetre to avoid the image having a grainy or pixelated appearance when it is enlarged. Pixabay is a good source of royalty-free images with CC0 licenses (Pixabay 2020). The use of infographics can make a poster more visually appealing. Infographics can be created in many applications, including Canva, Easelly or Piktochart.",
            "cite_spans": [
                {
                    "start": 561,
                    "end": 579,
                    "text": "Gopal et al (2017)",
                    "ref_id": null
                }
            ],
            "ref_spans": [],
            "section": "Presentation of information"
        },
        {
            "text": "When creating a poster, it is important to ensure that the poster has been completed ahead of any deadlines to ensure that there is enough time to print the poster, if required. The conference requirements may state that the posters will be printed by the organisers or the author may have to print it themselves.",
            "cite_spans": [],
            "ref_spans": [],
            "section": "Presentation of information"
        },
        {
            "text": "During the COVID-19 pandemic, many traditional face-toface conferences have been moving online. There are three main formats that conferences have used to present posters in an online environment.",
            "cite_spans": [],
            "ref_spans": [],
            "section": "Presenting a conference poster online"
        },
        {
            "text": "• An online galleryposters are hosted online. These online galleries are sometimes supplemented with an online discussion board to ask questions about the posters. • Asynchronousthis involves recording a video presentation of about 5min explaining the poster. There may then be a live session during the conference where attendees could question the posters author. • Synchronousa poster is presented live during a scheduled session with the opportunity for questions.",
            "cite_spans": [],
            "ref_spans": [],
            "section": "Presenting a conference poster online"
        },
        {
            "text": "Although the disadvantage of electronic posters is that they are harder to keep on permanent display, the advantage is that they can still be viewed after a conference is over, allowing discussions to continue (Powell-Tuck et al 2002) .",
            "cite_spans": [
                {
                    "start": 210,
                    "end": 234,
                    "text": "(Powell-Tuck et al 2002)",
                    "ref_id": "BIBREF9"
                }
            ],
            "ref_spans": [],
            "section": "Presenting a conference poster online"
        },
        {
            "text": "When creating an academic poster, the author needs to ensure that the submission guidelines are followed. The use of a non-serif font makes the content easier to read in smaller sizes. If any images that are not the author's own are used, the author should have the correct permissions to use them. The author should try not to cram as much information as possible into the poster; there should be a clear flow and space between sections on the poster. In order to avoid any errors in spelling and grammar, a colleague can be asked to proofread the poster before it is submitted.",
            "cite_spans": [],
            "ref_spans": [],
            "section": "Conclusion and top tips"
        },
        {
            "text": "Once the conference is over, the poster can be displayed in an office or in the author's department. This allows a wider audience to see the poster. The poster could be added to a repository online if it has not already been archived by the conference.",
            "cite_spans": [],
            "ref_spans": [],
            "section": "Conclusion and top tips"
        },
        {
            "text": "Veronica Phillips https://orcid.org/0000-0002-4383-9434",
            "cite_spans": [],
            "ref_spans": [],
            "section": "ORCID iD"
        }
    ],
    "bib_entries": {
        "BIBREF0": {
            "ref_id": "b0",
            "title": "University of Oxford/IT learning Programme Berg J, Hicks R 2017 Successful design and delivery of a professional poster",
            "authors": [
                {
                    "first": "D",
                    "middle": [],
                    "last": "Baker",
                    "suffix": ""
                }
            ],
            "year": 2012,
            "venue": "Presentations: Creating Conference Posters using PowerPoint Oxford",
            "volume": "29",
            "issn": "",
            "pages": "461--469",
            "other_ids": {}
        },
        "BIBREF1": {
            "ref_id": "b1",
            "title": "Creating effective scholarly posters: a guide for DNP students",
            "authors": [
                {
                    "first": "T",
                    "middle": [
                        "L"
                    ],
                    "last": "Christenbery",
                    "suffix": ""
                },
                {
                    "first": "T",
                    "middle": [
                        "G"
                    ],
                    "last": "Latham",
                    "suffix": ""
                }
            ],
            "year": 2013,
            "venue": "Journal of the American Association of Nurse Practitioners",
            "volume": "25",
            "issn": "",
            "pages": "16--23",
            "other_ids": {}
        },
        "BIBREF2": {
            "ref_id": "b2",
            "title": "Promoting professional development through poster presentations",
            "authors": [
                {
                    "first": "G",
                    "middle": [],
                    "last": "Durkin",
                    "suffix": ""
                }
            ],
            "year": 2011,
            "venue": "Journal for Nurses in Staff Development",
            "volume": "27",
            "issn": "",
            "pages": "1--3",
            "other_ids": {}
        },
        "BIBREF4": {
            "ref_id": "b4",
            "title": "Developing and writing a conference abstract",
            "authors": [
                {
                    "first": "B",
                    "middle": [],
                    "last": "Gray",
                    "suffix": ""
                }
            ],
            "year": 2020,
            "venue": "International Journal of Orthopaedic and Trauma Nursing",
            "volume": "36",
            "issn": "",
            "pages": "",
            "other_ids": {}
        },
        "BIBREF5": {
            "ref_id": "b5",
            "title": "How to make an academic poster",
            "authors": [
                {
                    "first": "B",
                    "middle": [],
                    "last": "Gundogan",
                    "suffix": ""
                },
                {
                    "first": "K",
                    "middle": [],
                    "last": "Koshy",
                    "suffix": ""
                },
                {
                    "first": "L",
                    "middle": [],
                    "last": "Kurar",
                    "suffix": ""
                },
                {
                    "first": "K",
                    "middle": [],
                    "last": "Whitehurst",
                    "suffix": ""
                }
            ],
            "year": 2016,
            "venue": "Annals of Medicine and Surgery",
            "volume": "11",
            "issn": "",
            "pages": "69--71",
            "other_ids": {}
        },
        "BIBREF6": {
            "ref_id": "b6",
            "title": "An approach to conference selection and evaluation: advice to avoid \"predatory\" conferences",
            "authors": [
                {
                    "first": "R",
                    "middle": [],
                    "last": "Lang",
                    "suffix": ""
                },
                {
                    "first": "M",
                    "middle": [],
                    "last": "Mintz",
                    "suffix": ""
                },
                {
                    "first": "H",
                    "middle": [
                        "B"
                    ],
                    "last": "Krentz",
                    "suffix": ""
                },
                {
                    "first": "M",
                    "middle": [
                        "J"
                    ],
                    "last": "Gill",
                    "suffix": ""
                }
            ],
            "year": 2019,
            "venue": "Scientometrics",
            "volume": "118",
            "issn": "",
            "pages": "687--698",
            "other_ids": {}
        },
        "BIBREF7": {
            "ref_id": "b7",
            "title": "Let's fix academic posters! Prepping a poster for #SIOP19 and sick of the old \"wall-of-text\" poster design? Watch this cartoon to see a new, faster approach to designing research posters. Includes templates",
            "authors": [
                {
                    "first": "M",
                    "middle": [],
                    "last": "Morrison",
                    "suffix": ""
                }
            ],
            "year": 2019,
            "venue": "",
            "volume": "",
            "issn": "",
            "pages": "",
            "other_ids": {}
        },
        "BIBREF8": {
            "ref_id": "b8",
            "title": "PIXABAY 2020 Pixabay",
            "authors": [],
            "year": 2020,
            "venue": "",
            "volume": "",
            "issn": "",
            "pages": "",
            "other_ids": {}
        },
        "BIBREF9": {
            "ref_id": "b9",
            "title": "Electronic poster presentations in BAPEN -a controlled evaluation",
            "authors": [
                {
                    "first": "J",
                    "middle": [],
                    "last": "Powell-Tuck",
                    "suffix": ""
                },
                {
                    "first": "S",
                    "middle": [],
                    "last": "Leach",
                    "suffix": ""
                },
                {
                    "first": "L",
                    "middle": [],
                    "last": "Maccready",
                    "suffix": ""
                }
            ],
            "year": 2002,
            "venue": "Clinical Nutrition",
            "volume": "21",
            "issn": "",
            "pages": "261--263",
            "other_ids": {}
        },
        "BIBREF10": {
            "ref_id": "b10",
            "title": "Poster presentation -a visual medium for academic and scientific meetings",
            "authors": [
                {
                    "first": "N",
                    "middle": [],
                    "last": "Rowe",
                    "suffix": ""
                },
                {
                    "first": "D",
                    "middle": [],
                    "last": "Ilic",
                    "suffix": ""
                }
            ],
            "year": 2011,
            "venue": "Paediatric Respiratory Reviews",
            "volume": "12",
            "issn": "",
            "pages": "208--213",
            "other_ids": {}
        },
        "BIBREF11": {
            "ref_id": "b11",
            "title": "Original research: how to create a poster that attracts an audience",
            "authors": [
                {
                    "first": "S",
                    "middle": [
                        "L"
                    ],
                    "last": "Siedlecki",
                    "suffix": ""
                }
            ],
            "year": 2017,
            "venue": "American Journal of Nursing",
            "volume": "117",
            "issn": "",
            "pages": "48--54",
            "other_ids": {}
        }
    },
    "ref_entries": {},
    "back_matter": []
}