{
    "paper_id": "0a754b38b63e76f5c6dbf20a486f8ecf5baf5fc9",
    "metadata": {
        "title": "Reduction in urban atmospheric CO 2 enhancement in seoul, South Korea, resulting from social distancing policies during the COVID-19 pandemic",
        "authors": [
            {
                "first": "C",
                "middle": [],
                "last": "Jeong",
                "suffix": "",
                "affiliation": {},
                "email": ""
            },
            {
                "first": "S",
                "middle": [],
                "last": "Shin",
                "suffix": "",
                "affiliation": {},
                "email": ""
            },
            {
                "first": "Y.-S",
                "middle": [],
                "last": "Cha",
                "suffix": "",
                "affiliation": {},
                "email": ""
            },
            {
                "first": "Y.-S",
                "middle": [],
                "last": "Lee",
                "suffix": "",
                "affiliation": {},
                "email": ""
            },
            {
                "first": "H.-C",
                "middle": [],
                "last": "",
                "suffix": "",
                "affiliation": {},
                "email": ""
            }
        ]
    },
    "abstract": [],
    "body_text": [
        {
            "text": "Owing to increased CO2 emissions from the usage of fossil fuel, global CO2 concentrations 41 continue to increase, exceeding 400 ppm from observation taken in 2015 (Friedlingstein et al., router. A two-point calibration was performed for the SNUCO2M once every two weeks using 109 zero gas (0 ppm) and two span gases of CO2 (400 and 1000 ppm). The maximum error range 110 of SNUCO2M is 0.71% from the observed value, indicating that it is suitable for measuring a 111 wide range of urban CO2 concentrations (Park et al., 2020b) .",
            "cite_spans": [
                {
                    "start": 159,
                    "end": 187,
                    "text": "2015 (Friedlingstein et al.,",
                    "ref_id": null
                },
                {
                    "start": 507,
                    "end": 527,
                    "text": "(Park et al., 2020b)",
                    "ref_id": null
                }
            ],
            "ref_spans": [],
            "section": "40"
        },
        {
            "text": "SNUCO2M was installed at several sites around the Seoul Capital Area. In this study, two 113 sites from the SNUCO2M network were used. One site was located on the roof of the Yongsan operating since July 2019. The SNUCO2M at NST is located horizontally near the YSB site 120 (i.e., 3.5 km apart), but the inlet was installed at a much higher altitude (420 m asl). A (G2131, Picarro Inc., Santa Clara, CA, USA) was installed at the site, and the CO2 analyzer 128 had a precision of < 200 ppb and was calibrated regularly using the same method as the 129 SNUCO2M. Hourly averaged CO2 concentration data were used in this study after removing 130 the outlying CO2 concentration data at the three sites, caused by malfunction of the instrument and calibration.",
            "cite_spans": [],
            "ref_spans": [],
            "section": "112"
        },
        {
            "text": "The observed CO2 concentration data were analyzed using two methods (Park et al., 2020b) 133 to quantify urban CO2 enhancement (△CO2 = CO2 Urban − CO2 Background ), representing the urban 134 contribution of atmospheric CO2 concentration from Seoul. In brief, the first method 135 considered the difference in vertical CO2 concentrations in the Seoul Capital Area. By 136 comparing the CO2 concentrations measured at YSB and NST, located adjacent to each other 137 but at different altitudes, the CO2 enhancement (△CO2) could be quantified (i.e., a local effect). ",
            "cite_spans": [
                {
                    "start": 68,
                    "end": 88,
                    "text": "(Park et al., 2020b)",
                    "ref_id": null
                }
            ],
            "ref_spans": [],
            "section": "132"
        },
        {
            "text": "The second method uses the horizontal difference in CO2 concentration, which compares 146 the CO2 concentration at Seoul with that in the outer background area. We quantified △CO2 by 147 comparing the CO2 concentrations between YSB and GWA (△CO2 2 = CO2 YSB − CO2 GWA ).",
            "cite_spans": [],
            "ref_spans": [],
            "section": "145"
        },
        {
            "text": "is divided into three separate periods. The period from July 21, 2019 to December 31, 2019, 178 before the COVID-19 virus was manifested in Seoul, is classified as the pre-COVID-19 period 179 (Table 1) .",
            "cite_spans": [],
            "ref_spans": [
                {
                    "start": 192,
                    "end": 201,
                    "text": "(Table 1)",
                    "ref_id": "TABREF0"
                }
            ],
            "section": "145"
        },
        {
            "text": "The period following the occurrence of COVID-19 is classified into two periods, Level 1 181 and Level 2.5, based on each phase of the \"Intensive Social Distancing (ISD)\" policy in Seoul.",
            "cite_spans": [],
            "ref_spans": [],
            "section": "180"
        },
        {
            "text": "Level 1 includes the period from March 22, 2020 to April 19, 2020. As shown in Table 1 it was difficult to evaluate the effect of implemented policies in real-time using inventory data 296 that accounted for energy use in each building, since inventory data for the present year are 297 typically not available until two to three years later (Seoul Metropolitan Government, 2017) .",
            "cite_spans": [
                {
                    "start": 342,
                    "end": 379,
                    "text": "(Seoul Metropolitan Government, 2017)",
                    "ref_id": null
                }
            ],
            "ref_spans": [
                {
                    "start": 79,
                    "end": 86,
                    "text": "Table 1",
                    "ref_id": "TABREF0"
                }
            ],
            "section": "182"
        },
        {
            "text": "In contrast, the urban CO2 observation data used in this study made it possible to verify the 299 effects of policy-induced atmospheric CO2 concentration reduction in real-time. Therefore, to 300 develop and evaluate policies for future CO2 emissions reduction, it is suggested that these 301 urban CO2 ground observations should be extended.",
            "cite_spans": [],
            "ref_spans": [],
            "section": "298"
        },
        {
            "text": "Taking advantage of these real-time CO2 observations, this study confirmed that the phase-303 by-phase social distancing policies implemented in Seoul due to the COVID-19 pandemic led 304 to a reduction in human activity and even led to a reduction in the atmospheric CO2 305 concentration. This suggests that if effective policies that can reduce CO2 emissions from 306 human activity are developed and implemented in cities around the world in the future, they 307 will prevent the rapid rise in global CO2 concentrations and effectively mitigate climate change.",
            "cite_spans": [],
            "ref_spans": [],
            "section": "302"
        },
        {
            "text": "The COVID-19 virus has caused tremendous socioeconomic damage; however, it has provided 309 a positive outlook regarding the potential for future climate change and greenhouse gas 310 reduction, demonstrating the important role of effective policies and cities in managing 311 greenhouse gas levels. using two different methods during the pre-COVID-19, Level 1, and Level 2.5 periods.",
            "cite_spans": [],
            "ref_spans": [],
            "section": "308"
        },
        {
            "text": "The value in parentheses is the standard deviation (± σ) from the mean value. ",
            "cite_spans": [],
            "ref_spans": [],
            "section": "430"
        }
    ],
    "bib_entries": {
        "BIBREF0": {
            "ref_id": "b0",
            "title": "Urban enhancement (ppm) / Urban contribution (%) Mean",
            "authors": [],
            "year": null,
            "venue": "",
            "volume": "",
            "issn": "",
            "pages": "",
            "other_ids": {}
        }
    },
    "ref_entries": {
        "FIGREF0": {
            "text": "Building (YSB, 37.523°N, 126.963°E), operating since October 2018. The inlet was installed 115 at a height of 113 m above mean sea level (asl), unaffected by surrounding structures, allowing 116 the sampling of well-mixed urban air. The YSB site is located in the center of Seoul with a 117 suitable observation height, enabling the measurement of the effects of CO2 emissions in Seoul 118 for all time zones. The other site was the Namsan Seoul Tower (NST, 37.551°N, 126.988°E), 119",
            "latex": null,
            "type": "figure"
        },
        "FIGREF1": {
            "text": "121 comparison of CO2 concentrations from YSB and NST facilitates an evaluation of CO2 122 concentration based on altitude. 123 In addition to the two urban sites in Seoul, CO2 concentrations were measured at the top 124 of the Gwanak Mountain, located far from the central area of Seoul (GWA, 37.443°N, 125 126.967°E, 629 m asl; Park et al., 2020b). GWA has been in operation as a representative 126 background atmospheric CO2 site of Seoul since January 2009. A Picarro CO2 analyzer 127",
            "latex": null,
            "type": "figure"
        },
        "FIGREF2": {
            "text": "At night, when the planetary boundary layer (PBL) in Seoul decreases below 400 m, NST is 139 located above the PBL, and the incoming air transported from the background areas outside 140 the Seoul urban area is observed; meanwhile, YSB remains located below the PBL, and the air 141 within Seoul urban area is continuously observed. Considering this vertical variability in PBL, 142 the difference in CO2 concentration between YSB and NST observed from 03:00-06:00 local 143 standard time (LST), when the PBL is at its lowest in Seoul, is used as the △CO2 of Seoul 144 (△CO2 1 = CO2 YSB − CO2 NST ).",
            "latex": null,
            "type": "figure"
        },
        "FIGREF3": {
            "text": "1 period, ISD policies were strongly implemented in Seoul for the first time, with 184 telecommuting replacing most school and work activity.185    Level 2.5 occurred from August 30, 2020 to September 13, 2020 and includes policies 186 from the \"Step 2.5 Intensive Social Distancing\" phase. During the Level 2.5 period, policies 187 much stronger than those from the Level 1 period were enabled, with all activities involving 188 the prohibition of indoor gatherings of more than 50 people, and the restriction of all private 189 facilities, including restaurants and cafes, to operation only between the hours of 05:00-21. 1 shows the monthly mean CO2 concentrations at the three observation sites from July 194 2019 to the present. Months with more than 50% of data missing owing to sensor calibration 195 were excluded. Although, on average, the CO2 concentration for all three observation sites is observation site. The mean CO2 concentration in YSB during this period is 442.99 ppm, which 199 is 11.00 and 13.34 ppm higher than that of NST (432.00 ppm) and GWA (429.65 ppm),200 respectively. In general, the three observation sites well represent variations in urban and local 201 background CO2 concentrations in downtown Seoul. In addition, the average CO2 202 concentration over the three stations (e.g., 434.88 ppm) is higher than that from Mauna Loa by 203 22.23 ppm obtained from the National Oceanic and Atmospheric Administration 204 (https://gml.noaa.gov/ccgg/trends/data.html; Thoning et al., 1989). 205 Using the observed CO2 concentration data, urban enhancement in Seoul was quantified 206 in two ways. Fig. 2a shows a box plot of △CO2 1 for each period quantified using method 1, 207 which considers the difference in vertical CO2 concentration. The average △CO2 1 during the 208 pre-COVID-19 period is 22.56 ppm but decreases to 14.23 ppm during the Level 1 period and 209 10.99 ppm during the Level 2.5 period (Table 2). The 95 th percentile of △CO2 1 , a proxy for 210 high CO2 concentration emissions in Seoul, decreased more significantly from 59.04 ppm 211 during the pre-COVID-19 period to 40.94 and 36.15 ppm during Level 1 and Level 2.5 periods, 212 respectively. We calculated the urban contribution for each period (urban contribution = △CO2 213 / CO2 concentration × 100; Fig. 2b) to compare the percentage of △CO2 1 accounting for 214 atmospheric CO2 concentrations in Seoul. The degree to which the CO2 concentration due to 215 urban emissions affected the atmospheric CO2 concentration for each period was 4.81%, on 216 average, during the pre-COVID-19 period but decreased to 3.07% and 2.46% during the Level 217 1 and Level 2.5 periods, respectively. Compared with the pre-COVID-19 period, Seoul's urban 218 contribution was reduced by half, and Seoul's CO2 concentration showed a decreasing tendency 219 from 451.76 ppm during the pre-COVID-19 period to 451.38 and 434.54 ppm during the Level 220 1 and Level 2.5 periods, respectively. In contrast, background CO2 concentration increased although the urban CO2 concentration of Seoul reduced due to rapid decrease in CO2 emissions 267 caused by the social distancing policies. In other words, CO2 concentration in cities that are 268 known to generate most of the world's CO2 emissions can be effectively reduced by policies 269 that curb human activity (Duren and Miller, 2012; Schwandner et al., 2017). In addition, △CO2 270 and the urban contribution of Seoul over the Level 2.5 period showed a greater reduction than 271 that of the Level 1 period. Since Level 2.5 was implemented for only two weeks, the reduction 272 in CO2 concentration would have been more noticeable if the implementation period was longer. 273 This indicates that the intensity of the policies implemented within the city can greatly affect 274 the reduction in CO2 emissions. 275 The reduction of atmospheric CO2 concentration in urban areas can be considered a 276 compound result of changes in local weather conditions and direct emission from the city 277 (Xueref-Remy, 2018; Park et al., 2020a). Therefore, we analyzed the correlation between urban 278 CO2 enhancement and meteorological parameters (i.e., temperature, precipitation, wind 279 direction, and wind speed) during the research period to examine the impact of meteorological 280parameters on urban CO2 enhancement. We found that there was no statistically significant 281 correlation between urban CO2 enhancement and temperature and precipitation. In addition, 282 the urban CO2 enhancement did not significantly vary with the direction of the wind at the YSB 283 site. In contrast, CO2 enhancement showed a distinct exponential relationship with wind speed; 284 however, the average wind speed in Seoul was not significantly different during the pre-285 COVID-19, Level 1, and Level 2.5 periods. This demonstrates that the decrease in atmospheric 286 CO2 concentration in Seoul during the COVID-19 pandemic results from changes in direct CO2 287 emissions from Seoul due to social distancing policies.288The reduction in CO2 emissions due to COVID-19 social distancing policies was verified using traffic volume, which accounts for the largest portion of the emission sources in Seoul290 and floating population, presumed to represent human activity (Seoul Metropolitan 291 Government, 2017). The results show that the traffic volume and floating population around 292 the YSB site decreased by 10.73% and 12.55% during the Level 1 period and by 43.25% and 293 14.11% during the Level 2.5 period, respectively. Along with the traffic volume, fossil fuel 294 usage from buildings is the second largest source of direct CO2 emissions in Seoul; however, 295",
            "latex": null,
            "type": "figure"
        },
        "FIGREF4": {
            "text": "Time series of the monthly mean atmospheric CO2 concentration (ppm) over the 424 Yongsan Building (YSB, gray), Namsan Seoul Tower (NST, red), and Gwanak Mountain 425 (GWA, blue) from July 2019 to September 2020. Error bars indicate the standard 426 deviation (± σ) of CO2 concentration from the mean value.",
            "latex": null,
            "type": "figure"
        },
        "FIGREF5": {
            "text": "Box plot of (a) urban enhancement and (b) urban contribution using method 1 435 during the pre-COVID-19, Level 1, and Level 2.5 periods. Each box plot represents the 436 mean (red), median (blue), 25 th and 75 th percentiles, and outliers (circle). Box plot of (a) urban enhancement and (b) urban contribution using method 2 440 during the pre-COVID-19, Level 1, and Level 2.5 periods. Each box plot represents the 441 mean (red), median (blue), 25 th and 75 th percentiles, and outliers (circle). Bar graph of the traffic volume and a scatter plot of the floating population near 445 the YSB site during the pre-COVID-19, Level 1, and Level 2.5 periods.",
            "latex": null,
            "type": "figure"
        },
        "TABREF0": {
            "text": "Description of Intensive Social Distancing (ISD) policies during the COVID-19pandemic in Seoul, South Korea.-Normal condition of Seoul with no restrictions. Mandatory remote classes for schools, kindergartens, and day care centers.-No gatherings for 50 or more indoor or 100 or more outdoor guests.-No business in private facilities, e.g., restaurant, cafe, from 9:00 p.m. to 5:00 a.m.",
            "latex": null,
            "type": "table"
        },
        "TABREF1": {
            "text": "Summary of CO2 concentration, urban enhancement, and urban contribution",
            "latex": null,
            "type": "table"
        }
    },
    "back_matter": []
}