{
    "paper_id": "0a76f202088458ae9e9880789888efa5621e3e0c",
    "metadata": {
        "title": "Scientific Reports | (2021) 11:18844. 11 Biocomputing and Health Data Science, Instituto Aragonés de Ciencias de La Salud (IACS)",
        "authors": [
            {
                "first": "Rocío",
                "middle": [],
                "last": "Aznar-Gimeno",
                "suffix": "",
                "affiliation": {},
                "email": ""
            },
            {
                "first": "J",
                "middle": [],
                "last": "Ramón Paño-Pardo",
                "suffix": "",
                "affiliation": {
                    "laboratory": "",
                    "institution": "University Clinic Hospital Lozano Blesa",
                    "location": {
                        "addrLine": "San Juan Bosco 15",
                        "postCode": "50009",
                        "settlement": "Zaragoza",
                        "country": "Spain"
                    }
                },
                "email": ""
            },
            {
                "first": "Luis",
                "middle": [
                    "M"
                ],
                "last": "Esteban",
                "suffix": "",
                "affiliation": {
                    "laboratory": "",
                    "institution": "Universidad de Zaragoza",
                    "location": {
                        "addrLine": "Calle Mayor, 5, 50100 La Almunia de Doña Godina",
                        "settlement": "Zaragoza",
                        "country": "Spain"
                    }
                },
                "email": ""
            },
            {
                "first": "Gorka",
                "middle": [],
                "last": "Labata-Lezaun",
                "suffix": "",
                "affiliation": {},
                "email": ""
            },
            {
                "first": "M",
                "middle": [],
                "last": "José Esquillor-Rodrigo",
                "suffix": "",
                "affiliation": {
                    "laboratory": "",
                    "institution": "University Clinic Hospital",
                    "location": {}
                },
                "email": ""
            },
            {
                "first": "Angel",
                "middle": [],
                "last": "Lanas",
                "suffix": "",
                "affiliation": {
                    "laboratory": "",
                    "institution": "University of Zaragoza",
                    "location": {
                        "settlement": "Zaragoza",
                        "country": "Spain"
                    }
                },
                "email": ""
            },
            {
                "first": "David",
                "middle": [],
                "last": "Abadía-Gallego",
                "suffix": "",
                "affiliation": {},
                "email": ""
            },
            {
                "first": "Francisco",
                "middle": [],
                "last": "Diez-Fuertes",
                "suffix": "",
                "affiliation": {
                    "laboratory": "Hospital Clínic-Institut d'Investigacions Biomèdiques August Pi I Sunyer (IDIBAPS)",
                    "institution": "",
                    "location": {
                        "postCode": "08036",
                        "settlement": "Barcelona",
                        "country": "Spain"
                    }
                },
                "email": ""
            },
            {
                "first": "Carlos",
                "middle": [],
                "last": "Tellería-Orriols",
                "suffix": "",
                "affiliation": {},
                "email": ""
            },
            {
                "first": "Rafael",
                "middle": [],
                "last": "Del-Hoyo-Alonso",
                "suffix": "",
                "affiliation": {},
                "email": ""
            },
            {
                "first": "&amp;",
                "middle": [
                    "M Trinidad"
                ],
                "last": "Serrano",
                "suffix": "",
                "affiliation": {
                    "laboratory": "",
                    "institution": "University of Zaragoza",
                    "location": {
                        "settlement": "Zaragoza",
                        "country": "Spain"
                    }
                },
                "email": ""
            },
            {
                "first": "Lozano",
                "middle": [],
                "last": "Blesa",
                "suffix": "",
                "affiliation": {},
                "email": ""
            },
            {
                "first": "San",
                "middle": [
                    "Juan"
                ],
                "last": "Bosco",
                "suffix": "",
                "affiliation": {},
                "email": ""
            },
            {
                "first": "Zaragoza",
                "middle": [],
                "last": "",
                "suffix": "",
                "affiliation": {},
                "email": ""
            },
            {
                "first": "Spain",
                "middle": [],
                "last": "",
                "suffix": "",
                "affiliation": {},
                "email": ""
            },
            {
                "first": "",
                "middle": [],
                "last": "Ciberehd",
                "suffix": "",
                "affiliation": {},
                "email": ""
            },
            {
                "first": "Spain",
                "middle": [],
                "last": "Zaragoza",
                "suffix": "",
                "affiliation": {},
                "email": ""
            },
            {
                "first": "Rafael Del-Hoyo-Alonso",
                "middle": [],
                "last": "",
                "suffix": "",
                "affiliation": {},
                "email": ""
            },
            {
                "first": "M",
                "middle": [],
                "last": "Trinidad",
                "suffix": "",
                "affiliation": {},
                "email": ""
            },
            {
                "first": "Serrano",
                "middle": [],
                "last": "",
                "suffix": "",
                "affiliation": {},
                "email": ""
            }
        ]
    },
    "abstract": [
        {
            "text": "Comparing pandemic waves could aid in understanding the evolution of COVID-19. The objective of the present study was to compare the characteristics and outcomes of patients hospitalized for COVID-19 in different pandemic waves in terms of severity and mortality. We performed an observational retrospective cohort study of 5,220 patients hospitalized with SARS-CoV-2 infection from February to September 2020 in Aragon, Spain. We compared ICU admissions and 30-day mortality, clinical characteristics, and risk factors of the first and second waves of COVID-19. The SARS-CoV-2 genome was also analyzed in 236 samples. Patients in the first wave (n = 2,547) were older (median age 74 years [IQR 60-86] vs. 70 years [53-85]; p < 0.001) and had worse clinical and analytical parameters related to severe COVID-19 than patients in the second wave (n = 2,673). The probability of ICU admission at 30 days was 16% and 10% (p < 0.001) and the cumulative 30-day mortality rates 38% and 32% in the first and second wave, respectively (p = 0.007). Survival differences were observed among patients aged 60 to 80 years. We also found some variability among death risk factors and the viral genome between waves. Therefore, the two analyzed COVID-19 pandemic waves were different in terms of disease severity and mortality.",
            "cite_spans": [],
            "ref_spans": [],
            "section": "Abstract"
        },
        {
            "text": "COVID-19, caused by SARS-CoV-2, is the first major pandemic humankind has faced in over 100 years. Pursuing naturally acquired herd immunity is not a feasible strategy 1 . In contrast to SARS-CoV-1, the transmission of SARS-CoV-2 is expected to resemble that of pandemic influenza, with several pandemic waves, followed by seasonal circulation as may have previously happened with other known coronaviruses 2,3 . We do not yet know how far this virus will continue to be transmitted. The emergence of specific, highly effective vaccines offers hope for the future 4-7 , but only universal vaccination will prevent further outbreaks.",
            "cite_spans": [],
            "ref_spans": [],
            "section": "Abstract"
        },
        {
            "text": "Although there have been different pandemic waves, no extensive studies have analyzed whether the severity and mortality are similar, or whether there are variations depending on the different situations in which they arise.",
            "cite_spans": [],
            "ref_spans": [],
            "section": "Abstract"
        },
        {
            "text": "Aragón is an autonomous Spanish community that experienced the first pandemic wave between February and May 2020. After a period of full lockdown, community transmission of SARS-CoV-2 decreased markedly 8 . After several local outbreaks in June and July, SARS-CoV-2 transmission was widespread, and Aragón had the highest midsummer incidence in the European region 9,10 . Although there are indications that the second wave was less severe than the first 11 , data supporting this hypothesis are scarce. Similarly, although studies have identified risk factors for disease severity 12 , studies comparing the evolution of hospitalized patients in terms of severity and mortality are lacking.",
            "cite_spans": [],
            "ref_spans": [],
            "section": "Abstract"
        },
        {
            "text": "The present study compared the two first different pandemic waves in terms of severity and mortality (ICU admission and death) among hospitalized patients with COVID-19 and analyzed the characteristics of the affected population and risk factors for severity. This knowledge can help us understand the behavior of this disease over time.",
            "cite_spans": [],
            "ref_spans": [],
            "section": "Abstract"
        },
        {
            "text": "Design and setting. This is an observational retrospective cohort study that includes all patients hospitalized with COVID-19 in Aragon, a region in Northeastern Spain that comprises 1,328,753 inhabitants (January 1, 2020) with a highly centralized distribution; 52.7% of the population lives in one city. The publicly funded healthcare system (SALUD) covers the entire population of the region via seven hospitals. Two of these hospitals are university hospitals with more than 700 beds, and the rest are regional hospitals.",
            "cite_spans": [],
            "ref_spans": [],
            "section": "Abstract"
        },
        {
            "text": "The research protocol was approved by the Clinical Research Ethics Committee of Aragon (PI 20/183) according to good clinical practices and applicable laws and regulations. Due to the retrospective, observational nature of this study, the data could be fully anonymized and informed consent was waived. All methods were performed in accordance with the relevant guidelines and regulations.",
            "cite_spans": [],
            "ref_spans": [],
            "section": "Abstract"
        }
    ],
    "body_text": [
        {
            "text": "Patients and data acquisition. Our primary data source was the Aragón Healthcare Records Database, which we accessed through the BIGAN Gestion Clinica platform of the Aragón Department of Health. This database contains demographic and clinical information on all individuals covered by SALUD.",
            "cite_spans": [],
            "ref_spans": [],
            "section": ""
        },
        {
            "text": "COVID-19 diagnosis was confirmed by positive SARS-CoV-2 RT-PCR. Laboratory-confirmed COVID-19-associated hospitalizations were identified using laboratory and electronic medical records databases. Hospitalization was considered chronologically related to COVID-19 when it occurred within the first 20 days after or no more than 10 days before the first positive SARS-CoV-2 PCR test.",
            "cite_spans": [],
            "ref_spans": [],
            "section": ""
        },
        {
            "text": "Data were extracted for a total of 5,220 patients with SARS-CoV-2 infection who were hospitalized in the SALUD hospital network between February 27, 2020, and September 23, 2020.",
            "cite_spans": [],
            "ref_spans": [],
            "section": ""
        },
        {
            "text": "The criteria for admission and hospital management of patients with SARS-Cov-2 infection are based on the recommendations contained in the technical document published by Spanish Ministry of Health. The document includes Covid-19 emergency management and Covid-19 clinical management: hospital care 13 . Each hospital has its own protocol adapting these recommendations to its characteristics. The information is available at the websites for each hospital. The hospitalization and ICU admission criteria, according to these guidelines, have remained stable throughout the pandemic. Ultimately, however, clinical decisions may vary at the discretion of practitioner.",
            "cite_spans": [
                {
                    "start": 299,
                    "end": 301,
                    "text": "13",
                    "ref_id": "BIBREF14"
                }
            ],
            "ref_spans": [],
            "section": ""
        },
        {
            "text": "The beginning and end of each wave was defined based on the variation in SARS-CoV-2 infection incidence observed from February 27 to September 23. We observed two well-defined waves: the first from February 27 to May 27, 2020, and the second from June 17 to September 23, 2020 (Fig. 1) . However, by September 23, the second wave has not fully declined.",
            "cite_spans": [],
            "ref_spans": [
                {
                    "start": 277,
                    "end": 285,
                    "text": "(Fig. 1)",
                    "ref_id": "FIGREF0"
                }
            ],
            "section": ""
        },
        {
            "text": "We collected data on patient demographics, comorbidities, and drugs prescribed in the 6 months prior to hospitalization, Vital signs were recorded upon arrival at the emergency room for all patients, Laboratory variables measured in the first 24 h were available only for the largest two hospitals in the SALUD network, which represented 60.6% of all patients admitted with COVID-19 in the region. The observation period lasted up to 30 days after the last patient was included in the analysis. The main outcomes were admission into the intensive care unit (ICU) and 30-day all-cause mortality after hospital admission.",
            "cite_spans": [],
            "ref_spans": [],
            "section": ""
        },
        {
            "text": "The study followed the Strengthening the Reporting of Observational Studies in Epidemiology (STROBE) guidelines for cohort studies 14 . Statistical analysis. Our study compared four main topics between the two waves: descriptive variables, mortality risk factors, severity and mortality (longitudinal analysis), and the viral genome.",
            "cite_spans": [
                {
                    "start": 131,
                    "end": 135,
                    "text": "14 .",
                    "ref_id": null
                }
            ],
            "ref_spans": [],
            "section": ""
        },
        {
            "text": "Descriptive analysis. We performed a comparative descriptive analysis of the first-and second-wave cohorts stratified by hospitalized, ICU admission, and death. Previously, normality was tested using the Shapiro-Wilk test. As continuous variables failed the normal distribution, they are presented as the median and interquartile range (IQR), and categorical variables are presented as absolute and relative frequencies. Comparisons were performed using the Mann-Whitney test for continuous variables and chi-squared test for categorical variables or proportions.",
            "cite_spans": [],
            "ref_spans": [],
            "section": ""
        },
        {
            "text": "Identification of mortality risk factors. We analyzed univariate logistic regression models to identify predictors of death in each of the subcohorts. To better identify the truly significant predictors in the univariate analysis, not based only on an extensive search, we estimated the adjusted p-values for multiple comparisons using the Holm method 15 .",
            "cite_spans": [
                {
                    "start": 352,
                    "end": 354,
                    "text": "15",
                    "ref_id": "BIBREF16"
                }
            ],
            "ref_spans": [],
            "section": ""
        },
        {
            "text": "Multivariate analysis provides additional information about which of these predictors are independent risk factors. To analyze the difference between waves, we have defined a new dichotomical categorical variable that distinguish between waves. Logistic regression model has been constructed taking as candidates not only the www.nature.com/scientificreports/ predictor variables, but also their interaction with the variable defining the wave Thus, if the interaction term is statistically significant we can affirm that we found differences for this predictor variable between waves. The discriminatory capacities of univariate significant risk factors were evaluated by measuring the area under the receiver operating characteristic (ROC) curve (AUC). Results are expressed as odds ratios (ORs) and p-values.",
            "cite_spans": [],
            "ref_spans": [],
            "section": ""
        },
        {
            "text": "Longitudinal analysis of severity and mortality. Two longitudinal analyses were performed in the cohort of hospitalized patients to evaluate the management of ICU admission and occurrence of death in the two waves. The follow-up time started from the hospitalization date and ended at either the ICU admission date or the discharge/death date. We used cumulative incidence curves to analyze the longitudinal data, and the Gray test to compare variables between waves for groups stratified by sex or age.",
            "cite_spans": [],
            "ref_spans": [],
            "section": ""
        },
        {
            "text": "The threshold p-value was set at 0.05. Analyses were performed using R version 3.6.2 language programming (R Foundation for Statistical Computing, Vienna, Austria) and Python version 3.7 provided by Jupyter (jupyter. org). R statistical software was used mainly for statistical analysis and Python for data retrieval and preparation. Viral genome analysis. Whole genome sequences (> 29,000 bp) of SARS-CoV-2 from Aragon (n = 295) were retrieved from the database established by the global initiative on sharing all influenza data (GISAID). We evaluated how these sequences were distributed among different phylogenetic clades. Sequences were aligned by an iterative refinement method implemented in MAFFT version 7 software 16 and manually edited in Bioedit v7.2.5 17 . The phylogeny of the alignment was inferred with IQ-Tree software v2.1.1 18 , and node support was assessed by an ultrafast bootstrap approximation. The TIM2 substitution model, with unequal base frequencies and a proportion of invariant sites (TIM2 + F + I), was selected as the best-fit model according to the Bayesian information criterion. In Aragón, the prevalence of the D614G mutation was tracked throughout the pandemic by aligning this region in all 295 genomes.",
            "cite_spans": [
                {
                    "start": 765,
                    "end": 767,
                    "text": "17",
                    "ref_id": "BIBREF18"
                }
            ],
            "ref_spans": [],
            "section": ""
        },
        {
            "text": "Descriptive analysis. The patient flowchart is given in Fig. 2 . A total of 2,547 patients were hospitalized with SARS-CoV-2 infection in the first wave and 2,673 in the second wave. Of these patients, 332 (13%) and 198 (7.4%) were admitted to the ICU (p < 0.001), and 779 (30.6%) and 501 (18.7%) died (p < 0.001) during the first and second waves, respectively. The cumulative cases between waves are compared in Fig. 3 .",
            "cite_spans": [],
            "ref_spans": [
                {
                    "start": 56,
                    "end": 62,
                    "text": "Fig. 2",
                    "ref_id": "FIGREF1"
                },
                {
                    "start": 414,
                    "end": 420,
                    "text": "Fig. 3",
                    "ref_id": "FIGREF2"
                }
            ],
            "section": "Results"
        },
        {
            "text": "The age and sex distributions of patients who were hospitalized, admitted to the ICU, or deceased are shown for both waves in Fig. 4 . In both waves, a higher proportion of men were hospitalized with COVID-19 compared to women. This difference increased in the population admitted to the ICU, but not in regards to mortality. p < 0.001) and had more comorbidities, including cerebrovascular disease and dementia, as well as previous pneumonia than patients in the second wave. However, the second wave had a higher frequency of diabetes. In addition, previous drug treatments in hospitalized patients differed between the two pandemic waves.",
            "cite_spans": [],
            "ref_spans": [
                {
                    "start": 126,
                    "end": 132,
                    "text": "Fig. 4",
                    "ref_id": null
                }
            ],
            "section": "Results"
        },
        {
            "text": "Compared to the second wave, patients hospitalized in the first wave showed signs of greater disease severity, including a higher heart rate, higher temperature, lower oxygen saturation, and higher levels of creatinine, www.nature.com/scientificreports/ C-reactive protein, LDH, and fibrinogen (Table 1 ). Other parameters of disease severity, such as neutrophilia and lymphopenia, indicated worse disease in patients infected in the first wave than those infected in the second wave. Among patients admitted to the ICU, those in the first wave were significantly older (70 years [60-76] vs. 62 years [54-72]) and had a higher rate of dementia compared to those admitted to the ICU in the second wave. Patients in the first wave also took antidiabetic drugs less frequently and exhibited higher levels of both clinical and analytical markers of serious illness compared to patients in the second wave (Table 1) .",
            "cite_spans": [],
            "ref_spans": [
                {
                    "start": 294,
                    "end": 302,
                    "text": "(Table 1",
                    "ref_id": null
                },
                {
                    "start": 901,
                    "end": 910,
                    "text": "(Table 1)",
                    "ref_id": null
                }
            ],
            "section": "Results"
        },
        {
            "text": "Unlike patients who were hospitalized or admitted to the ICU, patients who died in the first wave were younger than those who died in the second wave (85 years [77-90] vs. 87 years [81-91]; Table 1 ). Moreover, they were less obese in the first wave than in the second wave. Nevertheless, patients who died in the first wave had greater disease severity parameters than those who died in the second wave.",
            "cite_spans": [],
            "ref_spans": [
                {
                    "start": 190,
                    "end": 197,
                    "text": "Table 1",
                    "ref_id": null
                }
            ],
            "section": "Results"
        },
        {
            "text": "Mortality risk factors. The univariate analysis (Table 2) The multivariate analysis (Table 3) showed that, in both pandemic waves, age (OR = 1.072), elevated temperature (OR = 1. Most of these factors shown no statistically significant between waves, we only found that monocytes (OR = 0.488) and taking potassium sparing (OR = 0.171) diuretics decreased their risk of mortality in the second wave.",
            "cite_spans": [],
            "ref_spans": [
                {
                    "start": 48,
                    "end": 57,
                    "text": "(Table 2)",
                    "ref_id": "TABREF6"
                },
                {
                    "start": 84,
                    "end": 93,
                    "text": "(Table 3)",
                    "ref_id": "TABREF7"
                }
            ],
            "section": "Results"
        },
        {
            "text": "Longitudinal analysis. The cumulative incidence of ICU admission (Fig. 5 ) was significantly different between the two waves (p < 0.001). The probability of ICU admission ranged from 13% at 10 days to 16% at 30 days during the first wave, and from 8% at 10 days to 10% at 30 days during the second wave. Stratifying by sex, the ICU admission probability among men was 16% to 20% during the first wave and 10% to 13% during the second wave (p < 0. 001). The probability of ICU admission was lower among women; it ranged from 10 to 12% during the first wave and from 5 to 7% during the second wave (p < 0.001).",
            "cite_spans": [],
            "ref_spans": [
                {
                    "start": 65,
                    "end": 72,
                    "text": "(Fig. 5",
                    "ref_id": null
                }
            ],
            "section": "Results"
        },
        {
            "text": "When stratified by age, we found that the need for ICU admission was significantly different between waves for the 0-60 years group (p = 0.05), the 60-80 years group (p < 0.001), and the > 80 years group (p < 0.001). For these three age groups, the rates of ICU admission were 13%-19%, 18%-25%, and 5%-7%, respectively, in the first wave, and 10%-15%, 14%-18%, and 1%-2%, respectively, in the second wave.",
            "cite_spans": [],
            "ref_spans": [],
            "section": "Results"
        },
        {
            "text": "Overall survival was significantly different between waves (p = 0.007; Fig. 6 ). The probability of death ranged from 18% at 10 days to 37% at 30 days in the first wave, and from 11% at 10 days to 32% at 30 days in the second wave. In the first wave, mortality was greater for patients with either short or long hospitalizations. For men, mortality ranged from 16 to 38% in the first wave and from 10 to 32% in the second wave (p = 0.02). For women, mortality ranged from 19 to 36% in the first wave and from 11 to 32% in the second wave (p = 0.2). In both waves, mortality was greater among men than among women.",
            "cite_spans": [],
            "ref_spans": [
                {
                    "start": 71,
                    "end": 77,
                    "text": "Fig. 6",
                    "ref_id": null
                }
            ],
            "section": "Results"
        },
        {
            "text": "Mortality increased with age in both waves. However, overall survival was significantly different between waves in the 60-80 year group (p = 0. 02), but not in the 0-60 year or > 80 year groups (p = 0. 20). In the first wave, the probability of death at 10-30 days was 2%-7%, 13%-32%, and 30%-54% for hospitalized patients aged 0-60 years, 60-80 years, and > 80 years, respectively. Notably, the probability of dying was lower in the youngest group than in the two older groups. Remarkably, the probability of death was higher for longer hospitalization periods, particularly among the oldest patients. In the second wave, the probability of death was 1%-5%, 5%-24%, and 21%-48% for the three age groups, respectively. These values were lower than those observed in the first wave, though the trends were similar. Viral genome analysis. We analyzed 236 virus samples from the first wave and 56 from the second wave.",
            "cite_spans": [],
            "ref_spans": [],
            "section": "Results"
        },
        {
            "text": "The distribution of the D614G spike protein mutation was different between waves. It was present in 66% of viruses studied in the first wave and 100% of viruses studied in the second wave. According to the GISAID classification, 32% of the viruses analyzed during the first wave belonged to clades S (characterized by the L84S mutation in the NS8 protein) and V (with the G251V mutation in the NS3 protein), but these virus strains disappeared in the second wave. In contrast, 98.2% of viruses studied in the second wave belonged to clade G (characterized by the D614G spike protein mutation) and 1.8% belonged to clade GR (with the D614G spike protein mutation and the G204R mutation in the nucleocapsid protein).",
            "cite_spans": [],
            "ref_spans": [],
            "section": "Results"
        },
        {
            "text": "Aragon was one of the first regions in Europe to experience the emergence of the second pandemic wave of SARS-CoV-2 infection. This experience allowed early analyses and comparisons of the two waves, which could shed light on the future evolution of the pandemic.",
            "cite_spans": [],
            "ref_spans": [],
            "section": "Discussion"
        },
        {
            "text": "Although the number of hospitalized patients was similar in both waves, we found significant differences in the increase in cases over time. The intensity of the first surge was very difficult for the healthcare system to manage, which led to its collapse or near-collapse. However, that degree of intensity did not occur during the second wave. www.nature.com/scientificreports/ Another difference between the two waves was that the hospitalized patients were younger in the second wave than in the first wave. This difference was probably due to the greater exposure of younger people in the community in the second wave and the greater protection of older people, who were more concerned about the perils of the disease.",
            "cite_spans": [],
            "ref_spans": [],
            "section": "Discussion"
        },
        {
            "text": "Compared to the first wave, the second wave had less marked clinical (high fever) and analytical (lymphopenia, elevated D-dimer) predictors of worse outcomes 19, 20 . Moreover, age-related comorbidities, such as cerebrovascular disease and dementia, were less prevalent in the second wave than in the first wave. Interestingly, diabetes was more prevalent in the second wave.",
            "cite_spans": [
                {
                    "start": 158,
                    "end": 161,
                    "text": "19,",
                    "ref_id": "BIBREF21"
                },
                {
                    "start": 162,
                    "end": 164,
                    "text": "20",
                    "ref_id": "BIBREF22"
                }
            ],
            "ref_spans": [],
            "section": "Discussion"
        },
        {
            "text": "Patients transferred to the ICU had somewhat different characteristics between waves. Compared to the first wave, patients in the second wave were younger and more frequently took antidiabetic drugs. In addition, the frequency of cognitive impairment was lower in the second wave. It is likely that patients with these features were also infected in the first wave but the number was obscured by the larger number of older and seriously ill patients. Older and seriously ill patients were less numerous in the second wave than in the first wave. However, although patients who required hospitalization and ICU care were younger in the second wave than in the first wave, the median age of death was higher in the second wave. www.nature.com/scientificreports/ The most relevant finding in our study was that the overall 30-day mortality of hospitalized patients declined during the second wave. This significant decline in mortality affected essentially all patients aged 60 to 80 years old. A potential cause for this finding was that hospitalized patients had less severe parameters overall in the second wave than in the first wave. These parameters included vital signs and the clinical inflammation markers that serve as prognostic factors for severity [21] [22] [23] . Another explanation for the difference in mortality between waves could be improvements in the clinical management of patients. Although no antiviral drugs have clearly increased survival rates in patients with COVID-19, other advances in the management of patients with more severe infections have been associated with improved outcomes [24] [25] [26] . In addition, unlike the rapid increase observed in the first wave, during the second wave, the number of cases increased gradually. Therefore, although the health system had been overloaded, health resource use increased gradually, which prevented a system collapse. As such, this situation may be associated with better outcomes.",
            "cite_spans": [
                {
                    "start": 1258,
                    "end": 1262,
                    "text": "[21]",
                    "ref_id": "BIBREF23"
                },
                {
                    "start": 1263,
                    "end": 1267,
                    "text": "[22]",
                    "ref_id": "BIBREF24"
                },
                {
                    "start": 1268,
                    "end": 1272,
                    "text": "[23]",
                    "ref_id": "BIBREF25"
                },
                {
                    "start": 1613,
                    "end": 1617,
                    "text": "[24]",
                    "ref_id": "BIBREF26"
                },
                {
                    "start": 1618,
                    "end": 1622,
                    "text": "[25]",
                    "ref_id": "BIBREF27"
                },
                {
                    "start": 1623,
                    "end": 1627,
                    "text": "[26]",
                    "ref_id": "BIBREF28"
                }
            ],
            "ref_spans": [],
            "section": "Discussion"
        },
        {
            "text": "Finally, we could not rule out the possibility that mutations in the virus may have reduced the virulence of SARS-CoV-2. We analyzed viral genomes from the first and second waves and found that the spike 614G mutation, which was abundant only at the end of the first wave, was present in all genomes isolated in the second wave. These findings have been described throughout the country 27 . Initially, this mutation was associated with greater disease severity 28 . However, a recent study indicated that, although the G614 variant is related to greater infectivity and higher viral loads, there is no evidence that it is associated with disease severity 29 .",
            "cite_spans": [
                {
                    "start": 387,
                    "end": 389,
                    "text": "27",
                    "ref_id": "BIBREF29"
                },
                {
                    "start": 462,
                    "end": 464,
                    "text": "28",
                    "ref_id": "BIBREF30"
                },
                {
                    "start": 656,
                    "end": 658,
                    "text": "29",
                    "ref_id": "BIBREF31"
                }
            ],
            "ref_spans": [],
            "section": "Discussion"
        },
        {
            "text": "This study has some limitations. In the first 2 months of the pandemic, there was a significant shortage of diagnostic tests. This situation prevented an overall comparison between pandemic waves. Due to these limitations, we focused the comparison on patients admitted to the hospital. In this environment, there has never been a shortage of diagnostic tests. Other limitations of this study were primarily due to its retrospective nature and the data source (i.e., electronic medical records). Furthermore, this study included data from the entire region, and different hospitals may have employed different management criteria and different resource allocations. However, some of these limitations are compensated for by the high number of patients included.",
            "cite_spans": [],
            "ref_spans": [],
            "section": "Discussion"
        },
        {
            "text": "In conclusion, patients in the first wave have worse clinical characteristics, and consequently the cumulative ICU admission and mortality were higher than those of the second wave. Regarding independent risk factor of mortality, they were similar in both waves, showing only differences in monocytes and potassium diuretics savers variables. Our study show differences between waves in our cohort and we can expect that vaccination also influence in the future for the trajectory of hospitalized patients by COVID-19 infection.",
            "cite_spans": [],
            "ref_spans": [],
            "section": "Discussion"
        }
    ],
    "bib_entries": {
        "BIBREF1": {
            "ref_id": "b1",
            "title": "By sex: purple indicates men, green indicates women. By age: green indicates 0-60 years, red 60-80 years, and blue > 80 years. Solid lines: first wave",
            "authors": [],
            "year": 2020,
            "venue": "Figure 6. Cumulative incidence of death for all patients (top)",
            "volume": "",
            "issn": "",
            "pages": "",
            "other_ids": {}
        },
        "BIBREF2": {
            "ref_id": "b2",
            "title": "COVID-19 herd immunity: where are we?",
            "authors": [
                {
                    "first": "A",
                    "middle": [],
                    "last": "Fontanet",
                    "suffix": ""
                },
                {
                    "first": "S",
                    "middle": [],
                    "last": "Cauchemez",
                    "suffix": ""
                }
            ],
            "year": 2020,
            "venue": "Nat. Rev. Immunol",
            "volume": "20",
            "issn": "10",
            "pages": "583--584",
            "other_ids": {}
        },
        "BIBREF3": {
            "ref_id": "b3",
            "title": "Global seasonality of human seasonal coronaviruses: a clue for postpandemic circulating season of severe acute respiratory syndrome coronavirus 2?",
            "authors": [
                {
                    "first": "Y",
                    "middle": [],
                    "last": "Li",
                    "suffix": ""
                },
                {
                    "first": "X",
                    "middle": [],
                    "last": "Wang",
                    "suffix": ""
                },
                {
                    "first": "H",
                    "middle": [],
                    "last": "Nair",
                    "suffix": ""
                }
            ],
            "year": 2020,
            "venue": "J. Infect. Dis",
            "volume": "222",
            "issn": "7",
            "pages": "1090--1097",
            "other_ids": {}
        },
        "BIBREF4": {
            "ref_id": "b4",
            "title": "Epidemiology of seasonal coronaviruses: establishing the context for the emergence of coronavirus disease 2019",
            "authors": [
                {
                    "first": "S",
                    "middle": [],
                    "last": "Nickbakhsh",
                    "suffix": ""
                }
            ],
            "year": 2020,
            "venue": "J. Infect. Dis",
            "volume": "222",
            "issn": "1",
            "pages": "17--25",
            "other_ids": {}
        },
        "BIBREF5": {
            "ref_id": "b5",
            "title": "Safety and efficacy of the BNT162b2 mRNA Covid-19 vaccine",
            "authors": [
                {
                    "first": "F",
                    "middle": [
                        "P"
                    ],
                    "last": "Polack",
                    "suffix": ""
                }
            ],
            "year": null,
            "venue": "N. Engl. J. Med",
            "volume": "383",
            "issn": "27",
            "pages": "2603--2615",
            "other_ids": {}
        },
        "BIBREF6": {
            "ref_id": "b6",
            "title": "Efficacy and safety of the mRNA-1273 SARS-CoV-2 vaccine",
            "authors": [
                {
                    "first": "L",
                    "middle": [
                        "R"
                    ],
                    "last": "Baden",
                    "suffix": ""
                }
            ],
            "year": 2021,
            "venue": "N. Engl. J. Med",
            "volume": "384",
            "issn": "5",
            "pages": "403--416",
            "other_ids": {}
        },
        "BIBREF7": {
            "ref_id": "b7",
            "title": "Safety and immunogenicity of an rAd26 and rAd5 vector-based heterologous prime-boost COVID-19 vaccine in two formulations: Two open, non-randomised phase 1/2 studies from Russia",
            "authors": [
                {
                    "first": "D",
                    "middle": [
                        "Y"
                    ],
                    "last": "Logunov",
                    "suffix": ""
                }
            ],
            "year": 2020,
            "venue": "Lancet",
            "volume": "396",
            "issn": "",
            "pages": "887--897",
            "other_ids": {}
        },
        "BIBREF8": {
            "ref_id": "b8",
            "title": "Safety and efficacy of the ChAdOx1 nCoV-19 vaccine (AZD1222) against SARS-CoV-2: an interim analysis of four randomised controlled trials in Brazil, South Africa, and the UK",
            "authors": [
                {
                    "first": "M",
                    "middle": [],
                    "last": "Voysey",
                    "suffix": ""
                }
            ],
            "year": 2021,
            "venue": "Lancet",
            "volume": "397",
            "issn": "",
            "pages": "99--111",
            "other_ids": {}
        },
        "BIBREF9": {
            "ref_id": "b9",
            "title": "Evaluation of the lockdowns for the SARS-CoV-2 epidemic in Italy and Spain after one month follow up",
            "authors": [
                {
                    "first": "A",
                    "middle": [],
                    "last": "Tobías",
                    "suffix": ""
                }
            ],
            "year": 2020,
            "venue": "Sci. Total Environ",
            "volume": "725",
            "issn": "",
            "pages": "",
            "other_ids": {}
        },
        "BIBREF10": {
            "ref_id": "b10",
            "title": "COVID-19 outbreaks in a transmission control scenario: challenges posed by social and leisure activities, and for workers in vulnerable conditions, Spain, early summer 2020",
            "authors": [],
            "year": 2020,
            "venue": "Euro Surveill",
            "volume": "25",
            "issn": "35",
            "pages": "",
            "other_ids": {}
        },
        "BIBREF11": {
            "ref_id": "b11",
            "title": "Spain Caught Off Guard by Resurgent Coronavirus-WSJ",
            "authors": [],
            "year": 2020,
            "venue": "",
            "volume": "",
            "issn": "",
            "pages": "",
            "other_ids": {}
        },
        "BIBREF12": {
            "ref_id": "b12",
            "title": "Intensive Care National Audit & Research Centre (ICNARC)",
            "authors": [],
            "year": 2020,
            "venue": "",
            "volume": "",
            "issn": "",
            "pages": "",
            "other_ids": {}
        },
        "BIBREF13": {
            "ref_id": "b13",
            "title": "The first wave of the COVID-19 pandemic in Spain: characterisation of cases and risk factors for severe outcomes",
            "authors": [
                {
                    "first": "L",
                    "middle": [],
                    "last": "Redondo-Bravo",
                    "suffix": ""
                }
            ],
            "year": 2020,
            "venue": "Eur. Surveill",
            "volume": "25",
            "issn": "50",
            "pages": "",
            "other_ids": {}
        },
        "BIBREF14": {
            "ref_id": "b14",
            "title": "Enfermedad por nuevo coronavirus, COVID-19. Recomendaciones para el manejo clínico de los casos",
            "authors": [
                {
                    "first": "",
                    "middle": [],
                    "last": "Ministry",
                    "suffix": ""
                },
                {
                    "first": "",
                    "middle": [],
                    "last": "Health",
                    "suffix": ""
                }
            ],
            "year": 2020,
            "venue": "",
            "volume": "26",
            "issn": "",
            "pages": "",
            "other_ids": {}
        },
        "BIBREF15": {
            "ref_id": "b15",
            "title": "The strengthening the reporting of observational studies in epidemiology (STROBE) statement: guidelines for reporting observational studies",
            "authors": [
                {
                    "first": "Von",
                    "middle": [],
                    "last": "Elm",
                    "suffix": ""
                },
                {
                    "first": "E",
                    "middle": [],
                    "last": "",
                    "suffix": ""
                }
            ],
            "year": 2007,
            "venue": "BMJ",
            "volume": "335",
            "issn": "7624",
            "pages": "806--808",
            "other_ids": {}
        },
        "BIBREF16": {
            "ref_id": "b16",
            "title": "A simple sequentially rejective multiple test procedure. Scand",
            "authors": [
                {
                    "first": "S",
                    "middle": [],
                    "last": "Holm",
                    "suffix": ""
                }
            ],
            "year": 1979,
            "venue": "J. Stat",
            "volume": "6",
            "issn": "",
            "pages": "65--70",
            "other_ids": {}
        },
        "BIBREF17": {
            "ref_id": "b17",
            "title": "MAFFT: A novel method for rapid multiple sequence alignment based on fast Fourier transform",
            "authors": [
                {
                    "first": "K",
                    "middle": [],
                    "last": "Katoh",
                    "suffix": ""
                },
                {
                    "first": "K",
                    "middle": [],
                    "last": "Misawa",
                    "suffix": ""
                },
                {
                    "first": "K",
                    "middle": [
                        "I"
                    ],
                    "last": "Kuma",
                    "suffix": ""
                },
                {
                    "first": "T",
                    "middle": [],
                    "last": "Miyata",
                    "suffix": ""
                }
            ],
            "year": 2002,
            "venue": "Nucleic Acids Res",
            "volume": "30",
            "issn": "14",
            "pages": "3059--3066",
            "other_ids": {}
        },
        "BIBREF18": {
            "ref_id": "b18",
            "title": "BioEdit: A user-friendly biological sequence alignment editor and analysis program for Windows 95/98/NT",
            "authors": [
                {
                    "first": "T",
                    "middle": [
                        "A"
                    ],
                    "last": "Hall",
                    "suffix": ""
                }
            ],
            "year": 1999,
            "venue": "Nucleic Acids Symp. Ser",
            "volume": "41",
            "issn": "",
            "pages": "95--98",
            "other_ids": {}
        },
        "BIBREF19": {
            "ref_id": "b19",
            "title": "IQ-TREE: a fast and effective stochastic algorithm for estimating maximum-likelihood phylogenies",
            "authors": [
                {
                    "first": "L",
                    "middle": [
                        "T"
                    ],
                    "last": "Nguyen",
                    "suffix": ""
                },
                {
                    "first": "H",
                    "middle": [
                        "A"
                    ],
                    "last": "Schmidt",
                    "suffix": ""
                },
                {
                    "first": "A",
                    "middle": [],
                    "last": "Von Haeseler",
                    "suffix": ""
                },
                {
                    "first": "B",
                    "middle": [
                        "Q"
                    ],
                    "last": "Minh",
                    "suffix": ""
                }
            ],
            "year": 2015,
            "venue": "Mol. Biol. Evol",
            "volume": "32",
            "issn": "1",
            "pages": "268--274",
            "other_ids": {}
        },
        "BIBREF21": {
            "ref_id": "b21",
            "title": "Risk factors associated with acute respiratory distress syndrome and death in patients with coronavirus disease 2019 pneumonia in Wuhan, China",
            "authors": [
                {
                    "first": "C",
                    "middle": [],
                    "last": "Wu",
                    "suffix": ""
                }
            ],
            "year": 2020,
            "venue": "JAMA Intern. Med",
            "volume": "180",
            "issn": "7",
            "pages": "934--943",
            "other_ids": {}
        },
        "BIBREF22": {
            "ref_id": "b22",
            "title": "Factors associated with death outcome in patients with severe coronavirus disease-19 (COVID-19): a case-control study",
            "authors": [
                {
                    "first": "F",
                    "middle": [],
                    "last": "Pan",
                    "suffix": ""
                }
            ],
            "year": 2020,
            "venue": "Int. J. Med. Sci",
            "volume": "17",
            "issn": "9",
            "pages": "1281--1292",
            "other_ids": {}
        },
        "BIBREF23": {
            "ref_id": "b23",
            "title": "Age-specific SARS-CoV-2 infection fatality ratio and associated risk factors",
            "authors": [
                {
                    "first": "P",
                    "middle": [],
                    "last": "Poletti",
                    "suffix": ""
                }
            ],
            "year": 2020,
            "venue": "Eur. Surveill",
            "volume": "25",
            "issn": "31",
            "pages": "",
            "other_ids": {}
        },
        "BIBREF24": {
            "ref_id": "b24",
            "title": "Epidemiology, clinical course, and outcomes of critically ill adults with COVID-19 in New York City: A prospective cohort study",
            "authors": [
                {
                    "first": "M",
                    "middle": [
                        "J"
                    ],
                    "last": "Cummings",
                    "suffix": ""
                }
            ],
            "year": 2020,
            "venue": "Lancet",
            "volume": "395",
            "issn": "",
            "pages": "1763--1770",
            "other_ids": {}
        },
        "BIBREF25": {
            "ref_id": "b25",
            "title": "Characteristics and predictors of death among 4035 consecutively hospitalized patients with COVID-19 in Spain",
            "authors": [
                {
                    "first": "J",
                    "middle": [],
                    "last": "Berenguer",
                    "suffix": ""
                }
            ],
            "year": 2020,
            "venue": "Clin. Microbiol. Infect",
            "volume": "26",
            "issn": "11",
            "pages": "1525--1536",
            "other_ids": {}
        },
        "BIBREF26": {
            "ref_id": "b26",
            "title": "The association between treatment with heparin and survival in patients with Covid-19",
            "authors": [
                {
                    "first": "L",
                    "middle": [],
                    "last": "Ayerbe",
                    "suffix": ""
                },
                {
                    "first": "C",
                    "middle": [],
                    "last": "Risco",
                    "suffix": ""
                },
                {
                    "first": "S",
                    "middle": [],
                    "last": "Ayis",
                    "suffix": ""
                }
            ],
            "year": 2020,
            "venue": "J. Thromb. Thrombol",
            "volume": "50",
            "issn": "2",
            "pages": "298--301",
            "other_ids": {}
        },
        "BIBREF27": {
            "ref_id": "b27",
            "title": "Remdesivir for the treatment of Covid-19-Final Report",
            "authors": [
                {
                    "first": "J",
                    "middle": [
                        "H"
                    ],
                    "last": "Beigel",
                    "suffix": ""
                }
            ],
            "year": 2020,
            "venue": "N. Engl. J. Med",
            "volume": "383",
            "issn": "",
            "pages": "1813--1826",
            "other_ids": {}
        },
        "BIBREF28": {
            "ref_id": "b28",
            "title": "Association between administration of systemic corticosteroids and mortality among critically Ill patients with COVID-19: A meta-analysis",
            "authors": [
                {
                    "first": "J",
                    "middle": [
                        "A"
                    ],
                    "last": "Sterne",
                    "suffix": ""
                }
            ],
            "year": 2020,
            "venue": "JAMA",
            "volume": "324",
            "issn": "13",
            "pages": "1330--1341",
            "other_ids": {}
        },
        "BIBREF29": {
            "ref_id": "b29",
            "title": "A founder effect led early SARS-CoV-2 transmission in Spain",
            "authors": [
                {
                    "first": "F",
                    "middle": [],
                    "last": "Díez-Fuertes",
                    "suffix": ""
                }
            ],
            "year": 2021,
            "venue": "J. Virol",
            "volume": "95",
            "issn": "3",
            "pages": "",
            "other_ids": {}
        },
        "BIBREF30": {
            "ref_id": "b30",
            "title": "SARS-CoV-2 viral spike G614 mutation exhibits higher case fatality rate",
            "authors": [
                {
                    "first": "M",
                    "middle": [],
                    "last": "Becerra-Flores",
                    "suffix": ""
                },
                {
                    "first": "T",
                    "middle": [],
                    "last": "Cardozo",
                    "suffix": ""
                }
            ],
            "year": 2020,
            "venue": "Int. J. Clin. Pract",
            "volume": "74",
            "issn": "8",
            "pages": "",
            "other_ids": {}
        },
        "BIBREF31": {
            "ref_id": "b31",
            "title": "Tracking changes in SARS-CoV-2 spike: evidence that D614G increases infectivity of the COVID-19 virus",
            "authors": [
                {
                    "first": "B",
                    "middle": [],
                    "last": "Korber",
                    "suffix": ""
                }
            ],
            "year": 2020,
            "venue": "Cell",
            "volume": "182",
            "issn": "4",
            "pages": "812--827",
            "other_ids": {}
        }
    },
    "ref_entries": {
        "FIGREF0": {
            "text": "Hospitalized patients with positive SARS-Co V-2 RT-PCR test results in both pandemic waves in Aragon, Spain, February-September 2020. Blue: first wave; green: second wave.",
            "latex": null,
            "type": "figure"
        },
        "FIGREF1": {
            "text": "Selection and analysis of study participants in Aragon, Spain, February-September 2020.",
            "latex": null,
            "type": "figure"
        },
        "FIGREF2": {
            "text": "Comparison of cumulative cases between pandemic waves in Aragon, Spain, February-September 2020. Prevalence of SARS-CoV-2 cases confirmed by RT-PCR during the first (purple) and second waves (green) are shown for hospitalized patients (left panel), ICU admissions (middle panel), and deaths (right panel). ICU: intensive care unit.",
            "latex": null,
            "type": "figure"
        },
        "FIGREF3": {
            "text": "3 ) 0.02 (0.01-0.03) 0.02 (0.01-0.03) 0.423 0.02 (0.01-0.03) 0.01 (0.00-0.03) 0.001 0.02 (0.01-0.04) 0.02 (0.01-0.03)",
            "latex": null,
            "type": "figure"
        },
        "FIGREF4": {
            "text": "showed that mortality was best predicted in the first wave by urea (AUC = 0.81), age (AUC = 0.79), D-dimer (AUC = 0.73), and creatinine (AUC = 0.72). The best predictors of mortality in the second wave were age (AUC = 0.82), urea (AUC = 0.77), D-dimer (AUC = 0.71), and lymphocytes (AUC = 0.70).",
            "latex": null,
            "type": "figure"
        },
        "FIGREF5": {
            "text": "300), Urea (OR = 2.982), Potasisum (1.705), LDH (OR = 1.002), monocytes (OR = 2.231) and neutrophils (OR = 1.037) levels, malignancy (OR = 2.952), and taking vasodilators (OR = 3.490), potassium sparing diuretics (OR = 2.315), antipsychotics (OR = 3.247), antidepressants (OR = 1.593), antidementia drugs (OR = 2.125) and nutritional supplements (OR = 2.433) before hospitalization were independent risk factors associated with mortality. Conversely, normal oxygen saturation (OR = 0.949) and platelet levels (OR = 0.990) were protective factors.",
            "latex": null,
            "type": "figure"
        },
        "TABREF2": {
            "text": "Bottom: patients who died. Blue: males; red: females.",
            "latex": null,
            "type": "table"
        },
        "TABREF3": {
            "text": "Table 1. Comparisons of clinical and laboratory variables between the two COVID-19 pandemic waves, Aragon, Spain, February-September 2020. ICU: intensive care unit; IQR: interquartile range; NA: not applicable. Patients were grouped as hospitalized patients (total number of patients), admitted to the ICU, and deceased. Laboratory and clinical variables were baseline values and are presented as the median and interquartile range (IQR). Units are shown in parentheses. Values of sex, comorbidities and previous treatment are displayed as n and the percentage of total patients (%).",
            "latex": null,
            "type": "table"
        },
        "TABREF6": {
            "text": "Univariate analysis of potential predictors of death in the two pandemic waves, Aragon, Spain, February-September, 2020. OR: Odds ratio; CI: confidence interval; n.s.: Not Significant. P value adjusted: adjusted p-values for multiple comparisons using the Holm method.",
            "latex": null,
            "type": "table"
        },
        "TABREF7": {
            "text": "Multivariate analysis of potential predictors of death in the two pandemic waves, Aragon, Spain, February-September, 2020.Figure 5. Cumulative incidence of ICU admissions for all patients (top), patients stratified by sex (middle), and patients stratified by age (bottom) in Aragon, Spain, February-September 2020. By sex: purple indicates men, green indicates women. By age: green indicates 0-60 years, red 60-80 years, and blue > 80 years. Solid lines: first wave; dashed lines: second wave. The p-values corresponds to the Gray test to compare survival curves between waves for groups stratified by sex or age. https://doi.org/10.1038/s41598-021-98308-x",
            "latex": null,
            "type": "table"
        }
    },
    "back_matter": [
        {
            "text": "The clinical and demographic data analyzed were retrieved through the BIGAN Gestion Clinica platform of the Aragón Department of Health, which contains the information from the Aragón Healthcare Records Database. Whole genome sequences of SARS-CoV-2 were retrieved from the database established by the global initiative on sharing all influenza data (GISAID).",
            "cite_spans": [],
            "ref_spans": [],
            "section": "acknowledgement"
        },
        {
            "text": "We are grateful to the authors who originated and presented the sequences in the database EpiCov™ of the GISAID on which this research is based. All data submitters can be contacted directly through www. gisaid. org. We are also grateful to the patients, and to the health care workers for providing excellent medical care at considerable personal risk.",
            "cite_spans": [],
            "ref_spans": [],
            "section": "Acknowledgements"
        },
        {
            "text": "This work has been funded by Instituto de Investigación en Salud (IIS) Aragón and Instituto Tecnológico de Aragón, ITAINNOVA. The funders of the study had no role in study design, data collection, data analysis, data interpretation, or writing of the report. The corresponding author had full access to all the data in the study and had final responsibility for the decision to submit for publication. All authors had complete access to all data in the study and were responsible for the decision to submit for publication.",
            "cite_spans": [],
            "ref_spans": [],
            "section": "Funding"
        },
        {
            "text": "The authors declare no competing interests.",
            "cite_spans": [],
            "ref_spans": [],
            "section": "Competing interests"
        },
        {
            "text": "Correspondence and requests for materials should be addressed to R.A.-G. or J.R.P.-P.",
            "cite_spans": [],
            "ref_spans": [],
            "section": "Additional information"
        },
        {
            "text": "Publisher's note Springer Nature remains neutral with regard to jurisdictional claims in published maps and institutional affiliations.",
            "cite_spans": [],
            "ref_spans": [],
            "section": "Reprints and permissions information is available at www.nature.com/reprints."
        },
        {
            "text": "License, which permits use, sharing, adaptation, distribution and reproduction in any medium or format, as long as you give appropriate credit to the original author(s) and the source, provide a link to the Creative Commons licence, and indicate if changes were made. The images or other third party material in this article are included in the article's Creative Commons licence, unless indicated otherwise in a credit line to the material. If material is not included in the article's Creative Commons licence and your intended use is not permitted by statutory regulation or exceeds the permitted use, you will need to obtain permission directly from the copyright holder. To view a copy of this licence, visit http:// creat iveco mmons. org/ licen ses/ by/4. 0/.",
            "cite_spans": [],
            "ref_spans": [],
            "section": "Open Access This article is licensed under a Creative Commons Attribution 4.0 International"
        }
    ]
}