{
    "paper_id": "0a7c7bb70b34346152c70003a76a84e826064922",
    "metadata": {
        "title": "Impact of the COVID-19 pandemic on unmet healthcare needs in Seoul, South Korea: a cross-sectional study",
        "authors": [
            {
                "first": "Jungah",
                "middle": [],
                "last": "Kim",
                "suffix": "",
                "affiliation": {
                    "laboratory": "",
                    "institution": "The Seoul Institute",
                    "location": {
                        "settlement": "Seoul",
                        "country": "Republic of Korea"
                    }
                },
                "email": ""
            },
            {
                "first": "Myoungsoon",
                "middle": [],
                "last": "You",
                "suffix": "",
                "affiliation": {
                    "laboratory": "",
                    "institution": "Seoul National University",
                    "location": {
                        "settlement": "Seoul",
                        "country": "Republic of Korea"
                    }
                },
                "email": ""
            },
            {
                "first": "Changwoo",
                "middle": [],
                "last": "Shon",
                "suffix": "",
                "affiliation": {
                    "laboratory": "",
                    "institution": "The Seoul Institute",
                    "location": {
                        "settlement": "Seoul",
                        "country": "Republic of Korea"
                    }
                },
                "email": ""
            },
            {
                "first": "Dr",
                "middle": [],
                "last": "Changwoo",
                "suffix": "",
                "affiliation": {},
                "email": ""
            },
            {
                "first": "Shon",
                "middle": [
                    ";"
                ],
                "last": "Cwshon21c@",
                "suffix": "",
                "affiliation": {},
                "email": ""
            }
        ]
    },
    "abstract": [
        {
            "text": "Objectives This study investigated the factors influencing unmet healthcare needs of people during the early stage of the COVID-19 pandemic in Seoul, South Korea. The findings help to identify people who have difficulty accessing healthcare services during a pandemic situation. Design We conducted a cross-sectional study using a proportionate quota sampling method according to five major districts, sex and age, using an online survey. We analysed the key characteristics of influencing factors of unmet healthcare needs based on the Andersen behavioural model of healthcare utilisation: predisposing factors (eg, sex, age), need factors (eg, health status, illness) and enabling factors (eg, income, efficacy belief). Setting The questionnaire was sent via email and mobile text messages from the end of April to the beginning of May 2020 during the first wave of the COVID-19 pandemic. Participants A sample of 813 respondents was used, and the respondent information was anonymised in the analysis process. Results For the predisposing factors, sex, age, education level and occupational cluster were associated with unmet needs for healthcare. Chronic diseases and mental health were the influencing factors as an enabling factor that exerted an influence on the unmet need for healthcare in South Korea. Women, younger persons, those with lower education and persons with white-collar jobs were more likely to experience unmet healthcare needs. In addition, the more chronic diseases people had, the more COVID-19 negatively affected them mentally; and the more people felt fear of COVID-19, the higher chances they experienced unmet healthcare needs. Conclusion Government and policymakers are guided to draw out measures such as health communication and telemedicine to reduce the unmet healthcare needs during the pandemic and to recognise the different influencing factors.",
            "cite_spans": [],
            "ref_spans": [],
            "section": "Abstract"
        }
    ],
    "body_text": [
        {
            "text": "The novel COVID-19 outbreak started from Wuhan, China in late 2019, spreading globally at a dramatically fast rate. The first confirmed COVID-19 case was reported on 20 January 2020 in South Korea. In response to the rapid spread, the Korean government raised the infectious disease crisis emergency steps from 'warning' to 'alert'. The Seoul Metropolitan government commenced a 'Social Distancing Campaign' to contain the spread of the virus. Citizens in Seoul were recommended to avoid physical contact, refrain from going outdoors, maintain personal hygiene and wear a mask in public places. 1 According to previous studies, social distancing measures, such as avoiding visits to crowded places and hospitals, adversely impacted people's daily lives and led to even more negative social consequences and risks. 2 Hospitals are avoided by the general public due to the fear of getting infected, as was evident during the SARS (severe acute respiratory syndrome) pandemic. 2 Such behaviour leads to unmet healthcare needs, also referred to as unmet medical care, that is, when people cannot use healthcare services even if they want to. Unmet medical care causes deteriorating health status, and thus using healthcare services on time is critical. In particular, the experience of unmet medical care can be a serious threat to health for those with chronic diseases that require continuous medical attention.",
            "cite_spans": [
                {
                    "start": 595,
                    "end": 596,
                    "text": "1",
                    "ref_id": "BIBREF0"
                },
                {
                    "start": 814,
                    "end": 815,
                    "text": "2",
                    "ref_id": "BIBREF1"
                },
                {
                    "start": 974,
                    "end": 975,
                    "text": "2",
                    "ref_id": "BIBREF1"
                }
            ],
            "ref_spans": [],
            "section": "BACKGROUND"
        },
        {
            "text": "Most of the studies so far, related to the COVID-19 pandemic, examined the sociodemographic or clinical characteristics of confirmed patients. However, mental health Strengths and limitations of this study ► This study used Andersen's healthcare utilisation model to derive the influencing factors that affect unmet healthcare needs during COVID-19 pandemic. ► The study results can facilitate policy and communication efforts from central and local governments to meet individuals with increasing needs for healthcare service utilisation as the outbreak prolongs. ► The results may be subject to measurement error, as the study was based on self-reported data of respondents via digital data collection methods. ► Since the study selected a cross-sectional design at the beginning of the pandemic, it is important to be careful with interpretation when comparing the results of other studies dealing with unmet healthcare needs during the pandemic.",
            "cite_spans": [],
            "ref_spans": [],
            "section": "BACKGROUND"
        },
        {
            "text": "issues, such as depression and anxiety, or unmet medical care, which get deteriorated during the pandemic, [3] [4] [5] are seldom addressed in the literature. [6] [7] [8] [9] The purpose of this study is to demonstrate the factors influencing unmet healthcare needs during the COVID-19 pandemic in Seoul, South Korea. We aim to identify the people who may fail to use healthcare services and their reasons for doing so. In addition, we develop measures to reduce unmet healthcare needs in an epidemic situation. In this study, the predisposing factors that we examined were sex, age, education level, marital status, children (whether respondents had children) and occupational clusters. The need factors were self-rated health status, the number of chronic diseases, depression and negative impact on mental health (whether respondents' mental health was negatively affected by . Lastly, the enabling factors were income level, decrease in income (ie, whether respondents' overall income decreased after COVID-19), perceived susceptibility and severity related to the COVID-19, efficacy belief to borough, fear, stigma and availability of social support (ie, whether respondents had someone they can seek help from, in case they get infected).",
            "cite_spans": [
                {
                    "start": 107,
                    "end": 110,
                    "text": "[3]",
                    "ref_id": "BIBREF2"
                },
                {
                    "start": 111,
                    "end": 114,
                    "text": "[4]",
                    "ref_id": "BIBREF3"
                },
                {
                    "start": 115,
                    "end": 118,
                    "text": "[5]",
                    "ref_id": "BIBREF4"
                },
                {
                    "start": 159,
                    "end": 162,
                    "text": "[6]",
                    "ref_id": "BIBREF5"
                },
                {
                    "start": 163,
                    "end": 166,
                    "text": "[7]",
                    "ref_id": "BIBREF6"
                },
                {
                    "start": 167,
                    "end": 170,
                    "text": "[8]",
                    "ref_id": "BIBREF7"
                },
                {
                    "start": 171,
                    "end": 174,
                    "text": "[9]",
                    "ref_id": "BIBREF8"
                }
            ],
            "ref_spans": [],
            "section": "Open access"
        },
        {
            "text": "In this study, we selected a cross-sectional survey design to identify the influencing factors on unmet medical care after the COVID-19 pandemic in South Korea. The survey was conducted from the end of April to the beginning of May (28 April-1 May 2020), when the first wave of the COVID-19 pandemic occurred and South Korea experienced a period of high-intensity social distancing. We used a total of 460 000 online panels from a reputable public opinion company called HanKook Research Company. To represent the entire population of Seoul, the survey respondents were selected by the proportionate quota random sampling method according to five major districts, sex and age. The online method for conducting the survey was adopted in consideration of the pandemic. The survey was requested by 3773 people, of which 1007 people participated in the survey, and 813 people completed the survey (completion rate: 80.7%). The survey had a margin of error of plus or minus 3.4%, p value at a 95% confidence level.",
            "cite_spans": [],
            "ref_spans": [],
            "section": "Data collection"
        },
        {
            "text": "The survey Uniform Resource Locator (URL) was sent to participants via email and mobile text message, and it is designed so that survey results cannot be sent if the required items are not answered. In addition, the responses were automatically recorded in the database once completed; the respondent information remained anonymous in the analysis process.",
            "cite_spans": [],
            "ref_spans": [],
            "section": "Data collection"
        },
        {
            "text": "The study examined whether respondents failed to receive medical care services during the COVID-19 pandemic. The dependent variable was unmet healthcare need. We asked questions to determine whether respondents felt they needed healthcare services but did not receive them during the COVID-19 pandemic.",
            "cite_spans": [],
            "ref_spans": [],
            "section": "Dependent variable"
        },
        {
            "text": "The following variables were included in the analysis for predisposing factors: sex (man=0, woman=1), age, education level (high school or below=0, graduate or higher=1), marital status (single=0, married=1), presence of children (none=0, yes=1), occupational cluster (white-collar job=0, blue-collar job or self-employed=1, economically inactive population such as housewife, retired or unemployed people=2). In terms of need factors, the following variables were included: self-rated health (bad=0, good=1), the number of chronic diseases (absence of chronic diseases=0, one chronic disease=1, two or more chronic diseases=2), depression due to COVID-19 (no=0, yes=1), and negative impact on mental health, such as anxiety or stress (whether respondents' mental health was negatively affected by COVID-19 or not). For enabling factors, two factors related to perceived risk were included. Perceived risk refers to an individual's belief of vulnerability to a particular risk. 3 11 Perceived susceptibility refers to beliefs about the likelihood of experiencing an illness, whereas severity refers to beliefs about the seriousness or magnitude of the illness. 3 12 13 The greater the risk an individual perceives, the more motivated he or she is to engage in protective behaviours. 3 We also focused on situational fear related to COVID-19 that had two components. This study defines fear as the feeling that arises when the respondent or someone from the neighbourhood might be infected with the COVID-19, whereas stigma is defined as a respondent's anxiety about getting blamed for spreading the virus. For efficacy belief to borough, respondents were asked whether they agreed to the statements for preparedness, response, and crisis management for the prevention of COVID-19 in their borough, Open access by rating the questions on a 5-point Likert-type scale (with 1=not at all and 5=very much). Respondents were asked whether they agreed to the statements, by rating the questions on a 5-point Likert-type scale (with 1=not at all and 5=very much). We added the scores and categorised them (1=24 or below, 2=24 or more). The following statements were presented as part of the questionnaire: (1) ",
            "cite_spans": [
                {
                    "start": 978,
                    "end": 982,
                    "text": "3 11",
                    "ref_id": null
                },
                {
                    "start": 1161,
                    "end": 1168,
                    "text": "3 12 13",
                    "ref_id": null
                },
                {
                    "start": 1283,
                    "end": 1284,
                    "text": "3",
                    "ref_id": "BIBREF2"
                }
            ],
            "ref_spans": [],
            "section": "Independent variable"
        },
        {
            "text": "We conducted a logistic regression analysis to demonstrate the factors influencing unmet healthcare needs during the COVID-19 pandemic based on Andersen's healthcare utilisation model. 14 After the analysis, OR was calculated and presented with a 95% CI. SAS V.9.4 statistical package program was used for data analysis.",
            "cite_spans": [],
            "ref_spans": [],
            "section": "Statistical analysis"
        },
        {
            "text": "Patients and/or the public were not involved in the design, conduct, reporting or dissemination plans of this study.",
            "cite_spans": [],
            "ref_spans": [],
            "section": "Patient and public involvement"
        },
        {
            "text": "The descriptive statistics of the study sample are presented in table 1. This study involved 813 respondents; men and women were equally represented in the sample. The average age was 46.0 years. In terms of education level, most respondents (79.8%) had the university and above category; 59.2% of respondents were married and 59.4% had children. When examining the occupational cluster, 41.1% of respondents were in the white-collar group, 35.4% in the economically inactive population group, and 23.5% in the blue-collar and self-employed group. Of the total respondents, 52.4% replied that their self-rated health was good, and over 60% did not have chronic diseases. Regarding mental health, 38.6% of respondents reported that they felt they were depressed due to COVID-19, and 46.3% noted that their mental health was negatively affected. In terms of income and income loss, most respondents were in the '$1675>$2512', group, and 45.3% of respondents experienced loss of income after the COVID-19 outbreak. For perceived risk, the average perceived susceptibility score was 2.70 and perceived severity was 3.87. Over 50% of respondents evaluated their efficacy belief in the regional area was low. In respect of fear and stigma to COVID-19, the average scores were 3.56 and 3.27, respectively. Most of the respondents had social support and could ask for help if infected. For healthcare utilisation, 13.4% of respondents failed to receive medical care during the COVID-19 pandemic.",
            "cite_spans": [],
            "ref_spans": [],
            "section": "Descriptive statistics"
        },
        {
            "text": "The logistic regression results are summarised in table 2. Sex was found to be an independent factor associated with unmet healthcare needs (OR=1.83, 95% CI 1.141 to 2.936, p=0.012). Age factor was positively associated with unmet healthcare needs, implying that an increase in the age by 1 year is associated with a 2.5% decrease in unmet healthcare needs. Education level and occupational cluster were also associated with unmet healthcare needs (OR=0.486, 95% CI=0.278 to 0.848, p=0.011; OR=0.532, 95% CI=0.308 to 0.92, p=0.024). The number of chronic diseases had a significant effect on unmet healthcare needs, when compared with the absence; the probability for unmet medical care increased with an increase in the number of chronic diseases (one chronic disease: OR=2.234, 95% CI 1.263 to 3.952, p=0.006; two or more chronic diseases: OR=2.341, 95% CI 1.081 to 5.067, p=0.031). Respondents who were negatively affected due to COVID-19 were more likely to experience unmet healthcare needs compared with those who were not (OR=2.353, 95% CI 1.284 to 4.312, p=0.006). Among enabling factors, fear was the only independent factor significantly associated with unmet healthcare needs, indicating that the probability for unmet healthcare needs increased with increased fear (OR=1.432, 95% CI 1.017 to 2.017, p=0.40).",
            "cite_spans": [],
            "ref_spans": [],
            "section": "Results of the logistic regression analysis"
        },
        {
            "text": "This study presents the first insight into people who may fail to use healthcare services following the COVID-19 pandemic in Seoul, South Korea by investigating the factors influencing healthcare utilisation. Our findings can guide researchers and policymakers to draw out measures to unmet healthcare needs during pandemics.",
            "cite_spans": [],
            "ref_spans": [],
            "section": "DISCUSSION"
        },
        {
            "text": "Women were more likely to experience unmet healthcare needs than men, which was consistent with previous studies in avoidance behaviours during pandemic situations. 2 4 5 15 Women were more vulnerable to psychological distress during an epidemic and showed avoidance behaviour such as, for example, avoiding visiting hospitals due to psychological distress and anxiety about getting infected. During the SARS pandemic, women were more likely to show avoidance behaviours or signs of emotional distress. 15 Our study results showed that as age increased, the rate of unmet medical care decreased. However, the elderly tended to avoid medical services due to the awareness of high risks in the COVID-19 situation. Furthermore, the COVID-19 crisis has revealed discriminatory attitudes toward older people. 16 However, the results of our study Open access may be impacted by the Korean medical culture. Korea has a national health insurance system which covers the entire population. In this context, Korea's medical utilisation volume is known to be the highest in the world. However, due to the situation of high uncertainty during the COVID-19 pandemic, relatively healthy young people Open access may have reduced availing non-essential medical services. Moreover, compared with old people, the unmet medical care of young people was associated with economic reasons or time costs, as they had to work to earn their living. In other words, however, old people suffered a double whammy, as their income is low, despite high demand of medical care. 16 However, the results of our study may be impacted by the Korean medical culture. Korea has a national health insurance system which covers the entire population. In this context, Korea's medical utilisation volume is known to be the highest in the world. However, due to the situation of high uncertainty during the COVID-19 pandemic, relatively healthy young people may have reduced availing non-essential medical services. Moreover, compared with old people, the unmet medical care of young people was associated with economic reasons or time costs, as they had to work to earn their living. In other words, young adults voluntarily underused healthcare services to avoid time cost, and old people passively did so, owing to low income or recommendations for postponement from doctors. Even though unmet medical care occurred in all age groups during the COVID-19 pandemic, it seemed that the extent of underutilisation of healthcare services among young people was greater. ",
            "cite_spans": [
                {
                    "start": 165,
                    "end": 173,
                    "text": "2 4 5 15",
                    "ref_id": null
                },
                {
                    "start": 503,
                    "end": 505,
                    "text": "15",
                    "ref_id": "BIBREF14"
                },
                {
                    "start": 804,
                    "end": 806,
                    "text": "16",
                    "ref_id": "BIBREF15"
                },
                {
                    "start": 1548,
                    "end": 1550,
                    "text": "16",
                    "ref_id": "BIBREF15"
                }
            ],
            "ref_spans": [],
            "section": "DISCUSSION"
        },
        {
            "text": "Additionally, the study results regarding the education level were consistent with previous studies indicating the association between education level and unmet medical care. [17] [18] [19] Cumulative studies indicate that education level has disproportionate influences on healthcare utilisation, where education is generally related to health behaviour or attitudes. 18 19 In other words, people with lower education levels were more likely to experience unmet healthcare needs due to limited knowledge and illiteracy. Illiteracy was especially positively associated with mortality and transmissibility, likely contributing to lower access to medical care as well as decreased awareness and adoption of interventions proposed by public health officials, which increases the risk of infection and poor clinical outcomes. 17 20 Regarding occupational clusters, economically inactive populations, such as homemakers and retired or unemployed people, experienced unmet medical care less frequently than white-collar workers. This is possible since the economically inactive populations had more time to use healthcare services than white-collar people who were unable to go to clinics or hospitals due to time costs.",
            "cite_spans": [
                {
                    "start": 175,
                    "end": 179,
                    "text": "[17]",
                    "ref_id": "BIBREF16"
                },
                {
                    "start": 180,
                    "end": 184,
                    "text": "[18]",
                    "ref_id": "BIBREF17"
                },
                {
                    "start": 185,
                    "end": 189,
                    "text": "[19]",
                    "ref_id": "BIBREF18"
                },
                {
                    "start": 369,
                    "end": 374,
                    "text": "18 19",
                    "ref_id": null
                },
                {
                    "start": 822,
                    "end": 827,
                    "text": "17 20",
                    "ref_id": null
                }
            ],
            "ref_spans": [],
            "section": "Open access"
        },
        {
            "text": "Patients with chronic diseases were more likely to experience unmet medical care than those without, which was consistent with previous studies conducted during pandemics-influenza A (H1N1), SARS and COVID-19. 8 21 22 Further, the COVID-19 pandemic has disrupted the spectrum of cancer care, including delayed diagnoses and treatment together with halting clinical trials in the USA. 23 Chronic patients suffering from cancer and respiratory diseases are more susceptible to viruses due to reduced immune function; clinical health risks, such as admission rate and infection rate, of patient suffering chronic disease increase during pandemics. 8 21 22 The rapid transmission of the virus and limited knowledge about it result in an increase in risk perception, such as depression, distress or anxiety. 24 Due to the increased risk perception, chronic patients may avoid visiting hospitals and prefer to avoid exposure to the disease, contributing to unmet healthcare needs.",
            "cite_spans": [
                {
                    "start": 210,
                    "end": 211,
                    "text": "8",
                    "ref_id": "BIBREF7"
                },
                {
                    "start": 212,
                    "end": 217,
                    "text": "21 22",
                    "ref_id": null
                },
                {
                    "start": 384,
                    "end": 386,
                    "text": "23",
                    "ref_id": "BIBREF22"
                },
                {
                    "start": 645,
                    "end": 646,
                    "text": "8",
                    "ref_id": "BIBREF7"
                },
                {
                    "start": 647,
                    "end": 652,
                    "text": "21 22",
                    "ref_id": null
                },
                {
                    "start": 803,
                    "end": 805,
                    "text": "24",
                    "ref_id": "BIBREF23"
                }
            ],
            "ref_spans": [],
            "section": "Open access"
        },
        {
            "text": "We also found that people whose mental health (such as anxiety or stress) was negatively influenced by the COVID-19 pandemic experienced unmet medical care compared with others. This was also evident during the H1N1 crisis where those who were worried and emotionally distressed due to the outbreak were more likely to adopt avoidance behaviours such as, for example, avoiding outdoors, crowded places and hospitals. 2 Those who were mentally distressed during COVID-19 were more likely to take precautionary measures against the viruses, and so they chose to not receive healthcare services on time.",
            "cite_spans": [
                {
                    "start": 417,
                    "end": 418,
                    "text": "2",
                    "ref_id": "BIBREF1"
                }
            ],
            "ref_spans": [],
            "section": "Open access"
        },
        {
            "text": "A recent publication has emphasised the importance of psychological disaster preparedness 25 during such times.",
            "cite_spans": [],
            "ref_spans": [],
            "section": "Open access"
        },
        {
            "text": "The result of this study regarding the relationship between fear and unmet healthcare needs was consistent with previous studies during SARS, H1N1 pandemic. 2 3 15 People who reported fears about contracting the virus or increase the number of infections nearby were more likely to avoid visiting hospitals due to fear of getting infected. Also, people who were worried about their family members contracting the virus from them were more likely to avoid hospitals. 2 Therefore, people with fear display precautionary behaviour, avoiding hospitals, contributing to unmet medical care.",
            "cite_spans": [
                {
                    "start": 157,
                    "end": 163,
                    "text": "2 3 15",
                    "ref_id": null
                }
            ],
            "ref_spans": [],
            "section": "Open access"
        },
        {
            "text": "In the short term, minimising face-to-face treatment is necessary to reduce exposure to the COVID-19 infection. However, receiving treatment is more beneficial than not receiving treatment. Hence, it is necessary to inform the public, including patients, that facilities for treatment are safe from COVID-19. 26 At the same time, it may be helpful to use a non-face-to-face approach. At present, telemedicine has been banned in principle, except in exceptional circumstances. There is a need to officially allow telemedicine for people with chronic diseases. Initially, it needs to be introduced in a limited way for facilitating medication regimen or for a check-up, following up and consultation. However, as the COVID-19 pandemic is prolonged, proxy prescriptions were temporarily allowed only for persons in self-quarantine and suffering from chronic diseases. It began providing care services using Internet of Things and Artificial Intelligence for the disabled and the elderly in nursing homes not for medical treatment from the end of 2020.",
            "cite_spans": [
                {
                    "start": 309,
                    "end": 311,
                    "text": "26",
                    "ref_id": "BIBREF25"
                }
            ],
            "ref_spans": [],
            "section": "Open access"
        },
        {
            "text": "This study has a few limitations. First, the results of this study were based on self-reported data of respondents, which leaves room for measurement error and selfreported biases. Second, the study used the online panels due to the consideration of the pandemic, this might have caused a selection bias possibility. Third, since the study selected a cross-sectional design at the beginning of the pandemic, it is important to be careful with interpretation when comparing the results of other studies dealing with unmet healthcare needs during the pandemic. Despite the above limitations, this study aimed to demonstrate factors influencing unmet healthcare needs amid the COVID-19 pandemic, and we hope that this study will help countries or researchers grappling with healthcare utilisation amid COVID-19 pandemic situations.",
            "cite_spans": [],
            "ref_spans": [],
            "section": "Open access"
        },
        {
            "text": "We used a total of 460 000 online panels to represent the entire population of Seoul and survey respondents were selected by the proportionate quota random sampling method according to five major districts, sex and age. The online method for conducting the survey was adopted in consideration of the pandemic. The survey was requested by 3773 people, of which 1007 people participated in the survey, and 813 people completed the survey (completion rate: 80.7%). With regard to the socioeconomic characteristics, the study sample represented the characteristics of Seoul well. The survey had a margin of error of plus or minus 3.4%, p value at a 95% confidence level.",
            "cite_spans": [],
            "ref_spans": [],
            "section": "Open access"
        },
        {
            "text": "This study contributes to the existing literature in the following way. We examined the unmet healthcare needs during the COVID-19 pandemic for the entire population of Seoul, the capital of Korea. According to a recent study, older adults were the most severely affected group in Belgium, France, Italy, Spain and the UK, particularly Open access those living in nursing homes. 26 Therefore, future research will be necessary to study unmet healthcare needs for the elderly who are admitted to long-term care facilities in major Asian countries other than Europe.",
            "cite_spans": [
                {
                    "start": 379,
                    "end": 381,
                    "text": "26",
                    "ref_id": "BIBREF25"
                }
            ],
            "ref_spans": [],
            "section": "Open access"
        },
        {
            "text": "Contributors JK, MY and CS contributed to the study design. MY and CS designed the survey instruments. JK oversaw data collection. JK and CS developed the research hypothesis, analysed the data and drafted research. All authors contributed to drafting the report. CS approved the protocols to be followed in the study. All authors were involved in the manuscript review, revision and final approval process.",
            "cite_spans": [],
            "ref_spans": [],
            "section": "Open access"
        },
        {
            "text": "Funding The authors have not declared a specific grant for this research from any funding agency in the public, commercial or not-for-profit sectors.",
            "cite_spans": [],
            "ref_spans": [],
            "section": "Open access"
        },
        {
            "text": "Competing interests None declared.",
            "cite_spans": [],
            "ref_spans": [],
            "section": "Open access"
        },
        {
            "text": "Patient and public involvement Patients and/or the public were not involved in the design, or conduct, or reporting, or dissemination plans of this research. Refer to the Methods section for further details.",
            "cite_spans": [],
            "ref_spans": [],
            "section": "Open access"
        },
        {
            "text": "Patient consent for publication Not required.",
            "cite_spans": [],
            "ref_spans": [],
            "section": "Open access"
        },
        {
            "text": "Ethics approval The survey was approved by the Seoul Medical Center Institutional Review Board (IRB No. 2020-04-005). Before the start of the survey, online informed consent was obtained for personal information and use of the survey results; the data were stored in an external hard drive.",
            "cite_spans": [],
            "ref_spans": [],
            "section": "Open access"
        },
        {
            "text": "Provenance and peer review Not commissioned; externally peer reviewed.",
            "cite_spans": [],
            "ref_spans": [],
            "section": "Open access"
        },
        {
            "text": "Data availability statement Data not available due to ethical/legal restrictions.",
            "cite_spans": [],
            "ref_spans": [],
            "section": "Open access"
        },
        {
            "text": "Open access This is an open access article distributed in accordance with the Creative Commons Attribution Non Commercial (CC BY-NC 4.0) license, which permits others to distribute, remix, adapt, build upon this work non-commercially, and license their derivative works on different terms, provided the original work is properly cited, appropriate credit is given, any changes made indicated, and the use is non-commercial. See: http:// creativecommons. org/ licenses/ by-nc/ 4. 0/.",
            "cite_spans": [],
            "ref_spans": [],
            "section": "Open access"
        },
        {
            "text": "Jungah Kim http:// orcid. org/ 0000-0003-4114-4839 Changwoo Shon http:// orcid. org/ 0000-0002-7440-3203",
            "cite_spans": [],
            "ref_spans": [],
            "section": "ORCID iDs"
        }
    ],
    "bib_entries": {
        "BIBREF0": {
            "ref_id": "b0",
            "title": "Hold up! Let's Take a Break from Social Life",
            "authors": [],
            "year": null,
            "venue": "",
            "volume": "",
            "issn": "",
            "pages": "",
            "other_ids": {}
        },
        "BIBREF1": {
            "ref_id": "b1",
            "title": "Avoidance behaviors and negative psychological responses in the general population in the initial stage of the H1N1 pandemic in Hong Kong",
            "authors": [
                {
                    "first": "Jtf",
                    "middle": [],
                    "last": "Lau",
                    "suffix": ""
                },
                {
                    "first": "S",
                    "middle": [],
                    "last": "Griffiths",
                    "suffix": ""
                },
                {
                    "first": "K",
                    "middle": [
                        "C"
                    ],
                    "last": "Choi",
                    "suffix": ""
                }
            ],
            "year": 2010,
            "venue": "BMC Infect Dis",
            "volume": "10",
            "issn": "",
            "pages": "",
            "other_ids": {
                "DOI": [
                    "10.1186/1471-2334-10-139"
                ]
            }
        },
        "BIBREF2": {
            "ref_id": "b2",
            "title": "Psychological and behavioral responses in South Korea during the early stages of coronavirus disease 2019 (COVID-19)",
            "authors": [
                {
                    "first": "M",
                    "middle": [],
                    "last": "Lee",
                    "suffix": ""
                },
                {
                    "first": "M",
                    "middle": [],
                    "last": "You",
                    "suffix": ""
                }
            ],
            "year": 2020,
            "venue": "Int J Environ Res Public Health",
            "volume": "17",
            "issn": "",
            "pages": "",
            "other_ids": {
                "DOI": [
                    "10.3390/ijerph17092977"
                ]
            }
        },
        "BIBREF3": {
            "ref_id": "b3",
            "title": "A nationwide survey of psychological distress among Italian people during the COVID-19 pandemic: immediate psychological responses and associated factors",
            "authors": [
                {
                    "first": "C",
                    "middle": [],
                    "last": "Mazza",
                    "suffix": ""
                },
                {
                    "first": "E",
                    "middle": [],
                    "last": "Ricci",
                    "suffix": ""
                },
                {
                    "first": "S",
                    "middle": [],
                    "last": "Biondi",
                    "suffix": ""
                }
            ],
            "year": 2020,
            "venue": "Int J Environ Res Public Health",
            "volume": "17",
            "issn": "",
            "pages": "",
            "other_ids": {
                "DOI": [
                    "10.3390/ijerph17093165"
                ]
            }
        },
        "BIBREF4": {
            "ref_id": "b4",
            "title": "Immediate psychological responses and associated factors during the initial stage of the 2019 coronavirus disease (COVID-19) epidemic among the general population in China",
            "authors": [
                {
                    "first": "C",
                    "middle": [],
                    "last": "Wang",
                    "suffix": ""
                },
                {
                    "first": "R",
                    "middle": [],
                    "last": "Pan",
                    "suffix": ""
                },
                {
                    "first": "X",
                    "middle": [],
                    "last": "Wan",
                    "suffix": ""
                }
            ],
            "year": 2020,
            "venue": "Int J Environ Res Public Health",
            "volume": "17",
            "issn": "",
            "pages": "",
            "other_ids": {
                "DOI": [
                    "10.3390/ijerph17051729"
                ]
            }
        },
        "BIBREF5": {
            "ref_id": "b5",
            "title": "Changes in healthcare utilization, spending, and perceived health during COVID-19: a longitudinal study from Singapore",
            "authors": [
                {
                    "first": "S",
                    "middle": [],
                    "last": "Ahn",
                    "suffix": ""
                },
                {
                    "first": "S",
                    "middle": [],
                    "last": "Kim",
                    "suffix": ""
                },
                {
                    "first": "K",
                    "middle": [],
                    "last": "Koh",
                    "suffix": ""
                }
            ],
            "year": 2020,
            "venue": "",
            "volume": "",
            "issn": "",
            "pages": "",
            "other_ids": {}
        },
        "BIBREF6": {
            "ref_id": "b6",
            "title": "Decreased utilization of mental health emergency service during the COVID-19 pandemic",
            "authors": [
                {
                    "first": "C",
                    "middle": [],
                    "last": "Hoyer",
                    "suffix": ""
                },
                {
                    "first": "A",
                    "middle": [],
                    "last": "Ebert",
                    "suffix": ""
                },
                {
                    "first": "K",
                    "middle": [],
                    "last": "Szabo",
                    "suffix": ""
                }
            ],
            "year": 2021,
            "venue": "Eur Arch Psychiatry Clin Neurosci",
            "volume": "271",
            "issn": "",
            "pages": "377--386",
            "other_ids": {
                "DOI": [
                    "10.1007/s00406-020-01151-w"
                ]
            }
        },
        "BIBREF7": {
            "ref_id": "b7",
            "title": "Healthcare utilization among breast cancer patients during the COVID-19 outbreak",
            "authors": [
                {
                    "first": "S",
                    "middle": [],
                    "last": "Shinan-Altman",
                    "suffix": ""
                },
                {
                    "first": "I",
                    "middle": [],
                    "last": "Levkovich",
                    "suffix": ""
                },
                {
                    "first": "G",
                    "middle": [],
                    "last": "Tavori",
                    "suffix": ""
                }
            ],
            "year": 2020,
            "venue": "Palliat Support Care",
            "volume": "18",
            "issn": "",
            "pages": "385--91",
            "other_ids": {
                "DOI": [
                    "10.1017/S1478951520000516"
                ]
            }
        },
        "BIBREF8": {
            "ref_id": "b8",
            "title": "Impact of the COVID-19 pandemic on patients suffering from musculoskeletal tumours",
            "authors": [
                {
                    "first": "M",
                    "middle": [],
                    "last": "Thaler",
                    "suffix": ""
                },
                {
                    "first": "I",
                    "middle": [],
                    "last": "Khosravi",
                    "suffix": ""
                },
                {
                    "first": "A",
                    "middle": [],
                    "last": "Leithner",
                    "suffix": ""
                }
            ],
            "year": 2020,
            "venue": "Int Orthop",
            "volume": "44",
            "issn": "",
            "pages": "1503--1512",
            "other_ids": {
                "DOI": [
                    "10.1007/s00264-020-04636-4"
                ]
            }
        },
        "BIBREF9": {
            "ref_id": "b9",
            "title": "Revisiting the behavioral model and access to medical care: does it matter?",
            "authors": [
                {
                    "first": "R",
                    "middle": [
                        "M"
                    ],
                    "last": "Andersen",
                    "suffix": ""
                }
            ],
            "year": 1995,
            "venue": "J Health Soc Behav",
            "volume": "36",
            "issn": "",
            "pages": "1--10",
            "other_ids": {
                "DOI": [
                    "10.2307/2137284"
                ]
            }
        },
        "BIBREF10": {
            "ref_id": "b10",
            "title": "Perception of risk",
            "authors": [
                {
                    "first": "P",
                    "middle": [],
                    "last": "Slovic",
                    "suffix": ""
                }
            ],
            "year": 1987,
            "venue": "Science",
            "volume": "236",
            "issn": "",
            "pages": "280--285",
            "other_ids": {
                "DOI": [
                    "10.1126/science.3563507"
                ]
            }
        },
        "BIBREF11": {
            "ref_id": "b11",
            "title": "Perceived risk and efficacy beliefs as motivators of change: use of the risk perception attitude (RPA) framework to understand health behaviors",
            "authors": [
                {
                    "first": "R",
                    "middle": [
                        "N"
                    ],
                    "last": "Rimal",
                    "suffix": ""
                },
                {
                    "first": "K",
                    "middle": [],
                    "last": "Real",
                    "suffix": ""
                }
            ],
            "year": 2003,
            "venue": "Hum Commun Res",
            "volume": "29",
            "issn": "",
            "pages": "370--99",
            "other_ids": {}
        },
        "BIBREF12": {
            "ref_id": "b12",
            "title": "Putting the fear back into fear appeals: the extended parallel process model",
            "authors": [
                {
                    "first": "K",
                    "middle": [],
                    "last": "Witte",
                    "suffix": ""
                }
            ],
            "year": 1992,
            "venue": "Commun Monogr",
            "volume": "59",
            "issn": "",
            "pages": "329--378",
            "other_ids": {
                "DOI": [
                    "10.1080/03637759209376276"
                ]
            }
        },
        "BIBREF13": {
            "ref_id": "b13",
            "title": "Societal and individual determinants of medical care utilization in the United States",
            "authors": [
                {
                    "first": "R",
                    "middle": [],
                    "last": "Andersen",
                    "suffix": ""
                },
                {
                    "first": "J",
                    "middle": [
                        "F"
                    ],
                    "last": "Newman",
                    "suffix": ""
                }
            ],
            "year": 1973,
            "venue": "The Milbank Memorial fund Quarterly. Health and Society",
            "volume": "",
            "issn": "",
            "pages": "95--124",
            "other_ids": {}
        },
        "BIBREF14": {
            "ref_id": "b14",
            "title": "SARS-related perceptions in Hong Kong",
            "authors": [
                {
                    "first": "Jtf",
                    "middle": [],
                    "last": "Lau",
                    "suffix": ""
                },
                {
                    "first": "X",
                    "middle": [],
                    "last": "Yang",
                    "suffix": ""
                },
                {
                    "first": "E",
                    "middle": [],
                    "last": "Pang",
                    "suffix": ""
                }
            ],
            "year": 2005,
            "venue": "Emerg Infect Dis",
            "volume": "11",
            "issn": "",
            "pages": "",
            "other_ids": {
                "DOI": [
                    "10.3201/eid1103.040675"
                ]
            }
        },
        "BIBREF15": {
            "ref_id": "b15",
            "title": "Not only virus spread: the diffusion of ageism during the outbreak of COVID-19",
            "authors": [
                {
                    "first": "F",
                    "middle": [],
                    "last": "Previtali",
                    "suffix": ""
                },
                {
                    "first": "L",
                    "middle": [
                        "D"
                    ],
                    "last": "Allen",
                    "suffix": ""
                },
                {
                    "first": "M",
                    "middle": [],
                    "last": "Varlamova",
                    "suffix": ""
                }
            ],
            "year": 2020,
            "venue": "J Aging Soc Policy",
            "volume": "32",
            "issn": "",
            "pages": "506--520",
            "other_ids": {
                "DOI": [
                    "10.1080/08959420.2020.1772002"
                ]
            }
        },
        "BIBREF16": {
            "ref_id": "b16",
            "title": "Disparities in influenza mortality and transmission related to sociodemographic factors within Chicago in the pandemic of 1918",
            "authors": [
                {
                    "first": "K",
                    "middle": [
                        "H"
                    ],
                    "last": "Grantz",
                    "suffix": ""
                },
                {
                    "first": "M",
                    "middle": [
                        "S"
                    ],
                    "last": "Rane",
                    "suffix": ""
                },
                {
                    "first": "H",
                    "middle": [],
                    "last": "Salje",
                    "suffix": ""
                }
            ],
            "year": 2016,
            "venue": "Proc Natl Acad Sci U S A",
            "volume": "113",
            "issn": "",
            "pages": "13839--13883",
            "other_ids": {
                "DOI": [
                    "10.1073/pnas.1612838113"
                ]
            }
        },
        "BIBREF17": {
            "ref_id": "b17",
            "title": "A study of factors in unmet medical need and equity. Unpublished master's thesis",
            "authors": [
                {
                    "first": "J",
                    "middle": [],
                    "last": "Kim",
                    "suffix": ""
                }
            ],
            "year": 2012,
            "venue": "",
            "volume": "",
            "issn": "",
            "pages": "",
            "other_ids": {}
        },
        "BIBREF18": {
            "ref_id": "b18",
            "title": "Pathways between socioeconomic determinants of health",
            "authors": [
                {
                    "first": "E",
                    "middle": [],
                    "last": "Lahelma",
                    "suffix": ""
                },
                {
                    "first": "P",
                    "middle": [],
                    "last": "Martikainen",
                    "suffix": ""
                },
                {
                    "first": "M",
                    "middle": [],
                    "last": "Laaksonen",
                    "suffix": ""
                }
            ],
            "year": 2004,
            "venue": "J Epidemiol Community Health",
            "volume": "58",
            "issn": "",
            "pages": "327--359",
            "other_ids": {
                "DOI": [
                    "10.1136/jech.2003.011148"
                ]
            }
        },
        "BIBREF19": {
            "ref_id": "b19",
            "title": "Literacy and health status in developing countries",
            "authors": [
                {
                    "first": "R",
                    "middle": [
                        "N"
                    ],
                    "last": "Grosse",
                    "suffix": ""
                },
                {
                    "first": "C",
                    "middle": [],
                    "last": "Auffrey",
                    "suffix": ""
                }
            ],
            "year": 1989,
            "venue": "Annu Rev Public Health",
            "volume": "10",
            "issn": "",
            "pages": "281--97",
            "other_ids": {
                "DOI": [
                    "10.1146/annurev.pu.10.050189.001433"
                ]
            }
        },
        "BIBREF20": {
            "ref_id": "b20",
            "title": "Diabetes and the severity of pandemic influenza A (H1N1) infection",
            "authors": [
                {
                    "first": "R",
                    "middle": [],
                    "last": "Allard",
                    "suffix": ""
                },
                {
                    "first": "P",
                    "middle": [],
                    "last": "Leclerc",
                    "suffix": ""
                },
                {
                    "first": "C",
                    "middle": [],
                    "last": "Tremblay",
                    "suffix": ""
                }
            ],
            "year": 2010,
            "venue": "Diabetes Care",
            "volume": "33",
            "issn": "",
            "pages": "1491--1494",
            "other_ids": {
                "DOI": [
                    "10.2337/dc09-2215"
                ]
            }
        },
        "BIBREF21": {
            "ref_id": "b21",
            "title": "The correlation of comorbidities on the mortality in patients with COVID-19: an observational study based on the Korean National health insurance big data",
            "authors": [
                {
                    "first": "D",
                    "middle": [
                        "W"
                    ],
                    "last": "Kim",
                    "suffix": ""
                },
                {
                    "first": "K",
                    "middle": [
                        "H"
                    ],
                    "last": "Byeon",
                    "suffix": ""
                },
                {
                    "first": "J",
                    "middle": [],
                    "last": "Kim",
                    "suffix": ""
                }
            ],
            "year": 2020,
            "venue": "J Korean Med Sci",
            "volume": "35",
            "issn": "",
            "pages": "",
            "other_ids": {
                "DOI": [
                    "10.3346/jkms.2020.35.e243"
                ]
            }
        },
        "BIBREF22": {
            "ref_id": "b22",
            "title": "Impact of SARS on healthcare utilization by disease categories: implications for delivery of healthcare services",
            "authors": [
                {
                    "first": "T-H",
                    "middle": [],
                    "last": "Lu",
                    "suffix": ""
                },
                {
                    "first": "Y-J",
                    "middle": [],
                    "last": "Chou",
                    "suffix": ""
                },
                {
                    "first": "C-S",
                    "middle": [],
                    "last": "Liou",
                    "suffix": ""
                }
            ],
            "year": 2007,
            "venue": "Health Policy",
            "volume": "83",
            "issn": "",
            "pages": "375--81",
            "other_ids": {
                "DOI": [
                    "10.1016/j.healthpol.2007.03.001"
                ]
            }
        },
        "BIBREF23": {
            "ref_id": "b23",
            "title": "The impact of the COVID-19 pandemic on cancer care",
            "authors": [
                {
                    "first": "M",
                    "middle": [],
                    "last": "Richards",
                    "suffix": ""
                },
                {
                    "first": "M",
                    "middle": [],
                    "last": "Anderson",
                    "suffix": ""
                },
                {
                    "first": "P",
                    "middle": [],
                    "last": "Carter",
                    "suffix": ""
                }
            ],
            "year": 2020,
            "venue": "Nat Cancer",
            "volume": "1",
            "issn": "",
            "pages": "565--572",
            "other_ids": {
                "DOI": [
                    "10.1038/s43018-020-0074-y"
                ]
            }
        },
        "BIBREF24": {
            "ref_id": "b24",
            "title": "COVID-19 and psychological disaster preparedness -an unmet need",
            "authors": [
                {
                    "first": "V",
                    "middle": [],
                    "last": "Agarwal",
                    "suffix": ""
                },
                {
                    "first": "S",
                    "middle": [],
                    "last": "Sharma",
                    "suffix": ""
                },
                {
                    "first": "L",
                    "middle": [],
                    "last": "Gupta",
                    "suffix": ""
                }
            ],
            "year": 2020,
            "venue": "Disaster Med Public Health Prep",
            "volume": "14",
            "issn": "",
            "pages": "387--90",
            "other_ids": {
                "DOI": [
                    "10.1017/dmp.2020.219"
                ]
            }
        },
        "BIBREF25": {
            "ref_id": "b25",
            "title": "Unmet needs, health policies, and actions during the COVID-19 pandemic: a report from six European countries",
            "authors": [
                {
                    "first": "O",
                    "middle": [],
                    "last": "Miralles",
                    "suffix": ""
                },
                {
                    "first": "D",
                    "middle": [],
                    "last": "Sanchez-Rodriguez",
                    "suffix": ""
                },
                {
                    "first": "E",
                    "middle": [],
                    "last": "Marco",
                    "suffix": ""
                }
            ],
            "year": 2021,
            "venue": "Eur Geriatr Med",
            "volume": "12",
            "issn": "",
            "pages": "193--204",
            "other_ids": {
                "DOI": [
                    "10.1007/s41999-020-00415-x"
                ]
            }
        }
    },
    "ref_entries": {
        "FIGREF0": {
            "text": "People in my borough take precautionary measures to prevent spread of the COVID-19 virus. (2) People in my borough are willing to be inconvenienced, and can adopt measures such as self-quarantine, if necessary. (3) Community facilities such as nursing homes and educational facilities in my borough are well prepared for infection risk factors. (4) If someone in my borough is infected with the COVID-19 virus, they will receive medical treatment. (5) The head of my borough or the head of a health centre is able to lead the coping strategies for the COVID-19 pandemic. (6) My borough will overcome the crisis and have resilience even if there is any other damage due to COVID-19 pandemic in our area.",
            "latex": null,
            "type": "figure"
        },
        "TABREF0": {
            "text": "and health belief and attitudes. The need factors are directly related to healthcare utilisation and consist of individuals' health status, illness and disability.10 Lastly, the enabling factors are those that allow individuals to use healthcare services such as family and community resources; income, type of health insurance and the number of hospitals in the community are examples of enabling factors.",
            "latex": null,
            "type": "table"
        },
        "TABREF1": {
            "text": "Descriptive statistics of the data",
            "latex": null,
            "type": "table"
        },
        "TABREF2": {
            "text": "Logistic regression results for the impact of the COVID-19 pandemic on unmet healthcare needs",
            "latex": null,
            "type": "table"
        }
    },
    "back_matter": []
}