{
    "paper_id": "0a7eb41beabc52190835ad19a6400d1c30625de7",
    "metadata": {
        "title": "Four-factor prothrombin complex concentrate to reduce allogenic blood product transfusion in patients with major trauma, the PROCOAG trial: study protocol for a randomized multicenter double-blind superiority study",
        "authors": [
            {
                "first": "Pierre",
                "middle": [],
                "last": "Bouzat",
                "suffix": "",
                "affiliation": {
                    "laboratory": "on behalf of the PROCOAG study group",
                    "institution": "",
                    "location": {}
                },
                "email": ""
            },
            {
                "first": "Jean-Luc",
                "middle": [],
                "last": "Bosson",
                "suffix": "",
                "affiliation": {
                    "laboratory": "on behalf of the PROCOAG study group",
                    "institution": "",
                    "location": {}
                },
                "email": ""
            },
            {
                "first": "Jean-Stéphane",
                "middle": [],
                "last": "David",
                "suffix": "",
                "affiliation": {
                    "laboratory": "on behalf of the PROCOAG study group",
                    "institution": "",
                    "location": {}
                },
                "email": ""
            },
            {
                "first": "Bruno",
                "middle": [],
                "last": "Riou",
                "suffix": "",
                "affiliation": {
                    "laboratory": "on behalf of the PROCOAG study group",
                    "institution": "",
                    "location": {}
                },
                "email": ""
            },
            {
                "first": "Jacques",
                "middle": [],
                "last": "Duranteau",
                "suffix": "",
                "affiliation": {
                    "laboratory": "on behalf of the PROCOAG study group",
                    "institution": "",
                    "location": {}
                },
                "email": ""
            },
            {
                "first": "Jean-François",
                "middle": [],
                "last": "Payen",
                "suffix": "",
                "affiliation": {
                    "laboratory": "on behalf of the PROCOAG study group",
                    "institution": "",
                    "location": {}
                },
                "email": ""
            }
        ]
    },
    "abstract": [
        {
            "text": "Background: Optimal management of severe trauma patients with active hemorrhage relies on adequate initial resuscitation. Early administration of coagulation factors improves post-traumatic coagulation disorders, and fourfactor prothrombin complex concentrate (PCC) might be useful in this context. Our main hypothesis is that fourfactor PCC in addition to a massive transfusion protocol decreases blood product consumption at day 1 in severe trauma patients with major bleeding. Methods: This is a prospective, randomized, multicenter, double-blind, parallel, controlled superiority trial. Eligible patients are trauma patients with major bleeding admitted to a French level-I trauma center. Patients randomized in the treatment arm receive 1 mL/kg (25 IU/ml of Factor IX/Kg) four-factor PCC within 1-h post-admission while patients randomized in the controlled group receive 1 mL/kg of saline solution 0.9% as a placebo. Treatments are given as soon as possible using syringe pumps (120 mL/h). The primary endpoint is the amount of blood products transfused in the first 24 h post-admission (including red blood cells, frozen fresh plasma, and platelets). The secondary endpoints are the amount of each blood product transfused in the first 24 h, time to achieve prothrombin time ratio < 1.5, time to hemostasis, number of thrombo-embolic events at 28 days, mortality at 24 h and 28 days, number of intensive care unit-free days, number of ventilator-free days, number of hospital-free days within the first 28 days, hospitalization status at day 28, Glasgow outcome scale extended for patients with brain lesions on initial cerebral imaging, and cost of each strategy at days 8 and 28. Inclusions have started in December 2017 and are expected to be complete by June 2021.",
            "cite_spans": [],
            "ref_spans": [],
            "section": "Abstract"
        },
        {
            "text": "Discussion: If PCC reduces total blood consumption at day 1 after severe trauma, this therapy, in adjunction to a classic massive transfusion protocol, may be used empirically on admission in patients at risk of massive transfusion to enhance coagulation. Moreover, this treatment may decrease blood product-related complications and may improve clinical outcomes after post-traumatic hemorrhage.",
            "cite_spans": [],
            "ref_spans": [],
            "section": "Abstract"
        },
        {
            "text": "The order of the items has been modified to group similar items (see http://www.equator-network.org/ reporting-guidelines/spirit-2013-statement-definingstandard-protocol-items-for-clinical-trials/).",
            "cite_spans": [],
            "ref_spans": [],
            "section": "Abstract"
        },
        {
            "text": "Four-factor prothrombin complex concentrate to reduce allogenic blood product transfusion in patients with major trauma, the PROCOAG trial: study protocol for a randomized multicenter double-blind superiority study. Trial registration {2a and 2b}. Name and contact information for the trial sponsor {5b} French Ministry of Health, GIRCI AURA, 3 Quai des Célestins, 69002 Lyon, France. PHRCI 2015, n°15-059 Role of sponsor {5c} Funders have no role in trial design, conduction, data collection, nor analysis. Kanokad® safety aggregated data are shared with LFB.",
            "cite_spans": [],
            "ref_spans": [],
            "section": "Abstract"
        }
    ],
    "body_text": [
        {
            "text": "Severe trauma is the leading cause of mortality in young adults in developed countries and is the third cause of overall death in the USA [1] . Death occurs within the first 48 h among 87% of trauma patients with fatal outcome, and the first cause of death at 24 h is massive bleeding [2, 3] . Hemorrhagic shock is preventable with adequate strategies including early control of the active source of bleeding and an optimization of initial resuscitation called \"damage control resuscitation\" [4] . The concept of damage control resuscitation consists of a combination of early administration of blood products, control of post-traumatic coagulopathy, and a reduction of crystalloid infusion and maintaining permissive hypotension. This strategy aims at treating hypovolemia and coagulation disorders while avoiding dilution coagulopathy [4] . International guidelines for blood product administration recommend the transfusion of packed red blood cell (RBC) and fresh frozen plasma (FFP) as soon as possible with RBC/FFP ratio between 1:1 and 2: 1 [5, 6] .",
            "cite_spans": [
                {
                    "start": 138,
                    "end": 141,
                    "text": "[1]",
                    "ref_id": "BIBREF0"
                },
                {
                    "start": 285,
                    "end": 288,
                    "text": "[2,",
                    "ref_id": "BIBREF1"
                },
                {
                    "start": 289,
                    "end": 291,
                    "text": "3]",
                    "ref_id": "BIBREF2"
                },
                {
                    "start": 492,
                    "end": 495,
                    "text": "[4]",
                    "ref_id": "BIBREF4"
                },
                {
                    "start": 837,
                    "end": 840,
                    "text": "[4]",
                    "ref_id": "BIBREF4"
                },
                {
                    "start": 1048,
                    "end": 1051,
                    "text": "[5,",
                    "ref_id": "BIBREF5"
                },
                {
                    "start": 1052,
                    "end": 1054,
                    "text": "6]",
                    "ref_id": "BIBREF6"
                }
            ],
            "ref_spans": [],
            "section": "Background and rationale {6a}"
        },
        {
            "text": "Early administration of coagulation factors with FFP has been highlighted in the prehospital setting suggesting a potential beneficial effect on mortality [7] . However, FFP administration may be delayed due to logistical reasons such as transport and immediate availability. The administration of four-factor prothrombin complex concentrate (PCC) has emerged as an alternative to early administrate coagulation factors and is used to treat post-traumatic coagulopathy in diverse European countries [8, 9] . A strategy combining fibrinogen and four factor-PCC has decreased blood product consumption [8] . The reduction of blood product consumption is meaningful since blood transfusion is associated with post-traumatic infectious complications [10] and is a risk factor for multiple organ failure after severe trauma [11] . Recently, an open-label randomized controlled trial comparing a classic massive transfusion protocol to a tailored administration of procoagulant concentrates, including PCC and fibrinogen, also showed a decrease in RBC transfusion resulting in less patients requiring massive transfusion [12] . However, there is no randomized controlled double-blind study assessing the impact of PCC in addition to a classic massive transfusion protocol including fibrinogen administration and blood product transfusion with RBC and FFP [13] .",
            "cite_spans": [
                {
                    "start": 155,
                    "end": 158,
                    "text": "[7]",
                    "ref_id": "BIBREF7"
                },
                {
                    "start": 499,
                    "end": 502,
                    "text": "[8,",
                    "ref_id": "BIBREF8"
                },
                {
                    "start": 503,
                    "end": 505,
                    "text": "9]",
                    "ref_id": "BIBREF9"
                },
                {
                    "start": 600,
                    "end": 603,
                    "text": "[8]",
                    "ref_id": "BIBREF8"
                },
                {
                    "start": 746,
                    "end": 750,
                    "text": "[10]",
                    "ref_id": "BIBREF10"
                },
                {
                    "start": 819,
                    "end": 823,
                    "text": "[11]",
                    "ref_id": "BIBREF11"
                },
                {
                    "start": 1115,
                    "end": 1119,
                    "text": "[12]",
                    "ref_id": "BIBREF13"
                },
                {
                    "start": 1349,
                    "end": 1353,
                    "text": "[13]",
                    "ref_id": "BIBREF14"
                }
            ],
            "ref_spans": [],
            "section": "Background and rationale {6a}"
        },
        {
            "text": "The PROCOAG study therefore aims to test whether early administration of PCC allows a reduction of the total number of blood products transfused within the first 24 h after hospital admission of trauma patients with major hemorrhage.",
            "cite_spans": [],
            "ref_spans": [],
            "section": "Background and rationale {6a}"
        },
        {
            "text": "The primary objective of the PROCOAG study is to test whether the early PCC administration with standard blood products compared with standard care alone allows better control of post-traumatic hemorrhage, echoed by the total number of blood products transfused within the first 24 h after hospital admission.",
            "cite_spans": [],
            "ref_spans": [],
            "section": "Objectives {7}"
        },
        {
            "text": "Secondary objectives are as follows:",
            "cite_spans": [],
            "ref_spans": [],
            "section": "Objectives {7}"
        },
        {
            "text": "To conduct a separate analysis of the primary outcome:",
            "cite_spans": [],
            "ref_spans": [],
            "section": "Objectives {7}"
        },
        {
            "text": "-Assessment of RBC consumption -Evaluation of FFP consumption -Evaluation of platelet consumption To compare between the two groups: -Time to normalize hemostasis defined by the time to achieve prothrombin time ratio < 1.5 -Time from admission to hemorrhage control defined during a surgical and/or radiological procedure, defined as the time necessary to control bleeding in the surgical field (operative field is dry without further foreseeable homeostatic procedures) or to control contrast blush after embolization during an interventional radiology (no more dye flushing). -Thromboembolic events (pulmonary embolism, deep venous thrombosis) -Morbi-mortality: mortality at 24 h and 28 days, intensive care unit (ICU)-free days (number of in-hospital days outside ICU) within the first 28 days, ventilator-free days during ICU stay within the first 28 days, hospital-free days within the first 28 days, and hospitalization status at day 28, -Neurological outcome (Glasgow Outcome Scale Extended, GOS-E) for patients with brain lesions on initial scan To evaluate differences in terms of cost-effectiveness",
            "cite_spans": [],
            "ref_spans": [],
            "section": "Objectives {7}"
        },
        {
            "text": "The PROCOAG study is a therapeutic, prospective, randomized, multicenter, double-blind, parallel, superiority controlled clinical trial testing the efficacy of four factor-PCC to reduce the amount of blood products transfused in patients at risk of massive transfusion.",
            "cite_spans": [],
            "ref_spans": [],
            "section": "Trial design {8}"
        },
        {
            "text": "Twelve French academic hospitals will participate in the study. All centers are level-I trauma centers receiving more than 200 trauma patients with an injury severity score (ISS)>15 each year. A list of all participating centers can be found on https://clinicaltrials.gov.",
            "cite_spans": [],
            "ref_spans": [],
            "section": "Study setting {9}"
        },
        {
            "text": "All consecutively admitted adult patients at risk of massive transfusion after severe trauma are screened for enrolment. Patients older than 18 years, admitted directly from the injury scene to a level-I trauma center, are eligible provided that they have two criteria: (1) a transfusion of at least one unit (U) of RBC prior to hospital admission or within the first hour after their admission (a delay of 90 min is tolerated if transfusion is decided within 1 h post admission) and (2) prediction by an assessment of blood consumption (ABC) score ≥ 2 [14] or by physician judgment of the need for a massive transfusion (defined by a transfusion of at least 10 RBC during the first 24 h or 3 RBC during the first hour).",
            "cite_spans": [
                {
                    "start": 553,
                    "end": 557,
                    "text": "[14]",
                    "ref_id": "BIBREF15"
                }
            ],
            "ref_spans": [],
            "section": "Eligibility criteria {10} Inclusion criteria"
        },
        {
            "text": "Patients are not eligible in the case of (1) traumatic cardiac arrest before randomization, (2) secondary admission from another health care facility/hospital (technical shortstops are accepted, i.e., such a stop should not 1 h before admission to the trauma center), (3) treatment with anticoagulants, (4) known pregnancy, (5) known hypersensitivity to four-factor PCC or its excipients, (6) patient with devastating injuries expected to die within the first hour post-admission, (7) patient under therapeutic limitation before randomization, (8) patient under guardianship, (9) knowledge of a contraindication to the use of NaCl 0.9% at the dose of 1 mL/ kg (e.g., hyperchloremia or hypernatremia), or a dropout criterion (10) inclusion in another trial within the last 30 days, (11) family or patient refusal, and (12) patient without health insurance.",
            "cite_spans": [
                {
                    "start": 544,
                    "end": 547,
                    "text": "(8)",
                    "ref_id": "BIBREF8"
                }
            ],
            "ref_spans": [],
            "section": "Exclusion criteria"
        },
        {
            "text": "Considering the study context, a considerable number of enrolled patients will be unable to consent (e.g., unconsciousness, agitation, post-traumatic stress). Informed consent can be therefore obtained from patient's next of kin if present or consent is waived if no one is present at the time of enrolment, as authorized by French law in an emergency situation and approved by the ethics committee. This procedure was already used and authorized in a previous French study on trauma [15] . As soon as the patient's next of kin is available and capable of informed consent in complete and faithful terms, consent is obtained. Informed consent must also be obtained from the patient whenever he/she becomes able to consent and up to 28 days after trauma. Patients and their next of kin have the right to refuse participation in the study or revoke their consent at any time. All information appears in an information notice and a consent form given to the subject. All these documents have been approved by the ethics committee. Written informed consent is obtained by the investigator. Two original copies are co-signed by both the investigator and the subject who consent.",
            "cite_spans": [
                {
                    "start": 484,
                    "end": 488,
                    "text": "[15]",
                    "ref_id": "BIBREF16"
                }
            ],
            "ref_spans": [],
            "section": "Who will take informed consent {26a}"
        },
        {
            "text": "This is not applicable.",
            "cite_spans": [],
            "ref_spans": [],
            "section": "Additional consent provisions for collection and use of participant data and biological specimens {26b}"
        },
        {
            "text": "The comparator will be normal saline (NaCl 0.9%, dose: 1ml/kg). At this dose, NaCl is neutral regarding its interaction with the coagulation factors and therefore considered a placebo.",
            "cite_spans": [],
            "ref_spans": [],
            "section": "Explanation for the choice of comparators {6b}"
        },
        {
            "text": "Within 1 h of admission, patients are randomized in two arms. In the placebo arm, patients are managed following standard care in addition to intravenous 1ml/ kg saline solution. In the treatment arm, patients are managed following standard care in addition to intravenous administration of 1ml/kg four-factor PCC (25 IU/ml of Factor IX/kg). Treatments are given as soon as possible using syringe pumps (120 mL/h).",
            "cite_spans": [],
            "ref_spans": [],
            "section": "Intervention description {11a}"
        },
        {
            "text": "All centers follow European guidelines for the management of post-traumatic hemorrhage. Details of standard management are found below (11d).",
            "cite_spans": [],
            "ref_spans": [],
            "section": "Intervention description {11a}"
        },
        {
            "text": "Study treatment is managed by the investigating team, starting within 1-h post-admission and is administered in intravenous perfusion at 2mL per minute. There is no reason for discontinuing or modifying treatment unless an adverse reaction to the study treatment occurs. In this unlikely event, perfusion should be stopped, appropriate care provided immediately, and the event should be reported to the sponsor. Dose change is not permitted by the protocol.",
            "cite_spans": [],
            "ref_spans": [],
            "section": "Criteria for discontinuing or modifying allocated interventions {11b}"
        },
        {
            "text": "Because the investigating team administrates the treatment, no strategy is needed to improve patient adherence to the intervention.",
            "cite_spans": [],
            "ref_spans": [],
            "section": "Strategies to improve adherence to interventions {11c}"
        },
        {
            "text": "From admission, all patients are managed according to European recommendations. Briefly, the source of bleeding should be identified as soon as possible and treated with emergency surgery and/or embolization following standard practice [16] . Regarding resuscitation, patients are treated in both groups with restricted volume replacement strategy, early transfusion of blood products with a RBC:FFP ratio between 1:1 and 2:1. Tranexamic acid (TXA) is intravenously administered within 3h after injury at a loading dose of 1 g infused over 10 min followed by an intravenous infusion of 1 g over 8 h [17] . Fibrinogen concentrate is administered in case of fibrinogen concentration <1.5 g/L [18] or viscoelastic evidence of a functional fibrinogen deficiency [19] . Platelets are administered to maintain a platelet count above 50 x 10 9 /L. Vasopressors can be infused in addition to fluids to maintain target systolic arterial blood pressure (>90 mmHg or >110 mmHg for head-injured patients). Blood samples are regularly drawn from admission to test hemostasis (prothrombin time ratio, Quick time, fibrinogen concentration, and viscoelastic tests where available), blood electrolytes, hepatic and renal function, and blood gases.",
            "cite_spans": [
                {
                    "start": 236,
                    "end": 240,
                    "text": "[16]",
                    "ref_id": "BIBREF17"
                },
                {
                    "start": 599,
                    "end": 603,
                    "text": "[17]",
                    "ref_id": "BIBREF18"
                },
                {
                    "start": 690,
                    "end": 694,
                    "text": "[18]",
                    "ref_id": "BIBREF19"
                },
                {
                    "start": 758,
                    "end": 762,
                    "text": "[19]",
                    "ref_id": "BIBREF20"
                }
            ],
            "ref_spans": [],
            "section": "Relevant concomitant care permitted or prohibited during the trial {11d}"
        },
        {
            "text": "Post-trial care is not planned. Patients who suffer harm from trial participation will be cared for in the intensive care unit. Should prejudice linked to study participation occur, financial compensation will be provided by the insurance (Société Hospitalière d'Assurances Mutuelles-SHAM, 18 rue Edouard Rochet, 69,372 Lyon Cedex 08, France) contracted by the promotor.",
            "cite_spans": [],
            "ref_spans": [],
            "section": "Provisions for post-trial care {30}"
        },
        {
            "text": "The primary outcome is the total number of blood products transfused within the first 24 h after hospital admission, including RBC, FFP, and platelets. The choice of this primary outcome is based on the following rationale. First, a recent randomized control trial exploring the effect of vasopressin use after severe trauma on the same endpoint [20] , Second, even if transfusion is considered a pillar in the management of acute bleeding, blood products are associated with adverse events and poor clinical outcome [11, 21] . Third, mortality after severe trauma is a complex process depending on hemorrhage but also on traumatic brain injury and pre-existing medical conditions, specifically in elderly patients [22] . We thus believe that 24h total blood consumption is an accurate proxy of the severity of the bleeding until the hemorrhage stops.",
            "cite_spans": [
                {
                    "start": 346,
                    "end": 350,
                    "text": "[20]",
                    "ref_id": "BIBREF21"
                },
                {
                    "start": 517,
                    "end": 521,
                    "text": "[11,",
                    "ref_id": "BIBREF11"
                },
                {
                    "start": 522,
                    "end": 525,
                    "text": "21]",
                    "ref_id": "BIBREF22"
                },
                {
                    "start": 715,
                    "end": 719,
                    "text": "[22]",
                    "ref_id": "BIBREF23"
                }
            ],
            "ref_spans": [],
            "section": "Outcomes {12}"
        },
        {
            "text": "Secondary outcome measures are (1) number of separate units (and volume) of RBC, FFP, and platelets and transfused in the first 24 h; (2) time to achieve prothrombin time ratio < 1.5; (3) time to hemostasis, defined as the time necessary to control bleeding in the surgical field (operative field is dry without further foreseeable homeostatic procedures) or to control contrast blush after embolization during an interventional radiology (no more dye flushing); (4) number of thrombo-embolic events at 28 days; (5) mortality at 24 h and 28 days; (6) intensive care unit (ICU)free days (number of in-hospital days outside ICU) within the first 28 days; (7) ventilator-free days during ICU stay within the first 28 days; (8) hospital-free days within the first 28 days; (9) hospitalization status at day 28; (10) GOSE for patients with brain lesions on initial scan; and (11) cost of each strategy at days 8 and 28. Cost analyses will be performed on expensive care: blood products and procoagulant treatments administered, imaging exams, surgeries, and length of stay in each healthcare unit.",
            "cite_spans": [],
            "ref_spans": [],
            "section": "Outcomes {12}"
        },
        {
            "text": "All consecutive trauma patients admitted directly from the injury scene who require RBC transfusion with a risk of massive transfusion are screened on admission. Eligible patients are then rapidly enrolled by the study investigator. They should be randomized and treated accordingly within 60 min post-admission. After patient treatment, follow-up includes hourly visits until 6 h post-admission, as well as visits at 12 and 24 h to measure prothrombin ratio, assess hemorrhage control and monitor adverse events. Thrombo-embolic events are under special scrutiny during the entire hospital stay because they are frequently expected adverse effects of PCC treatment. Each suspicious thrombo-embolic event should be confirmed with venous Doppler echography or angiography and treated following standard practice. Thromboprophylaxis is left to physician discretion. Patients are followed for 28 days with the last visit aiming at collecting the Glasgow outcome scale extended (GOSE) for patients with brain lesions on initial cerebral imaging, mortality, and place of living (Fig. 1 ).",
            "cite_spans": [],
            "ref_spans": [
                {
                    "start": 1073,
                    "end": 1080,
                    "text": "(Fig. 1",
                    "ref_id": "FIGREF0"
                }
            ],
            "section": "Participant timeline {13}"
        },
        {
            "text": "Total blood consumption was estimated in the control group based on 1-year consumption in Grenoble University Hospital and Annecy General Hospital; we found that patients with our eligibility criteria received 12 units on average of RBC, FFP, and platelets. We consider a reduction of 3 units as clinically significant since 3 units represent 1 L of blood products. Thus, a 25% decrease in transfused blood products in the first 24 h is expected (from an average of 12 transfused units in the control group to 9 transfused units in the experimental group). The study needs to include 162 patients per group to demonstrate this 25% reduction with 80% power and αrisk of 0.05, bilateral test (nQuery, Sample Size and Power Calculation, \"Statsols\", Statistical Solutions Ltd., Cork, Ireland, blood product units transfused do not follow a normal distribution). To compensate for the estimated lost-to-follow-up, the trial plans to include 350 patients.",
            "cite_spans": [],
            "ref_spans": [],
            "section": "Sample size {14}"
        },
        {
            "text": "All centers are level-I trauma centers in France with sufficient recruitment of severe trauma patients. Before the start of the study, a feasibility questionnaire has circulated between all centers and they were asked for potential inclusions in the study. They all agreed to include between one and two patients each month. Regular newsletters will be sent and all participating centers are part of a national network for trauma care (GITE group).",
            "cite_spans": [],
            "ref_spans": [],
            "section": "Recruitment {15}"
        },
        {
            "text": "Randomization will be performed by sealed envelopes available at the investigator site. Randomization will be by block of random size from 2 to 6, stratified by center. The randomization list will be created and maintained by the study sponsor. Randomization envelopes to be opened will be created prior to the study by the coordinating pharmacy and made available during the site visit. The integrity and presence of the envelopes will be checked at each monitoring visit.",
            "cite_spans": [],
            "ref_spans": [],
            "section": "Assignment of interventions: allocation Sequence generation {16a}"
        },
        {
            "text": "Allocation sequence is implemented through sequentially numbered, opaque, sealed, envelopes. Envelopes have been created by the coordinating pharmacy in Grenoble and provided to each investigating site pharmacy which manages the stock. Site pharmacy provides 4 sequentially numbered envelopes to the investigating team and renew the stock after each randomization. Envelopes are sealed with inviolable tapes making any opening visible. Therefore, the investigating team cannot modify the inclusion decision after allocation without such a modification being noticed by the hospital pharmacy and monitoring team.",
            "cite_spans": [],
            "ref_spans": [],
            "section": "Concealment mechanism {16b}"
        },
        {
            "text": "An independent statistician will generate the allocation sequence, a clinician investigator (clinician trained in trauma resuscitation) will enroll participants; an unblinded, trained nurse not involved in patient care assign participants to one of the study arms by unsealing randomization envelope.",
            "cite_spans": [],
            "ref_spans": [],
            "section": "Implementation {16c}"
        },
        {
            "text": "After enrolment, the blinded clinician investigator conveys to the unblinded, dedicated, trained nurse patient's name, weight, and study number. This nurse does not participate in the resuscitation of the patient. The nurse prepares the solution to be administered (placebo (saline solution 0.9%) or PCC (1 ml/kg) according to the assignment specified in the randomization envelope. Treatment is stored in a designated and closed refrigerator and administered in opaque syringes by the same dedicated nurse at a speed of 120 mL/h with syringe pumps.",
            "cite_spans": [],
            "ref_spans": [],
            "section": "Assignment of interventions: blinding Who will be blinded {17a}"
        },
        {
            "text": "The investigating team and the patient are blinded (clinician investigator and any MD implied in patient care, nurses, site clinical research assistants). The only unblinded person in the entire process is the dedicated nurse unsealing the envelope and preparing the study drug or placebo to be administered.",
            "cite_spans": [],
            "ref_spans": [],
            "section": "Assignment of interventions: blinding Who will be blinded {17a}"
        },
        {
            "text": "Several means are deployed to ensure masking: the dedicated nurse is not involved in the care of the included patient as verified by the monitoring team on every visit. Perfusion material (syringes, filling pipes, and dressings) is opaque, drug storage, randomization, and study drug preparation performed in dedicated protected areas.",
            "cite_spans": [],
            "ref_spans": [],
            "section": "Assignment of interventions: blinding Who will be blinded {17a}"
        },
        {
            "text": "The site pharmacy and pharmacy site monitor are not blinded. Statisticians and data monitors are blinded to treatment allocation.",
            "cite_spans": [],
            "ref_spans": [],
            "section": "Assignment of interventions: blinding Who will be blinded {17a}"
        },
        {
            "text": "Unblinding is possible if the information of the allocated treatment is necessary for the care of the included patient. The clinician investigator will retrieve this information from the on-site pharmacist.",
            "cite_spans": [],
            "ref_spans": [],
            "section": "Procedure for unblinding if needed {17b}"
        },
        {
            "text": "To retrieve the information, the referring person will complete on a standard form:",
            "cite_spans": [],
            "ref_spans": [],
            "section": "Procedure for unblinding if needed {17b}"
        },
        {
            "text": "The contact details of the physician, clinician investigator or not, or the pharmacist who called (name, first name, qualification of the caller, address, telephone number). The name of the study. The date of the call, the description of the clinical event motivating the call: type of event, start date, and treatment modalities. If the event is classified as a serious adverse event. The action following this call: unblinding, action to be taken to explore the effect and allow diagnosis, treatment of the effect.",
            "cite_spans": [],
            "ref_spans": [],
            "section": "Procedure for unblinding if needed {17b}"
        },
        {
            "text": "The randomization list is stored in the clinical pharmacy of each participating center. This information will be sent as soon as possible to the study sponsor by e-mail.",
            "cite_spans": [],
            "ref_spans": [],
            "section": "Procedure for unblinding if needed {17b}"
        },
        {
            "text": "The monitoring unit will be systematically unblinded in case of a suspected unexpected serious adverse reaction before reporting to the competent authorities and possibly annually when the annual safety reports are redacted.",
            "cite_spans": [],
            "ref_spans": [],
            "section": "Procedure for unblinding if needed {17b}"
        },
        {
            "text": "An electronic case report form (eCRF, CSonline by clinsight) will be composed for the study. The persons responsible for completing the eCRF will be clearly identified in the task delegation document.",
            "cite_spans": [],
            "ref_spans": [],
            "section": "Data collection and management Plans for assessment and collection of outcomes {18a}"
        },
        {
            "text": "Grenoble University Hospital is the sponsor of the study and is responsible for study oversight and quality controls. Data are collected by the investigating centers' staff on the electronic case report form. Pseudoanonymized data are stored by and belong to the sponsor. Participating centers are monitored by a dedicated department, independent of the scientific team and investigators who designed the project. Centers are visited regularly to control patient data, ethical standards, patient safety, respect of masking protocol, and investigational product handling and storage. The primary endpoint is monitored in all patients.",
            "cite_spans": [],
            "ref_spans": [],
            "section": "Data collection and management Plans for assessment and collection of outcomes {18a}"
        },
        {
            "text": "All visits will be the subject of a monitoring report in writing. A copy will be sent to the Principal Investigator.",
            "cite_spans": [],
            "ref_spans": [],
            "section": "Data collection and management Plans for assessment and collection of outcomes {18a}"
        },
        {
            "text": "The primary outcome is collected at day 1 (total blood consumption). This endpoint is easily verified through blood bank data. Patient follow-up will be performed until day 28. Considering the clinical acuity of the patients and their admission to the ICU, no specific action is planned to promote participant retention.",
            "cite_spans": [],
            "ref_spans": [],
            "section": "Plans to promote participant retention and complete follow-up {18b}"
        },
        {
            "text": "Data management will follow Grenoble-Alpes university hospital procedures (data validation, basic freezing, backup, data reviews before unblinding). A data entry dictionary will be made available to investigators and their teams and traceability of requests for corrections and corrections made on the eCRF.",
            "cite_spans": [],
            "ref_spans": [],
            "section": "Data management {19}"
        },
        {
            "text": "In accordance with the law (Articles L.1121-3 and R.5121-13 of the Public Health Code), persons with direct access to data will take all necessary precautions to ensure the confidentiality of information relating to experimental drugs, research, and the persons involved, particularly with regard to their identity and the results obtained. These persons, in the same way as the investigators themselves, are subject to professional confidentiality.",
            "cite_spans": [],
            "ref_spans": [],
            "section": "Confidentiality {27}"
        },
        {
            "text": "During or at the end of the interventional research, all patient data collected and transmitted to the sponsor by the investigators will be pseudo-anonymized. Under no circumstances should the names or addresses of the patients be exposed. Only the first letter of the subject's surname and first name will be recorded, accompanied by a coded number specific to the research, indicating the order of inclusion of the subjects.",
            "cite_spans": [],
            "ref_spans": [],
            "section": "Confidentiality {27}"
        },
        {
            "text": "The promoter will ensure each participant's approval through written informed consent and assure access to their individual data and that no personal data are retained except for the bare minimum required for quality control.",
            "cite_spans": [],
            "ref_spans": [],
            "section": "Confidentiality {27}"
        },
        {
            "text": "Plans for collection, laboratory evaluation, and storage of biological specimens for genetic or molecular analysis in this trial/future use {33} This is not applicable.",
            "cite_spans": [],
            "ref_spans": [],
            "section": "Confidentiality {27}"
        },
        {
            "text": "The risk of alpha error corresponds to a usual threshold: 5%. All our tests will be bilateral. The initial characteristics of the patients will be represented in a comparative table according to the two treatment groups. Quantitative and qualitative variables will be presented with the usual parameters, mean, and standard deviation as well as numbers and percentages.",
            "cite_spans": [],
            "ref_spans": [],
            "section": "Statistical methods for primary and secondary outcomes {20a}"
        },
        {
            "text": "Analysis of the main outcome The main outcome is the total blood consumption (RBC, FFP, and platelets). It will be analyzed after verification that the time spent in the study up to H24 is not significantly different between the two groups. If this duration is not different, the total number of units transfused over 24 h between the two groups will be compared using a bilateral student intent to treat t test (if the application conditions are not met, we will use a non-parametric Mann-Whitney U test). If the duration is different, the amount of blood products used per hour between the two groups will be compared using an intention-to-treat Student t test (= total number of bags transfused over 24 h divided by the time spent in research during the first 24 h), in order to control for an attrition bias created by patients who died before 24 h.",
            "cite_spans": [],
            "ref_spans": [],
            "section": "Statistical methods for primary and secondary outcomes {20a}"
        },
        {
            "text": "The per-protocol analysis will be performed on patients who actually received treatment within 1 h of admission to the hospital.",
            "cite_spans": [],
            "ref_spans": [],
            "section": "Statistical methods for primary and secondary outcomes {20a}"
        },
        {
            "text": "Secondary outcome analysis We will use the same strategy as for the primary endpoint in order to compare each quantity of RBC, FFP, and platelets, independently; i.e., a Student's t test (if the application conditions are not met, we will use a non-parametric test).",
            "cite_spans": [],
            "ref_spans": [],
            "section": "Statistical methods for primary and secondary outcomes {20a}"
        },
        {
            "text": "Comparison by a Student's t test (if the application conditions are not met, we will use a nonparametric test) of the values of the Quick Time between the two groups.",
            "cite_spans": [],
            "ref_spans": [],
            "section": "Statistical methods for primary and secondary outcomes {20a}"
        },
        {
            "text": "The delay between the time of the trauma and clinical hemorrhage control will be compared between the two randomization groups by a Student's t test (if the application conditions are not met, we will use a nonparametric test).",
            "cite_spans": [],
            "ref_spans": [],
            "section": "Statistical methods for primary and secondary outcomes {20a}"
        },
        {
            "text": "The number of thromboembolic events at D28 will be recoded as a qualitative variable. At least one event (pulmonary embolism or deep vein thrombosis) will be required for this variable. It will then be compared using the chi 2 test between the two groups (when the conditions for the application of the chi 2 test are not met, the Fisher's test will be used).",
            "cite_spans": [],
            "ref_spans": [],
            "section": "Statistical methods for primary and secondary outcomes {20a}"
        },
        {
            "text": "Calculation of the cost of each of the strategies An average cost of care will be calculated for each group. Micro-costing and gross-costing methods will be used to reconstitute the cost of the hospital stay. Thus, data on the consumption of care will be collected prospectively throughout the entire length of the stay in intensive care (the number and nature of blood products and drug treatments used, additional examinations performed, and the length of stay in each care unit). In this way, we can calculate an average cost of the resuscitation stay in each group. The cost of the overall stay will be reconstituted using the modified GHM method, and it will be based on hospital cost accounting data (calculated within the framework of the ENC: national scale of costs).",
            "cite_spans": [],
            "ref_spans": [],
            "section": "Statistical methods for primary and secondary outcomes {20a}"
        },
        {
            "text": "Comparison of the cost of the two strategies: The difference in costs between the groups will be tested by a Student's test or by a non-parametric test (Mann-Whitney tests) in case of non-Gaussian distribution. The choice of the test will be made with regard to the distribution of costs in each group (Shapiro-Wilk test, on raw data or, if necessary, on transformed data). If the distribution of costs is not Gaussian, the construction of the confidence interval of the average cost will be based on the non-parametric bootstrap method.",
            "cite_spans": [],
            "ref_spans": [],
            "section": "Statistical methods for primary and secondary outcomes {20a}"
        },
        {
            "text": "Deterministic and probabilistic sensitivity analyses will be performed to test the robustness of our estimates. Multivariate analyses will also be implemented to take into account censoring (death and follow-up time) in our cost analyses.",
            "cite_spans": [],
            "ref_spans": [],
            "section": "Statistical methods for primary and secondary outcomes {20a}"
        },
        {
            "text": "Mortalities at 24 h and 28 days will be compared between the two groups using the Kaplan-Meier model. Length of stay will be compared with a Student's t test (if the application conditions are not met, we will use a non-parametric test).",
            "cite_spans": [],
            "ref_spans": [],
            "section": "Statistical methods for primary and secondary outcomes {20a}"
        },
        {
            "text": "The GOSE at 28 days will be compared with a Student's t test (if the application conditions are not met, we will use a non-parametric test). The locations of the patient's hospitalization at 28 days will be compared between the two groups using the chi 2 test (when the application conditions of the chi 2 test are not met, Fisher's test will be used).",
            "cite_spans": [],
            "ref_spans": [],
            "section": "Statistical methods for primary and secondary outcomes {20a}"
        },
        {
            "text": "No interim analysis is planned.",
            "cite_spans": [],
            "ref_spans": [],
            "section": "Interim analyses {21b}"
        },
        {
            "text": "Since eligibility criteria may select patients without massive bleeding due to imperfect accuracy of the ABC score or wrong clinical judgment, primary and secondary outcomes will also be tested in the population with a massive transfusion (3 RBC within the first posttraumatic hour or at least 10 RBC at day 1).",
            "cite_spans": [],
            "ref_spans": [],
            "section": "Methods for additional analyses (e.g., subgroup analyses) {20b}"
        },
        {
            "text": "The analysis will be made following an intention-to-treat principle and a per-protocol principle to handle protocol non-adherence. We expect few missing data on the primary outcome since total blood consumption is always recorded and followed by the blood bank in each center.",
            "cite_spans": [],
            "ref_spans": [],
            "section": "Methods in analysis to handle protocol non-adherence and any statistical methods to handle missing data {20c}"
        },
        {
            "text": "Plans to give access to the full protocol, participant-level data, and statistical code {31c}",
            "cite_spans": [],
            "ref_spans": [],
            "section": "Methods in analysis to handle protocol non-adherence and any statistical methods to handle missing data {20c}"
        },
        {
            "text": "Information from the full protocol will be published in a peer-reviewed journal, and the study is registered in https://clinicaltrials.gov. The relevant data analyzed during the development of this study protocol are available upon request from the corresponding author.",
            "cite_spans": [],
            "ref_spans": [],
            "section": "Methods in analysis to handle protocol non-adherence and any statistical methods to handle missing data {20c}"
        },
        {
            "text": "Composition of the coordinating center and trial steering committee {5d}",
            "cite_spans": [],
            "ref_spans": [],
            "section": "Oversight and monitoring"
        },
        {
            "text": "Coordinating center: Grenoble University Hospital is the sponsor of the study and is responsible for study oversight and quality controls.",
            "cite_spans": [],
            "ref_spans": [],
            "section": "Oversight and monitoring"
        },
        {
            "text": "Steering committee: Pierre Bouzat, Jean-Stephane David, Jean-Luc Bosson, Bruno Riou, Jacques Duranteau, Jean-François Payen Data management team: Jean-Luc Bosson, MD, PhD, CHU Grenoble Alpes, Grenoble, France",
            "cite_spans": [],
            "ref_spans": [],
            "section": "Oversight and monitoring"
        },
        {
            "text": "Shipping of investigational products is under the responsibility of the coordinating clinical trial pharmacy of Grenoble University Hospital. Specifically, they create and ship randomization envelopes, and they order PCC (Kanokad®) to the manufacturer LFB (Les Ullis, France). The biopharmaceutical company LFB is responsible for producing and delivering Kanokad® to investing sites in respect of Good Manufacturing Practices. The coordinating pharmacy in Grenoble also orders and distributes saline solution and opaque devices required for the research to investigating sites. Each site is responsible for storage (2-8°C, away from light), handling and accounting of investigational products received. These elements are verified during monitoring visits.",
            "cite_spans": [],
            "ref_spans": [],
            "section": "Investigational product handling and storage"
        },
        {
            "text": "Composition of the data monitoring committee, its role, and reporting structure {21a}",
            "cite_spans": [],
            "ref_spans": [],
            "section": "Investigational product handling and storage"
        },
        {
            "text": "The sponsor appointed a data safety monitoring board (DSMB) that meets every year to analyze safety data (expected and unexpected adverse events). The DSMB is composed of members independent of the research and makes recommendations about protocol termination, modifications, or continuation without modifications.",
            "cite_spans": [],
            "ref_spans": [],
            "section": "Investigational product handling and storage"
        },
        {
            "text": "Adverse events are reported blinded to the sponsor by investigating sites and are analyzed by the sponsor safety departments following European regulation on clinical trials on medicinal products.",
            "cite_spans": [],
            "ref_spans": [],
            "section": "Adverse event reporting and harms {22}"
        },
        {
            "text": "An audit initiated at the request of the sponsor or health authorities may be conducted at any time by trained, independent inspectors. The purpose is to ensure the quality of the research, the validity of its results, and compliance with the law and regulations. The auditors/ inspectors must have direct access to the source and medical data and to any useful document related to the conduct of the clinical study. The confidentiality of the data and the anonymity of the subjects will be respected.",
            "cite_spans": [],
            "ref_spans": [],
            "section": "Frequency and plans for auditing trial conduct {23}"
        },
        {
            "text": "The investigators agree to comply with the sponsor's and the competent authority's requirements for an audit or inspection of the research.",
            "cite_spans": [],
            "ref_spans": [],
            "section": "Frequency and plans for auditing trial conduct {23}"
        },
        {
            "text": "The audit may apply to all stages of the research, from the development of the protocol to the publication of results and the classification of data used or generated in the research.",
            "cite_spans": [],
            "ref_spans": [],
            "section": "Frequency and plans for auditing trial conduct {23}"
        },
        {
            "text": "Plans for communicating important protocol amendments to relevant parties (e.g., trial participants, ethical committees) {25}",
            "cite_spans": [],
            "ref_spans": [],
            "section": "Frequency and plans for auditing trial conduct {23}"
        },
        {
            "text": "Any substantial modification, i.e., any modification likely to have a significant impact on the protection of participants, validity and on the results of the research, on the quality and safety of the products tested, on the interpretation of the scientific documents that support the conduct of the research, or on the methods of conducting the research, is subject to written amendment submitted to the sponsor; the latter must obtain, prior to its implementation, a favorable opinion from the ethics committee and an authorization from the national agency for drug safety. All amendments are validated by the sponsor and by all the research stakeholders concerned by the amendment before submission to the ethics committee and the national agency for drug safety. All amendments to the protocol must be made known to all investigators participating in the research. The investigators declare compliance with the protocol. Any amendment that modifies the management of the subjects or the benefits, risks, and constraints of the research is the subject of a new participant information note and a new consent form. The obtainment of informed consent follows the identical procedure as described above.",
            "cite_spans": [],
            "ref_spans": [],
            "section": "Frequency and plans for auditing trial conduct {23}"
        },
        {
            "text": "Results will be reported through scientific conferences and peer-reviewed publications following CONSORT recommendations [23] . All participants can be informed of the study results at the end of the trial on request.",
            "cite_spans": [
                {
                    "start": 121,
                    "end": 125,
                    "text": "[23]",
                    "ref_id": "BIBREF24"
                }
            ],
            "ref_spans": [],
            "section": "Dissemination plans {31a}"
        },
        {
            "text": "The PROCOAG trial explores the management of posttraumatic coagulopathy using pro-thrombin concentrate complex (PCC) in addition to standard blood products and fibrinogen. As opposed to fresh frozen plasma, PCC is readily available at admission and we hypothesized that early correction of coagulation factor deficiency optimizes patient blood management and therefore reduces the total number of blood products transfused within the first 24 h after hospital admission.",
            "cite_spans": [],
            "ref_spans": [],
            "section": "Discussion"
        },
        {
            "text": "Hemorrhage is a leading cause of death in patients with trauma. Although blood products remain the standard for treating hemorrhagic shock, they are a limited and perishable resource. Moreover, concerns are increasing that blood products exert an immunomodulatory effect and negatively affect clinical outcomes [24] [25] [26] . Resuscitation strategies that decrease the need for transfusions without increasing complications, therefore, would represent a clinically important innovation.",
            "cite_spans": [
                {
                    "start": 311,
                    "end": 315,
                    "text": "[24]",
                    "ref_id": "BIBREF25"
                },
                {
                    "start": 316,
                    "end": 320,
                    "text": "[25]",
                    "ref_id": "BIBREF26"
                },
                {
                    "start": 321,
                    "end": 325,
                    "text": "[26]",
                    "ref_id": "BIBREF27"
                }
            ],
            "ref_spans": [],
            "section": "Discussion"
        },
        {
            "text": "Eligibility criteria were determined to select patients with severe acute bleeding early in the process so that PCC can be early administrated in the trauma bay on patient arrival. The study hypothesis states an empiric administration of PCC may enhance clotting capacity and decrease total blood product consumption. In consequence, the investigators expect several patients may not require a massive transfusion. The effect of the study protocol on massive transfusion will be investigated in a planned subgroup analysis (see above).",
            "cite_spans": [],
            "ref_spans": [],
            "section": "Discussion"
        },
        {
            "text": "The investigators acknowledge that total blood transfusion is only a surrogate marker of the severity of the bleeding. However, the AVERT Shock trial successfully applied this endpoint based on the rationale that reduction of blood transfusion is an objective of innovative trauma resuscitation [20] . The amount of transfusion has been shown to correlate with severe complications and poor clinical outcomes [10, 21, 27] . Specifically, Moore et al. noted that transfusion of packed red blood cells was the strongest predictor for the development of multi-organ failure (odds ratio = 8.6) [11] . The strategy tested in the present trial hence carries the potential to reduce morbidity, mirrored by the length of stay in ICU and the duration of mechanical ventilation, by reducing the amount of used blood products. The investigators are aware that despite existing guidelines, hemorrhage management may vary. This aspect is acknowledged by the center-based stratification of the randomization process.",
            "cite_spans": [
                {
                    "start": 295,
                    "end": 299,
                    "text": "[20]",
                    "ref_id": "BIBREF21"
                },
                {
                    "start": 409,
                    "end": 413,
                    "text": "[10,",
                    "ref_id": "BIBREF10"
                },
                {
                    "start": 414,
                    "end": 417,
                    "text": "21,",
                    "ref_id": "BIBREF22"
                },
                {
                    "start": 418,
                    "end": 421,
                    "text": "27]",
                    "ref_id": "BIBREF28"
                },
                {
                    "start": 590,
                    "end": 594,
                    "text": "[11]",
                    "ref_id": "BIBREF11"
                }
            ],
            "ref_spans": [],
            "section": "Discussion"
        },
        {
            "text": "Considering the fact that PCC use remains a matter of debate after severe trauma because of an associated potential high thromboembolic risk in this specific patient group; indeed, the use of PCC has repeatedly been shown to result in an excessive overshoot of thrombin generation in both in vitro studies [28, 29] and clinical studies including trauma patients [30] . PROCOAG Trial provides the advantage to explore the safety of empiric PCC administration based on the high clinical probability of active hemorrhage and massive transfusion.",
            "cite_spans": [
                {
                    "start": 306,
                    "end": 310,
                    "text": "[28,",
                    "ref_id": "BIBREF30"
                },
                {
                    "start": 311,
                    "end": 314,
                    "text": "29]",
                    "ref_id": "BIBREF31"
                },
                {
                    "start": 362,
                    "end": 366,
                    "text": "[30]",
                    "ref_id": "BIBREF32"
                }
            ],
            "ref_spans": [],
            "section": "Discussion"
        },
        {
            "text": "As a pragmatic study, this trial aims at testing the effect of PCC administration in combination with standard care in a real-life context. With a high level of proof and quality standard, a positive result might already affect the management of severe trauma patients at risk of massive transfusion as this study investigates PCC efficacy, safety, and cost in this indication.",
            "cite_spans": [],
            "ref_spans": [],
            "section": "Discussion"
        },
        {
            "text": "The trial has obtained all authorizations and recruitment started in December 2017. Enrollment is expected to be complete by June 2021. The protocol version reported here is version 6 as of February 6, 2019. ",
            "cite_spans": [],
            "ref_spans": [],
            "section": "Trial status"
        },
        {
            "text": "PROCOAG is an investigator-initiated trial, supported by a non-profit grant from the French Ministry of Health (PHRCI 2015, n°15-059). LFB (Les Ullis, France) distributes Kanokad® for free to participating centers. These two funders have no role in trial design, conduction, data collection, nor analysis. Kanokad® safety aggregated data are shared with LFB.",
            "cite_spans": [],
            "ref_spans": [],
            "section": "Funding {4}"
        },
        {
            "text": "Only the principal investigators, the DSMB, and the statisticians will have access to the final data set. There is no plan to share the data, but they are made available for audits and inspections. Anonymized patient data or a full set can be made available on reasonable request. Patients or their relatives are informed that anonymized data can be shared with other groups or used for further studies and have the opportunity to refuse personal data sharing.",
            "cite_spans": [],
            "ref_spans": [],
            "section": "Availability of data and materials {29}"
        },
        {
            "text": "Ethics approval and consent to participate {24} Protocol was approved by the Institutional Review Board Sud-Ouest et Outre Mer II (SOOM II), on June 04, 2017, and authorized by the French competent authority (Agence Nationale pour la Sécurité du Médicament, ANSM) on April 04, 2017. The study is carried out following Good Clinical Practices, the principles of the declaration of Helsinki and European legislation [31] . Because of selection criteria, some enrolled patients are unable to consent (e.g., unconsciousness, agitation, post-traumatic stress). Informed consent can be therefore obtained from patient's next of kin if present or consent is waived if no one is present at the time of enrolment, as authorized by French law in an emergency situation and approved by the ethics committee. This procedure was already used and authorized in a previous French study on trauma [15] .",
            "cite_spans": [
                {
                    "start": 414,
                    "end": 418,
                    "text": "[31]",
                    "ref_id": "BIBREF33"
                },
                {
                    "start": 881,
                    "end": 885,
                    "text": "[15]",
                    "ref_id": "BIBREF16"
                }
            ],
            "ref_spans": [],
            "section": "Declarations"
        },
        {
            "text": "As soon as the patient's next of kin is available and capable of informed consent in complete and faithful terms, consent is obtained. Informed consent must also be obtained from the patient whenever he/she becomes able to consent and up to 28 days after trauma. Patients and their next of kin have the right to refuse to participate in the study or revoke their consent at any time. All information appears in an information notice and a consent form given to the subject. All these documents have been approved by the ethics committee. Written informed consent is obtained by the investigator. Two original copies are co-signed by both the investigator and the subject who consent.",
            "cite_spans": [],
            "ref_spans": [],
            "section": "Declarations"
        },
        {
            "text": "Although it is not anticipated, owing to the trial design, publication of any personal information about a patient will require her/his consent. ",
            "cite_spans": [],
            "ref_spans": [],
            "section": "Consent for publication {32}"
        }
    ],
    "bib_entries": {
        "BIBREF0": {
            "ref_id": "b0",
            "title": "Severe traumatic injury: regional variation in incidence and outcome",
            "authors": [
                {
                    "first": "J",
                    "middle": [
                        "P"
                    ],
                    "last": "Minei",
                    "suffix": ""
                },
                {
                    "first": "R",
                    "middle": [
                        "H"
                    ],
                    "last": "Schmicker",
                    "suffix": ""
                },
                {
                    "first": "J",
                    "middle": [
                        "D"
                    ],
                    "last": "Kerby",
                    "suffix": ""
                },
                {
                    "first": "I",
                    "middle": [
                        "G"
                    ],
                    "last": "Stiell",
                    "suffix": ""
                },
                {
                    "first": "M",
                    "middle": [
                        "A"
                    ],
                    "last": "Schreiber",
                    "suffix": ""
                },
                {
                    "first": "E",
                    "middle": [],
                    "last": "Bulger",
                    "suffix": ""
                }
            ],
            "year": 2010,
            "venue": "Ann Surg",
            "volume": "252",
            "issn": "1",
            "pages": "149--57",
            "other_ids": {
                "DOI": [
                    "10.1097/SLA.0b013e3181df0401"
                ]
            }
        },
        "BIBREF1": {
            "ref_id": "b1",
            "title": "Epidemiology of traumatic deaths: comprehensive population-based assessment",
            "authors": [
                {
                    "first": "J",
                    "middle": [
                        "A"
                    ],
                    "last": "Evans",
                    "suffix": ""
                },
                {
                    "first": "K",
                    "middle": [
                        "J"
                    ],
                    "last": "Van Wessem",
                    "suffix": ""
                },
                {
                    "first": "D",
                    "middle": [],
                    "last": "Mcdougall",
                    "suffix": ""
                },
                {
                    "first": "K",
                    "middle": [
                        "A"
                    ],
                    "last": "Lee",
                    "suffix": ""
                },
                {
                    "first": "T",
                    "middle": [],
                    "last": "Lyons",
                    "suffix": ""
                },
                {
                    "first": "Z",
                    "middle": [
                        "J"
                    ],
                    "last": "Balogh",
                    "suffix": ""
                }
            ],
            "year": 2010,
            "venue": "World J Surg",
            "volume": "34",
            "issn": "1",
            "pages": "158--63",
            "other_ids": {
                "DOI": [
                    "10.1007/s00268-009-0266-1"
                ]
            }
        },
        "BIBREF2": {
            "ref_id": "b2",
            "title": "Detailed description of all deaths in both the shock and traumatic brain injury hypertonic saline trials of the Resuscitation Outcomes Consortium",
            "authors": [
                {
                    "first": "S",
                    "middle": [
                        "A"
                    ],
                    "last": "Tisherman",
                    "suffix": ""
                },
                {
                    "first": "R",
                    "middle": [
                        "H"
                    ],
                    "last": "Schmicker",
                    "suffix": ""
                },
                {
                    "first": "K",
                    "middle": [
                        "J"
                    ],
                    "last": "Brasel",
                    "suffix": ""
                },
                {
                    "first": "E",
                    "middle": [
                        "M"
                    ],
                    "last": "Bulger",
                    "suffix": ""
                },
                {
                    "first": "J",
                    "middle": [
                        "D"
                    ],
                    "last": "Kerby",
                    "suffix": ""
                },
                {
                    "first": "J",
                    "middle": [
                        "P"
                    ],
                    "last": "Minei",
                    "suffix": ""
                }
            ],
            "year": null,
            "venue": "",
            "volume": "",
            "issn": "",
            "pages": "",
            "other_ids": {}
        },
        "BIBREF4": {
            "ref_id": "b4",
            "title": "Damage control resuscitation: directly addressing the early coagulopathy of trauma",
            "authors": [
                {
                    "first": "J",
                    "middle": [
                        "B"
                    ],
                    "last": "Holcomb",
                    "suffix": ""
                },
                {
                    "first": "D",
                    "middle": [],
                    "last": "Jenkins",
                    "suffix": ""
                },
                {
                    "first": "P",
                    "middle": [],
                    "last": "Rhee",
                    "suffix": ""
                },
                {
                    "first": "J",
                    "middle": [],
                    "last": "Johannigman",
                    "suffix": ""
                },
                {
                    "first": "P",
                    "middle": [],
                    "last": "Mahoney",
                    "suffix": ""
                },
                {
                    "first": "S",
                    "middle": [],
                    "last": "Mehta",
                    "suffix": ""
                }
            ],
            "year": 2007,
            "venue": "J Trauma",
            "volume": "62",
            "issn": "2",
            "pages": "307--317",
            "other_ids": {
                "DOI": [
                    "10.1097/TA.0b013e3180324124"
                ]
            }
        },
        "BIBREF5": {
            "ref_id": "b5",
            "title": "Transfusion of plasma, platelets, and red blood cells in a 1:1:1 vs a 1:1:2 ratio and mortality in patients with severe trauma: the PROPPR randomized clinical trial",
            "authors": [
                {
                    "first": "J",
                    "middle": [
                        "B"
                    ],
                    "last": "Holcomb",
                    "suffix": ""
                },
                {
                    "first": "B",
                    "middle": [
                        "C"
                    ],
                    "last": "Tilley",
                    "suffix": ""
                },
                {
                    "first": "S",
                    "middle": [],
                    "last": "Baraniuk",
                    "suffix": ""
                },
                {
                    "first": "E",
                    "middle": [
                        "E"
                    ],
                    "last": "Fox",
                    "suffix": ""
                },
                {
                    "first": "C",
                    "middle": [
                        "E"
                    ],
                    "last": "Wade",
                    "suffix": ""
                },
                {
                    "first": "J",
                    "middle": [
                        "M"
                    ],
                    "last": "Podbielski",
                    "suffix": ""
                }
            ],
            "year": 2015,
            "venue": "JAMA",
            "volume": "313",
            "issn": "5",
            "pages": "471--82",
            "other_ids": {
                "DOI": [
                    "10.1001/jama.2015.12"
                ]
            }
        },
        "BIBREF6": {
            "ref_id": "b6",
            "title": "The European guideline on management of major bleeding and coagulopathy following trauma: fifth edition",
            "authors": [
                {
                    "first": "D",
                    "middle": [
                        "R"
                    ],
                    "last": "Spahn",
                    "suffix": ""
                },
                {
                    "first": "B",
                    "middle": [],
                    "last": "Bouillon",
                    "suffix": ""
                },
                {
                    "first": "V",
                    "middle": [],
                    "last": "Cerny",
                    "suffix": ""
                },
                {
                    "first": "J",
                    "middle": [],
                    "last": "Duranteau",
                    "suffix": ""
                },
                {
                    "first": "D",
                    "middle": [],
                    "last": "Filipescu",
                    "suffix": ""
                },
                {
                    "first": "B",
                    "middle": [
                        "J"
                    ],
                    "last": "Hunt",
                    "suffix": ""
                }
            ],
            "year": 2019,
            "venue": "Crit Care",
            "volume": "23",
            "issn": "1",
            "pages": "",
            "other_ids": {
                "DOI": [
                    "10.1186/s13054-019-2347-3"
                ]
            }
        },
        "BIBREF7": {
            "ref_id": "b7",
            "title": "Prehospital plasma during air medical transport in trauma patients at risk for hemorrhagic shock",
            "authors": [
                {
                    "first": "J",
                    "middle": [
                        "L"
                    ],
                    "last": "Sperry",
                    "suffix": ""
                },
                {
                    "first": "F",
                    "middle": [
                        "X"
                    ],
                    "last": "Guyette",
                    "suffix": ""
                },
                {
                    "first": "J",
                    "middle": [
                        "B"
                    ],
                    "last": "Brown",
                    "suffix": ""
                },
                {
                    "first": "M",
                    "middle": [
                        "H"
                    ],
                    "last": "Yazer",
                    "suffix": ""
                },
                {
                    "first": "D",
                    "middle": [
                        "J"
                    ],
                    "last": "Triulzi",
                    "suffix": ""
                },
                {
                    "first": "B",
                    "middle": [
                        "J"
                    ],
                    "last": "Early-Young",
                    "suffix": ""
                }
            ],
            "year": 2018,
            "venue": "N Engl J Med",
            "volume": "379",
            "issn": "4",
            "pages": "315--341",
            "other_ids": {
                "DOI": [
                    "10.1056/NEJMoa1802345"
                ]
            }
        },
        "BIBREF8": {
            "ref_id": "b8",
            "title": "Transfusion in trauma: thromboelastometry-guided coagulation factor concentrate-based therapy versus standard fresh frozen plasma-based therapy",
            "authors": [
                {
                    "first": "H",
                    "middle": [],
                    "last": "Schochl",
                    "suffix": ""
                },
                {
                    "first": "U",
                    "middle": [],
                    "last": "Nienaber",
                    "suffix": ""
                },
                {
                    "first": "M",
                    "middle": [],
                    "last": "Maegele",
                    "suffix": ""
                },
                {
                    "first": "G",
                    "middle": [],
                    "last": "Hochleitner",
                    "suffix": ""
                },
                {
                    "first": "F",
                    "middle": [],
                    "last": "Primavesi",
                    "suffix": ""
                },
                {
                    "first": "B",
                    "middle": [],
                    "last": "Steitz",
                    "suffix": ""
                }
            ],
            "year": 2011,
            "venue": "Crit Care",
            "volume": "15",
            "issn": "2",
            "pages": "",
            "other_ids": {
                "DOI": [
                    "10.1186/cc10078"
                ]
            }
        },
        "BIBREF9": {
            "ref_id": "b9",
            "title": "Goal-directed coagulation management of major trauma patients using thromboelastometry (ROTEM)-guided administration of fibrinogen concentrate and prothrombin complex concentrate",
            "authors": [
                {
                    "first": "H",
                    "middle": [],
                    "last": "Schochl",
                    "suffix": ""
                },
                {
                    "first": "U",
                    "middle": [],
                    "last": "Nienaber",
                    "suffix": ""
                },
                {
                    "first": "G",
                    "middle": [],
                    "last": "Hofer",
                    "suffix": ""
                },
                {
                    "first": "W",
                    "middle": [],
                    "last": "Voelckel",
                    "suffix": ""
                },
                {
                    "first": "C",
                    "middle": [],
                    "last": "Jambor",
                    "suffix": ""
                },
                {
                    "first": "G",
                    "middle": [],
                    "last": "Scharbert",
                    "suffix": ""
                }
            ],
            "year": 2010,
            "venue": "Crit Care",
            "volume": "14",
            "issn": "2",
            "pages": "",
            "other_ids": {
                "DOI": [
                    "10.1186/cc8948"
                ]
            }
        },
        "BIBREF10": {
            "ref_id": "b10",
            "title": "Blood transfusions correlate with infections in trauma patients in a dosedependent manner",
            "authors": [
                {
                    "first": "J",
                    "middle": [
                        "A"
                    ],
                    "last": "Claridge",
                    "suffix": ""
                },
                {
                    "first": "R",
                    "middle": [
                        "G"
                    ],
                    "last": "Sawyer",
                    "suffix": ""
                },
                {
                    "first": "A",
                    "middle": [
                        "M"
                    ],
                    "last": "Schulman",
                    "suffix": ""
                },
                {
                    "first": "E",
                    "middle": [
                        "C"
                    ],
                    "last": "Mclemore",
                    "suffix": ""
                },
                {
                    "first": "J",
                    "middle": [
                        "S"
                    ],
                    "last": "Young",
                    "suffix": ""
                }
            ],
            "year": 2002,
            "venue": "Am Surg",
            "volume": "68",
            "issn": "7",
            "pages": "566--72",
            "other_ids": {}
        },
        "BIBREF11": {
            "ref_id": "b11",
            "title": "Blood transfusion. An independent risk factor for postinjury multiple organ failure",
            "authors": [
                {
                    "first": "F",
                    "middle": [
                        "A"
                    ],
                    "last": "Moore",
                    "suffix": ""
                },
                {
                    "first": "E",
                    "middle": [
                        "E"
                    ],
                    "last": "Moore",
                    "suffix": ""
                },
                {
                    "first": "A",
                    "middle": [],
                    "last": "Sauaia",
                    "suffix": ""
                }
            ],
            "year": 1997,
            "venue": "Arch Surg",
            "volume": "132",
            "issn": "6",
            "pages": "620--624",
            "other_ids": {}
        },
        "BIBREF13": {
            "ref_id": "b13",
            "title": "Reversal of trauma-induced coagulopathy using first-line coagulation factor concentrates or fresh frozen plasma (RETIC): a single-centre, parallelgroup, open-label, randomised trial",
            "authors": [
                {
                    "first": "P",
                    "middle": [],
                    "last": "Innerhofer",
                    "suffix": ""
                },
                {
                    "first": "D",
                    "middle": [],
                    "last": "Fries",
                    "suffix": ""
                },
                {
                    "first": "M",
                    "middle": [],
                    "last": "Mittermayr",
                    "suffix": ""
                },
                {
                    "first": "N",
                    "middle": [],
                    "last": "Innerhofer",
                    "suffix": ""
                },
                {
                    "first": "D",
                    "middle": [],
                    "last": "Von Langen",
                    "suffix": ""
                },
                {
                    "first": "T",
                    "middle": [],
                    "last": "Hell",
                    "suffix": ""
                }
            ],
            "year": 2017,
            "venue": "Lancet Haematol",
            "volume": "4",
            "issn": "6",
            "pages": "30077--30084",
            "other_ids": {
                "DOI": [
                    "10.1016/S2352-3026(17)30077-7"
                ]
            }
        },
        "BIBREF14": {
            "ref_id": "b14",
            "title": "Prothrombin complex concentrate versus fresh-frozen plasma for reversal of coagulopathy of trauma: is there a difference?",
            "authors": [
                {
                    "first": "B",
                    "middle": [],
                    "last": "Joseph",
                    "suffix": ""
                },
                {
                    "first": "H",
                    "middle": [],
                    "last": "Aziz",
                    "suffix": ""
                },
                {
                    "first": "V",
                    "middle": [],
                    "last": "Pandit",
                    "suffix": ""
                },
                {
                    "first": "D",
                    "middle": [],
                    "last": "Hays",
                    "suffix": ""
                },
                {
                    "first": "N",
                    "middle": [],
                    "last": "Kulvatunyou",
                    "suffix": ""
                },
                {
                    "first": "Z",
                    "middle": [],
                    "last": "Yousuf",
                    "suffix": ""
                }
            ],
            "year": 2014,
            "venue": "World J Surg",
            "volume": "38",
            "issn": "8",
            "pages": "1875--81",
            "other_ids": {
                "DOI": [
                    "10.1007/s00268-014-2631-y"
                ]
            }
        },
        "BIBREF15": {
            "ref_id": "b15",
            "title": "Early prediction of massive transfusion in trauma: simple as ABC (assessment of blood consumption)?",
            "authors": [
                {
                    "first": "T",
                    "middle": [
                        "C"
                    ],
                    "last": "Nunez",
                    "suffix": ""
                },
                {
                    "first": "I",
                    "middle": [
                        "V"
                    ],
                    "last": "Voskresensky",
                    "suffix": ""
                },
                {
                    "first": "L",
                    "middle": [
                        "A"
                    ],
                    "last": "Dossett",
                    "suffix": ""
                },
                {
                    "first": "R",
                    "middle": [],
                    "last": "Shinall",
                    "suffix": ""
                },
                {
                    "first": "W",
                    "middle": [
                        "D"
                    ],
                    "last": "Dutton",
                    "suffix": ""
                },
                {
                    "first": "B",
                    "middle": [
                        "A"
                    ],
                    "last": "Cotton",
                    "suffix": ""
                }
            ],
            "year": 2009,
            "venue": "J Trauma",
            "volume": "66",
            "issn": "2",
            "pages": "346--52",
            "other_ids": {
                "DOI": [
                    "10.1097/TA.0b013e3181961c35"
                ]
            }
        },
        "BIBREF16": {
            "ref_id": "b16",
            "title": "Reduced mortality by meeting guideline criteria before using recombinant activated factor VII in severe trauma patients with massive bleeding",
            "authors": [
                {
                    "first": "J",
                    "middle": [
                        "F"
                    ],
                    "last": "Payen",
                    "suffix": ""
                },
                {
                    "first": "M",
                    "middle": [],
                    "last": "Berthet",
                    "suffix": ""
                },
                {
                    "first": "C",
                    "middle": [],
                    "last": "Genty",
                    "suffix": ""
                },
                {
                    "first": "P",
                    "middle": [],
                    "last": "Declety",
                    "suffix": ""
                },
                {
                    "first": "D",
                    "middle": [],
                    "last": "Garrigue-Huet",
                    "suffix": ""
                },
                {
                    "first": "N",
                    "middle": [],
                    "last": "Morel",
                    "suffix": ""
                }
            ],
            "year": 2016,
            "venue": "Br J Anaesth",
            "volume": "117",
            "issn": "4",
            "pages": "470--476",
            "other_ids": {
                "DOI": [
                    "10.1093/bja/aew276"
                ]
            }
        },
        "BIBREF17": {
            "ref_id": "b17",
            "title": "The European guideline on management of major bleeding and coagulopathy following trauma: fourth edition",
            "authors": [
                {
                    "first": "R",
                    "middle": [],
                    "last": "Rossaint",
                    "suffix": ""
                },
                {
                    "first": "B",
                    "middle": [],
                    "last": "Bouillon",
                    "suffix": ""
                },
                {
                    "first": "V",
                    "middle": [],
                    "last": "Cerny",
                    "suffix": ""
                },
                {
                    "first": "T",
                    "middle": [
                        "J"
                    ],
                    "last": "Coats",
                    "suffix": ""
                },
                {
                    "first": "J",
                    "middle": [],
                    "last": "Duranteau",
                    "suffix": ""
                },
                {
                    "first": "E",
                    "middle": [],
                    "last": "Fernandez-Mondejar",
                    "suffix": ""
                }
            ],
            "year": 2016,
            "venue": "Crit Care",
            "volume": "20",
            "issn": "1",
            "pages": "",
            "other_ids": {
                "DOI": [
                    "10.1186/s13054-016-1265-x"
                ]
            }
        },
        "BIBREF18": {
            "ref_id": "b18",
            "title": "Effects of tranexamic acid on death, vascular occlusive events, and blood transfusion in trauma patients with significant haemorrhage (CRASH-2): a randomised, placebo-controlled trial",
            "authors": [
                {
                    "first": "",
                    "middle": [],
                    "last": "Collaborators C-T",
                    "suffix": ""
                },
                {
                    "first": "H",
                    "middle": [],
                    "last": "Shakur",
                    "suffix": ""
                },
                {
                    "first": "I",
                    "middle": [],
                    "last": "Roberts",
                    "suffix": ""
                },
                {
                    "first": "R",
                    "middle": [],
                    "last": "Bautista",
                    "suffix": ""
                },
                {
                    "first": "J",
                    "middle": [],
                    "last": "Caballero",
                    "suffix": ""
                },
                {
                    "first": "T",
                    "middle": [],
                    "last": "Coats",
                    "suffix": ""
                }
            ],
            "year": 2010,
            "venue": "Lancet",
            "volume": "376",
            "issn": "9734",
            "pages": "23--32",
            "other_ids": {}
        },
        "BIBREF19": {
            "ref_id": "b19",
            "title": "Modelling the association between fibrinogen concentration on admission and mortality in patients with massive transfusion after severe trauma: an analysis of a large regional database",
            "authors": [
                {
                    "first": "P",
                    "middle": [],
                    "last": "Bouzat",
                    "suffix": ""
                },
                {
                    "first": "F",
                    "middle": [
                        "X"
                    ],
                    "last": "Ageron",
                    "suffix": ""
                },
                {
                    "first": "J",
                    "middle": [],
                    "last": "Charbit",
                    "suffix": ""
                },
                {
                    "first": "X",
                    "middle": [],
                    "last": "Bobbia",
                    "suffix": ""
                },
                {
                    "first": "P",
                    "middle": [],
                    "last": "Deras",
                    "suffix": ""
                },
                {
                    "first": "Jbd",
                    "middle": [],
                    "last": "Nugues",
                    "suffix": ""
                }
            ],
            "year": 2018,
            "venue": "Scand J Trauma Resusc Emerg Med",
            "volume": "26",
            "issn": "1",
            "pages": "",
            "other_ids": {
                "DOI": [
                    "10.1186/s13049-018-0523-0"
                ]
            }
        },
        "BIBREF20": {
            "ref_id": "b20",
            "title": "Diagnostic performance of thromboelastometry in trauma-induced coagulopathy: a comparison between two level I trauma centres using two different devices",
            "authors": [
                {
                    "first": "P",
                    "middle": [],
                    "last": "Bouzat",
                    "suffix": ""
                },
                {
                    "first": "R",
                    "middle": [],
                    "last": "Guerin",
                    "suffix": ""
                },
                {
                    "first": "B",
                    "middle": [],
                    "last": "Boussat",
                    "suffix": ""
                },
                {
                    "first": "Nicolas",
                    "middle": [
                        "J"
                    ],
                    "last": "Lambert",
                    "suffix": ""
                },
                {
                    "first": "A",
                    "middle": [],
                    "last": "Greze",
                    "suffix": ""
                },
                {
                    "first": "J",
                    "middle": [],
                    "last": "",
                    "suffix": ""
                }
            ],
            "year": 2021,
            "venue": "Eur J Trauma Emerg Surg",
            "volume": "47",
            "issn": "2",
            "pages": "343--51",
            "other_ids": {}
        },
        "BIBREF21": {
            "ref_id": "b21",
            "title": "Effect of lowdose supplementation of arginine vasopressin on need for blood product transfusions in patients with trauma and hemorrhagic shock: a randomized clinical trial",
            "authors": [
                {
                    "first": "C",
                    "middle": [
                        "A"
                    ],
                    "last": "Sims",
                    "suffix": ""
                },
                {
                    "first": "D",
                    "middle": [],
                    "last": "Holena",
                    "suffix": ""
                },
                {
                    "first": "P",
                    "middle": [],
                    "last": "Kim",
                    "suffix": ""
                },
                {
                    "first": "J",
                    "middle": [],
                    "last": "Pascual",
                    "suffix": ""
                },
                {
                    "first": "B",
                    "middle": [],
                    "last": "Smith",
                    "suffix": ""
                },
                {
                    "first": "N",
                    "middle": [],
                    "last": "Martin",
                    "suffix": ""
                }
            ],
            "year": 2019,
            "venue": "JAMA Surg",
            "volume": "154",
            "issn": "11",
            "pages": "994--1003",
            "other_ids": {
                "DOI": [
                    "10.1001/jamasurg.2019.2884"
                ]
            }
        },
        "BIBREF22": {
            "ref_id": "b22",
            "title": "Allogeneic blood transfusion increases the risk of postoperative bacterial infection: a metaanalysis",
            "authors": [
                {
                    "first": "G",
                    "middle": [
                        "E"
                    ],
                    "last": "Hill",
                    "suffix": ""
                },
                {
                    "first": "W",
                    "middle": [
                        "H"
                    ],
                    "last": "Frawley",
                    "suffix": ""
                },
                {
                    "first": "K",
                    "middle": [
                        "E"
                    ],
                    "last": "Griffith",
                    "suffix": ""
                },
                {
                    "first": "J",
                    "middle": [
                        "E"
                    ],
                    "last": "Forestner",
                    "suffix": ""
                },
                {
                    "first": "J",
                    "middle": [
                        "P"
                    ],
                    "last": "Minei",
                    "suffix": ""
                }
            ],
            "year": 2003,
            "venue": "J Trauma",
            "volume": "54",
            "issn": "5",
            "pages": "908--922",
            "other_ids": {
                "DOI": [
                    "10.1097/01.TA.0000022460.21283.53"
                ]
            }
        },
        "BIBREF23": {
            "ref_id": "b23",
            "title": "Factors affecting mortality in older trauma patients-a systematic review and meta-analysis",
            "authors": [
                {
                    "first": "I",
                    "middle": [],
                    "last": "Sammy",
                    "suffix": ""
                },
                {
                    "first": "F",
                    "middle": [],
                    "last": "Lecky",
                    "suffix": ""
                },
                {
                    "first": "A",
                    "middle": [],
                    "last": "Sutton",
                    "suffix": ""
                },
                {
                    "first": "J",
                    "middle": [],
                    "last": "Leaviss",
                    "suffix": ""
                },
                {
                    "first": "O",
                    "middle": [],
                    "last": "&apos;cathain",
                    "suffix": ""
                },
                {
                    "first": "A",
                    "middle": [],
                    "last": "",
                    "suffix": ""
                }
            ],
            "year": 2016,
            "venue": "Injury",
            "volume": "47",
            "issn": "6",
            "pages": "1170--83",
            "other_ids": {
                "DOI": [
                    "10.1016/j.injury.2016.02.027"
                ]
            }
        },
        "BIBREF24": {
            "ref_id": "b24",
            "title": "explanation and elaboration: updated guidelines for reporting parallel group randomised trials",
            "authors": [
                {
                    "first": "D",
                    "middle": [],
                    "last": "Moher",
                    "suffix": ""
                },
                {
                    "first": "S",
                    "middle": [],
                    "last": "Hopewell",
                    "suffix": ""
                },
                {
                    "first": "K",
                    "middle": [
                        "F"
                    ],
                    "last": "Schulz",
                    "suffix": ""
                },
                {
                    "first": "V",
                    "middle": [],
                    "last": "Montori",
                    "suffix": ""
                },
                {
                    "first": "P",
                    "middle": [
                        "C"
                    ],
                    "last": "Gotzsche",
                    "suffix": ""
                },
                {
                    "first": "P",
                    "middle": [
                        "J"
                    ],
                    "last": "Devereaux",
                    "suffix": ""
                }
            ],
            "year": 2010,
            "venue": "Int J Surg",
            "volume": "10",
            "issn": "1",
            "pages": "28--55",
            "other_ids": {
                "DOI": [
                    "10.1016/j.ijsu.2011.10.001"
                ]
            }
        },
        "BIBREF25": {
            "ref_id": "b25",
            "title": "Blood transfusion and cancer surgery outcomes: a continued reason for concern",
            "authors": [
                {
                    "first": "W",
                    "middle": [
                        "B"
                    ],
                    "last": "Al-Refaie",
                    "suffix": ""
                },
                {
                    "first": "H",
                    "middle": [
                        "M"
                    ],
                    "last": "Parsons",
                    "suffix": ""
                },
                {
                    "first": "A",
                    "middle": [],
                    "last": "Markin",
                    "suffix": ""
                },
                {
                    "first": "J",
                    "middle": [],
                    "last": "Abrams",
                    "suffix": ""
                },
                {
                    "first": "E",
                    "middle": [
                        "B"
                    ],
                    "last": "Habermann",
                    "suffix": ""
                }
            ],
            "year": 2012,
            "venue": "Surgery",
            "volume": "152",
            "issn": "3",
            "pages": "344--54",
            "other_ids": {
                "DOI": [
                    "10.1016/j.surg.2012.06.008"
                ]
            }
        },
        "BIBREF26": {
            "ref_id": "b26",
            "title": "Association between intraoperative blood transfusion and mortality and morbidity in patients undergoing noncardiac surgery",
            "authors": [
                {
                    "first": "L",
                    "middle": [
                        "G"
                    ],
                    "last": "Glance",
                    "suffix": ""
                },
                {
                    "first": "A",
                    "middle": [
                        "W"
                    ],
                    "last": "Dick",
                    "suffix": ""
                },
                {
                    "first": "D",
                    "middle": [
                        "B"
                    ],
                    "last": "Mukamel",
                    "suffix": ""
                },
                {
                    "first": "F",
                    "middle": [
                        "J"
                    ],
                    "last": "Fleming",
                    "suffix": ""
                },
                {
                    "first": "R",
                    "middle": [
                        "A"
                    ],
                    "last": "Zollo",
                    "suffix": ""
                },
                {
                    "first": "R",
                    "middle": [],
                    "last": "Wissler",
                    "suffix": ""
                }
            ],
            "year": 2011,
            "venue": "Anesthesiology",
            "volume": "114",
            "issn": "2",
            "pages": "283--92",
            "other_ids": {
                "DOI": [
                    "10.1097/ALN.0b013e3182054d06"
                ]
            }
        },
        "BIBREF27": {
            "ref_id": "b27",
            "title": "Morbidity and mortality after massive transfusion in patients undergoing non-cardiac surgery",
            "authors": [
                {
                    "first": "A",
                    "middle": [],
                    "last": "Turan",
                    "suffix": ""
                },
                {
                    "first": "D",
                    "middle": [],
                    "last": "Yang",
                    "suffix": ""
                },
                {
                    "first": "A",
                    "middle": [],
                    "last": "Bonilla",
                    "suffix": ""
                },
                {
                    "first": "A",
                    "middle": [],
                    "last": "Shiba",
                    "suffix": ""
                },
                {
                    "first": "D",
                    "middle": [
                        "I"
                    ],
                    "last": "Sessler",
                    "suffix": ""
                },
                {
                    "first": "L",
                    "middle": [],
                    "last": "Saager",
                    "suffix": ""
                }
            ],
            "year": 2013,
            "venue": "Can J Anaesth",
            "volume": "60",
            "issn": "8",
            "pages": "761--70",
            "other_ids": {
                "DOI": [
                    "10.1007/s12630-013-9937-3"
                ]
            }
        },
        "BIBREF28": {
            "ref_id": "b28",
            "title": "Increased rate of infection associated with transfusion of old blood after severe injury",
            "authors": [
                {
                    "first": "P",
                    "middle": [
                        "J"
                    ],
                    "last": "Offner",
                    "suffix": ""
                },
                {
                    "first": "E",
                    "middle": [
                        "E"
                    ],
                    "last": "Moore",
                    "suffix": ""
                },
                {
                    "first": "W",
                    "middle": [
                        "L"
                    ],
                    "last": "Biffl",
                    "suffix": ""
                },
                {
                    "first": "J",
                    "middle": [
                        "L"
                    ],
                    "last": "Johnson",
                    "suffix": ""
                },
                {
                    "first": "C",
                    "middle": [
                        "C"
                    ],
                    "last": "Silliman",
                    "suffix": ""
                }
            ],
            "year": null,
            "venue": "",
            "volume": "",
            "issn": "",
            "pages": "",
            "other_ids": {}
        },
        "BIBREF30": {
            "ref_id": "b30",
            "title": "Sufficient thrombin generation despite 95% hemodilution: an in vitro experimental study",
            "authors": [
                {
                    "first": "J",
                    "middle": [],
                    "last": "Gratz",
                    "suffix": ""
                },
                {
                    "first": "C",
                    "middle": [
                        "J"
                    ],
                    "last": "Schlimp",
                    "suffix": ""
                },
                {
                    "first": "M",
                    "middle": [],
                    "last": "Honickel",
                    "suffix": ""
                },
                {
                    "first": "N",
                    "middle": [],
                    "last": "Hochhausen",
                    "suffix": ""
                },
                {
                    "first": "H",
                    "middle": [],
                    "last": "Schochl",
                    "suffix": ""
                },
                {
                    "first": "O",
                    "middle": [],
                    "last": "Grottke",
                    "suffix": ""
                }
            ],
            "year": 2020,
            "venue": "J Clin Med",
            "volume": "9",
            "issn": "12",
            "pages": "",
            "other_ids": {}
        },
        "BIBREF31": {
            "ref_id": "b31",
            "title": "Comparison of fresh frozen plasma vs. coagulation factor concentrates for reconstitution of blood: an in vitro study",
            "authors": [
                {
                    "first": "J",
                    "middle": [],
                    "last": "Gratz",
                    "suffix": ""
                },
                {
                    "first": "M",
                    "middle": [],
                    "last": "Ponschab",
                    "suffix": ""
                },
                {
                    "first": "G",
                    "middle": [
                        "E"
                    ],
                    "last": "Iapichino",
                    "suffix": ""
                },
                {
                    "first": "C",
                    "middle": [
                        "J"
                    ],
                    "last": "Schlimp",
                    "suffix": ""
                },
                {
                    "first": "J",
                    "middle": [],
                    "last": "Cadamuro",
                    "suffix": ""
                },
                {
                    "first": "O",
                    "middle": [],
                    "last": "Grottke",
                    "suffix": ""
                }
            ],
            "year": 2020,
            "venue": "Eur J Anaesthesiol",
            "volume": "37",
            "issn": "10",
            "pages": "879--88",
            "other_ids": {
                "DOI": [
                    "10.1097/EJA.0000000000001202"
                ]
            }
        },
        "BIBREF32": {
            "ref_id": "b32",
            "title": "Endogenous thrombin potential following hemostatic therapy with 4-factor prothrombin complex concentrate: a 7-day observational study of trauma patients",
            "authors": [
                {
                    "first": "H",
                    "middle": [],
                    "last": "Schochl",
                    "suffix": ""
                },
                {
                    "first": "W",
                    "middle": [],
                    "last": "Voelckel",
                    "suffix": ""
                },
                {
                    "first": "M",
                    "middle": [],
                    "last": "Maegele",
                    "suffix": ""
                },
                {
                    "first": "L",
                    "middle": [],
                    "last": "Kirchmair",
                    "suffix": ""
                },
                {
                    "first": "C",
                    "middle": [
                        "J"
                    ],
                    "last": "Schlimp",
                    "suffix": ""
                }
            ],
            "year": 2014,
            "venue": "Crit Care",
            "volume": "18",
            "issn": "4",
            "pages": "",
            "other_ids": {
                "DOI": [
                    "10.1186/cc13982"
                ]
            }
        },
        "BIBREF33": {
            "ref_id": "b33",
            "title": "French legal approach to clinical research",
            "authors": [
                {
                    "first": "E",
                    "middle": [],
                    "last": "Toulouse",
                    "suffix": ""
                },
                {
                    "first": "C",
                    "middle": [],
                    "last": "Masseguin",
                    "suffix": ""
                },
                {
                    "first": "B",
                    "middle": [],
                    "last": "Lafont",
                    "suffix": ""
                },
                {
                    "first": "G",
                    "middle": [],
                    "last": "Mcgurk",
                    "suffix": ""
                },
                {
                    "first": "A",
                    "middle": [],
                    "last": "Harbonn",
                    "suffix": ""
                },
                {
                    "first": "",
                    "middle": [],
                    "last": "Jar",
                    "suffix": ""
                }
            ],
            "year": 2018,
            "venue": "Anaesth Crit Care Pain Med",
            "volume": "37",
            "issn": "6",
            "pages": "607--621",
            "other_ids": {
                "DOI": [
                    "10.1016/j.accpm.2018.10.013"
                ]
            }
        },
        "BIBREF34": {
            "ref_id": "b34",
            "title": "Publisher's Note",
            "authors": [],
            "year": null,
            "venue": "",
            "volume": "",
            "issn": "",
            "pages": "",
            "other_ids": {}
        },
        "BIBREF35": {
            "ref_id": "b35",
            "title": "Springer Nature remains neutral with regard to jurisdictional claims in published maps and institutional affiliations",
            "authors": [],
            "year": null,
            "venue": "",
            "volume": "",
            "issn": "",
            "pages": "",
            "other_ids": {}
        }
    },
    "ref_entries": {
        "FIGREF0": {
            "text": "Design",
            "latex": null,
            "type": "figure"
        },
        "FIGREF1": {
            "text": "Abbreviations DSMB: Data safety monitoring board; eCRF: Electronic case report form; FFP: Fresh frozen plasma; GOSE: Glasgow Outcome Scale Extended; ICU: Intensive care unit; NaCl: Normal saline; PCC: Prothrombin complex concentrate; RBC: Red blood cell Authors' contributions {31b} PB and JFP designed the trial. JLB was in charge of the statistical plan. JSD, BR, and JD extensively revised the protocol. The authors approved the final version of the manuscript.",
            "latex": null,
            "type": "figure"
        },
        "FIGREF2": {
            "text": "Competing interests {28}PB, JSD, BR, JD, and JFP received payments from LFB, Les Ullis, France, for lectures and educational content. The other author declares no competing interests.Author details1 Pôle Anesthésie-Réanimation, Centre Hospitalo-Universitaire Grenoble-Alpes, Grenoble, France. 2 Univ. Grenoble Alpes, CNRS, Public Health department CHU Grenoble Alpes, TIMC-IMAG, 38000 Grenoble, France. 3 Service d'Anesthésie Réanimation, Centre Hospitalo-Universitaire Lyon-Sud, Faculté de Médecine Lyon-Est, Université Claude Bernard Lyon 1, Lyon, France.",
            "latex": null,
            "type": "figure"
        }
    },
    "back_matter": [
        {
            "text": "We thank patients and their relatives, physicians, nurses, and clinical research staff of the participating centers for their involvement in this study. We thank Dr. Audrey Lehmann, Anaïs Adolle, Pauline Manhes, Marion Richard, Aline Baron, and Jennifer Margier for their involvement in the study design and/or study oversight. ",
            "cite_spans": [],
            "ref_spans": [],
            "section": "Acknowledgements"
        }
    ]
}