{
    "paper_id": "0a8b53713d1e4ce4c3885c77de271dc2db166f53",
    "metadata": {
        "title": "A bispecific monomeric nanobody induces spike trimer dimers and neutralizes SARS-CoV-2 in vivo Spain",
        "authors": [
            {
                "first": "Leo",
                "middle": [],
                "last": "Hanke",
                "suffix": "",
                "affiliation": {
                    "laboratory": "",
                    "institution": "Karolinska Institutet",
                    "location": {
                        "settlement": "Stockholm"
                    }
                },
                "email": ""
            },
            {
                "first": "Hrishikesh",
                "middle": [],
                "last": "Das",
                "suffix": "",
                "affiliation": {},
                "email": ""
            },
            {
                "first": "Daniel",
                "middle": [
                    "J"
                ],
                "last": "Sheward",
                "suffix": "",
                "affiliation": {
                    "laboratory": "",
                    "institution": "Karolinska Institutet",
                    "location": {
                        "settlement": "Stockholm"
                    }
                },
                "email": ""
            },
            {
                "first": "Laura",
                "middle": [],
                "last": "Perez Vidakovics",
                "suffix": "",
                "affiliation": {
                    "laboratory": "",
                    "institution": "Karolinska Institutet",
                    "location": {
                        "settlement": "Stockholm"
                    }
                },
                "email": ""
            },
            {
                "first": "Egon",
                "middle": [],
                "last": "Urgard",
                "suffix": "",
                "affiliation": {
                    "laboratory": "",
                    "institution": "Karolinska Institutet",
                    "location": {
                        "settlement": "Stockholm"
                    }
                },
                "email": ""
            },
            {
                "first": "Ainhoa",
                "middle": [],
                "last": "Moliner-Morro",
                "suffix": "",
                "affiliation": {
                    "laboratory": "",
                    "institution": "Karolinska Institutet",
                    "location": {
                        "settlement": "Stockholm"
                    }
                },
                "email": ""
            },
            {
                "first": "Changil",
                "middle": [],
                "last": "Kim",
                "suffix": "",
                "affiliation": {
                    "laboratory": "",
                    "institution": "Karolinska Institutet",
                    "location": {
                        "settlement": "Stockholm"
                    }
                },
                "email": ""
            },
            {
                "first": "Vivien",
                "middle": [],
                "last": "Karl",
                "suffix": "",
                "affiliation": {
                    "laboratory": "",
                    "institution": "Karolinska Institutet",
                    "location": {
                        "settlement": "Stockholm"
                    }
                },
                "email": ""
            },
            {
                "first": "Alec",
                "middle": [],
                "last": "Pankow",
                "suffix": "",
                "affiliation": {
                    "laboratory": "",
                    "institution": "Karolinska Institutet",
                    "location": {
                        "settlement": "Stockholm"
                    }
                },
                "email": ""
            },
            {
                "first": "Natalie",
                "middle": [
                    "L"
                ],
                "last": "Smith",
                "suffix": "",
                "affiliation": {
                    "laboratory": "",
                    "institution": "Karolinska Institutet",
                    "location": {
                        "settlement": "Stockholm"
                    }
                },
                "email": ""
            },
            {
                "first": "Bartlomiej",
                "middle": [],
                "last": "Porebski",
                "suffix": "",
                "affiliation": {
                    "laboratory": "Science for Life Laboratory, Division of Genome Biology",
                    "institution": "Karolinska Institute",
                    "location": {
                        "settlement": "Stockholm",
                        "country": "Sweden"
                    }
                },
                "email": ""
            },
            {
                "first": "Oscar",
                "middle": [],
                "last": "Fernandez-Capetillo",
                "suffix": "",
                "affiliation": {
                    "laboratory": "Science for Life Laboratory, Division of Genome Biology",
                    "institution": "Karolinska Institute",
                    "location": {
                        "settlement": "Stockholm",
                        "country": "Sweden"
                    }
                },
                "email": ""
            },
            {
                "first": "Erdinc",
                "middle": [],
                "last": "Sezgin",
                "suffix": "",
                "affiliation": {
                    "laboratory": "Science for Life Laboratory",
                    "institution": "",
                    "location": {
                        "addrLine": "Karolinska 16 Institutet",
                        "settlement": "Stockholm",
                        "country": "Sweden"
                    }
                },
                "email": ""
            },
            {
                "first": "Gabriel",
                "middle": [
                    "K"
                ],
                "last": "Pedersen",
                "suffix": "",
                "affiliation": {
                    "laboratory": "",
                    "institution": "Statens Serum Institut",
                    "location": {
                        "settlement": "Copenhagen",
                        "country": "Denmark 18"
                    }
                },
                "email": ""
            },
            {
                "first": "Jonathan",
                "middle": [
                    "M"
                ],
                "last": "Coquet",
                "suffix": "",
                "affiliation": {
                    "laboratory": "",
                    "institution": "Karolinska Institutet",
                    "location": {
                        "settlement": "Stockholm"
                    }
                },
                "email": ""
            },
            {
                "first": "Martin",
                "middle": [],
                "last": "Hällberg",
                "suffix": "",
                "affiliation": {},
                "email": "martin.hallberg@ki.se"
            },
            {
                "first": "Ben",
                "middle": [],
                "last": "Murrell",
                "suffix": "",
                "affiliation": {
                    "laboratory": "",
                    "institution": "Karolinska Institutet",
                    "location": {
                        "settlement": "Stockholm"
                    }
                },
                "email": "benjamin.murrell@ki.se"
            },
            {
                "first": "Gerald",
                "middle": [
                    "M"
                ],
                "last": "Mcinerney",
                "suffix": "",
                "affiliation": {
                    "laboratory": "",
                    "institution": "Karolinska Institutet",
                    "location": {
                        "settlement": "Stockholm"
                    }
                },
                "email": "gerald.mcinerney@ki.se"
            }
        ]
    },
    "abstract": [
        {
            "text": "Antibodies binding to the severe acute respiratory syndrome coronavirus 2 (SARS-CoV-2) spike 32 have therapeutic promise, but emerging variants show the potential for virus escape. This 33 emphasizes the need for therapeutic molecules with distinct and novel neutralization 34 mechanisms. Here we isolated a nanobody that interacts simultaneously with two RBDs from 35 different spike trimers of SARS-CoV-2, rapidly inducing the formation of spike trimer-dimers 36 leading to the loss of their ability to attach to the host cell receptor, ACE2. We show that this 37 nanobody potently neutralizes SARS-CoV-2, including the B.1.351 variant, and cross-neutralizes 38 SARS-CoV. Furthermore, we demonstrate the therapeutic potential of the nanobody against 39 SARS-CoV-2 and the B.1.351 variant in a human ACE2 transgenic mouse model. This naturally 40 elicited bispecific monomeric nanobody establishes a novel strategy for potent inactivation of 41 viral antigens and represents a promising antiviral against emerging SARS-CoV-2 variants. 42 43 44 45 46 47 48 49 50 51 52 53 54",
            "cite_spans": [],
            "ref_spans": [],
            "section": "Abstract"
        },
        {
            "text": "The SARS-CoV-2 pandemic and the vast societal and economic consequences of the connected 55 lockdowns have had devastating consequences for the world's populations. Despite rapid 56 progress in vaccine development, some emerging virus variants appear to be less effectively 57 neutralized by antibodies elicited by the first-generation vaccines 1 and the emergence of further 58 variants is expected. To prepare for different scenarios and to have emergency alternatives at 59 hand, novel ways to inhibit and neutralize the virus and variants of concern are needed. As 60 therapeutic agents in the early phases of SARS-CoV-2 infection, camelid-derived single-domain 61 antibody fragments are promising candidates. These so-called 'nanobodies' not only bind their 62 antigen with very high specificity and affinity, but they can also be easily produced to large 63 quantities in E. coli 2 and show favorable biochemical characteristics, including good thermal 64 stability. Importantly, they can easily be combined to form homo-and heterodimers or other 65 multimers to increase potency and target multiple epitopes simultaneously 3-5 . This strategy 66 allows the neutralization of multiple known or unknown virus variants and reduces the risk for 67 viral escape 5 .",
            "cite_spans": [],
            "ref_spans": [],
            "section": "Abstract"
        },
        {
            "text": "The attachment of SARS-CoV-2 to the host cell receptor ACE2 and subsequent 69 membrane fusion is mediated by the viral spike (S) protein 6 . In the prefusion conformation, the 70 spike is a large homotrimer. Each S monomer consists of two subunits: S1 and S2. The S1 71 subunit contains the receptor binding domain (RBD) and S2 contains the fusion peptide, as well 72 as the transmembrane domain. The RBD is responsible for the initial attachment to ACE2 and is 73 found in two distinct conformational states: The receptor-accessible 'up' conformation and the 74 receptor inaccessible 'down' conformation 6,7 . Receptor binding induces the rather unstable 3-up 75 state, which leads to shedding of S1 and refolding of S2 thereby presenting the fusion peptide to 76 the opposing membrane 6,8,9 . SARS-CoV-2 is easily neutralized by high-affinity binding 77 4 antibodies and other spike-targeting molecules, including nanobodies 10-13 . Many of them bind to, 78 or close to, the receptor binding motif of the RBD and neutralize by directly hindering virus 79 attachment 14,15 . Other mechanisms include locking the RBDs in the down conformation or 80 preventing productive fusion 5,16 . Still, the emergence of new virus variants that evade antibody-81 mediated neutralization mandates the identification of molecules with a more diverse set of 82 binding epitopes and neutralization mechanisms allowing for neutralization of a variety of virus 83 variants. Here, we generated a nanobody that has two non-overlapping interaction sites on the 84 SARS-CoV-2 RBD, each targeting a different epitope, which induces the formation of dimers of 85 spike trimers and rescues mice from lethal SARS-CoV-2 infection.",
            "cite_spans": [],
            "ref_spans": [],
            "section": "Abstract"
        },
        {
            "text": "86 87",
            "cite_spans": [],
            "ref_spans": [],
            "section": "Abstract"
        },
        {
            "text": "Results",
            "cite_spans": [],
            "ref_spans": [],
            "section": "Abstract"
        },
        {
            "text": "Isolation and characterization of a potent RBD-specific nanobody. 89 To identify nanobodies with unique mode of neutralization, we immunized one alpaca (Funny) 90 with recombinant SARS-CoV-2 spike protein and RBD. We isolated RNA from peripheral blood 91 mononuclear cells and created phagemid libraries. Phage display screens with immobilized RBD 92 identified one promising nanobody, called Fu2. Since multimerization of nanobodies can 93 substantially improve virus neutralization potency 3,17 , we created three different dimers 94 (illustrated in Fig. 1A): An Fu2-Fc fusion expressed in mammalian cells, a chemically linked 95",
            "cite_spans": [],
            "ref_spans": [],
            "section": "Abstract"
        },
        {
            "text": "Fu2 homodimer, and thirdly, a heterodimer of Fu2 with a previously described RBD-specific 96 neutralizing nanobody Ty1 14 . Chemically-linked constructs were generated using a combination 97 of sortase A labelling and Cu-free click-chemistry as described in detail previously 3 .",
            "cite_spans": [],
            "ref_spans": [],
            "section": "Abstract"
        },
        {
            "text": "Using a pseudotyped lentivirus (PSV) neutralization assay (Fig. 1B) , we found that 99 monomeric Fu2 was approximately 10-times more potent than Ty1, with an IC50 in the range of 100 106 ng/ml (7 nM). The Fu2-Fc fusion only slightly increased the neutralization potency of this 101 5 nanobody to 61 ng/ml (0.75 nM), and a chemical homo-dimerization to an IC50 of 26 ng/ml (0.8 102 nM). Thus, the observed enhancement in potency is attributable to dimerization, rather than the 103 Fc-domain itself. Interestingly, the Fu2-Ty1 heterodimer was extremely potent, with an IC50 of 4 104 ng/ml (140 pM) which is approximately 6-fold lower than that of the Fu2 homodimer. Fu2 105 directly prevented spike binding to ACE2 as confirmed by flow cytometry of HEK293T-hACE2 106 cells stained with recombinant, fluorescently labelled spike (+/-Fu2) (Fig. 1C). Analysis of 107 binding kinetics by surface plasmon resonance (SPR) revealed that Fu2 bound the RBD with 108 sub-nanomolar affinity (Fig. 1D). A 1:1 binding model fit the sensorgrams well at the used 109 concentration range, indicating a single dominant interaction. Analysis of next-generation 110 sequencing data for other members of the Fu2 lineage yielded several Fu2-variants with similar 111 properties (Figs. S1A-E).",
            "cite_spans": [],
            "ref_spans": [
                {
                    "start": 58,
                    "end": 67,
                    "text": "(Fig. 1B)",
                    "ref_id": null
                }
            ],
            "section": "Abstract"
        },
        {
            "text": "112",
            "cite_spans": [],
            "ref_spans": [],
            "section": "Abstract"
        },
        {
            "text": "To test the integrity of the recombinant spike protein after the addition of Fu2, we 113 analyzed the size-exclusion chromatography elution profiles in combination with different 114 nanobody constructs (Fig. 1E) . The SARS-CoV-2 spike trimer eluted in a single peak and the 115 addition of Ty1 14 did not result in a shift in the position of this peak, which is expected given the 116 small relative size addition of the 14 kDa nanobody to the large (>400 kDa) spike trimer. In 117 contrast, the addition of Fu2 resulted in a substantial shift of the peak, suggesting the formation 118 of a larger complex, likely a dimer of the spike trimer. Next, we combined the spike with the 119 Fu2-Ty1 heterodimer. This also resulted in earlier elution, and besides a possible spike dimer, 120 this construct gave rise to an even earlier elution peak suggesting the induction of higher-order 121 spike multimers.",
            "cite_spans": [],
            "ref_spans": [
                {
                    "start": 203,
                    "end": 212,
                    "text": "(Fig. 1E)",
                    "ref_id": null
                }
            ],
            "section": "Abstract"
        },
        {
            "text": "To test if the Fu2-induced multimerization of spike also occurs when it is presented 123 on virus particles, we analyzed GFP-labeled SARS-CoV-2 pseudotyped lentiviruses (PSV-GFP) 124 after addition of the nanobodies Ty1 or Fu2 (Fig. 1F) . To this end, we performed fluorescence 125 6 correlation spectroscopy and measured apparent brightness of each diffusing particle. The 126 majority of single diffusing particles preincubated with Fu2 showed a 2.5-fold increase in 127 brightness compared to PSV-GFP alone or preincubated with Ty1, suggesting that Fu2 leads to 128 aggregation of the PSV-GFP particles. 129 130 Structural basis for the induction of spike trimer dimers by Fu2. 131 To better understand neutralization and the aggregation of spike by Fu2, we used electron 132 cryomicroscopy (cryo-EM) to determine the structure of the Fu2-spike complex. The structure 133 revealed a remarkable head-to-head dimerization of the trimeric spike, bound by six molecules of 134 Fu2 (Fig. 2). This distinct structural state appeared as prominent 2D classes in our analyses (Fig. 135 2A). Binding of Fu2 to the RBD is unique as it can simultaneously interact with two different 136 RBDs from different spike trimers in the up conformation (Figs. 2B and 2C). To our knowledge, 137 Fu2 is the only nanobody or spike-binding molecule developed against the SARS-CoV-2 spike 138 to have this property. Our high resolution (2.9Å; 0.143 FSC) localized reconstruction of the 139 RBD-Fu2-RBD-Fu2 interface helped us elucidate the molecular details of this interaction. Each 140 RBD in the complex provides two binding interfaces for two Fu2 molecules, which we call 141 'interface-major' and 'interface-minor' according to surface area covered (Figs. 2D, S2A and 142 S2B). The interface-major and interface-minor have a buried surface area of ~740 Å 2 and 143 ~495 Å 2 , respectively. Parts of the Fu2 framework regions drive the dimerization by shape-144 complementarity and coupled solvent exclusion in the two interfaces. In addition, the interface-145 major consists of 15 hydrogen bonds and one salt bridge between Fu2 D117 and RBD K378, 146 while the interface-minor comprises five hydrogen bonds. Furthermore, a region around the Fu2 147 b-turn A40-K43 plays a key role in dimerization through interactions with two proximal RBDs 148 (Figs. S2C and S2D). Specifically, one of the two proximal RBDs' T500-Y505 region packs 149 7 against the Fu2 A40-K43 b-turn and the RBD Y505 is in addition bound by Fu2 Q39. 150",
            "cite_spans": [],
            "ref_spans": [
                {
                    "start": 227,
                    "end": 236,
                    "text": "(Fig. 1F)",
                    "ref_id": null
                }
            ],
            "section": "Abstract"
        },
        {
            "text": "Meanwhile, the other proximal RBD is bound through a bidentate hydrogen bond between Fu2",
            "cite_spans": [],
            "ref_spans": [],
            "section": "Abstract"
        },
        {
            "text": "E44 and the backbone amides of RBD V503-G504 (Figs. 2E, S2C and S2D). Interestingly, the 152 overall structure of Fu2-bound spike had no significant deviations from previous structures (Fig.   153 S3), and we did not find any contact between any two Fu2 molecules or between spike trimers 154 suggesting that the observed spike trimer dimerization is solely driven RBD-Fu2 interactions. 155 156 NaCl, 50 mM Tris pH 7.5 and 10 mM CaCl2 for 3 h at 25 °C. To functionalize the nanobody 420 with an azide, 70 µM of nanobody, was incubated with 5 µM sortase A 5M, 10 mM 3-azido-1-421 propanamine (Sigma-Aldrich #762016) in 150 mM NaCl, 50 mM Tris pH 7.5 and 10 mM CaCl2 422 for 3 h at 25 °C. In both reactions, unreacted nanobody, sortase A and excess nucleophile were 423 removed using Ni-NTA resin and PD-10 columns or size-exclusion chromatography. The click 424 reaction was initiated by mixing azide and DBCO labeled nanobody in a 1:1 molar ratio for 48 h 425 at 4 °C. Dimers were purified from unreacted monomeric nanobody by size-exclusion 426 chromatography on a Superdex S200 16/600 column (Cytiva).",
            "cite_spans": [],
            "ref_spans": [
                {
                    "start": 185,
                    "end": 196,
                    "text": "(Fig.   153",
                    "ref_id": null
                }
            ],
            "section": "Abstract"
        },
        {
            "text": "427 428 21 Neutralization assays 429 Pseudotyped virus neutralization assay: Pseudotyped viruses were generated by co-transfection 430 of HEK293T cells with plasmids encoding firefly luciferase, a lentiviral packaging plasmid 431 (Addgene cat#8455), and a plasmid encoding either the SARS-CoV or SARS-CoV-2 spike 432 protein, both harboring a C-terminal truncation of 18 amino acids. Media was changed 12-16 h 433 post-transfection, and pseudotyped viruses were harvested at 48 and 72 hours, filtered through a 434 0.45 µm filter and stored at -80 °C until use. Pseudotyped viruses sufficient to generate 100,000 435 relative light units (RLU) were incubated with serial dilutions of nanobody for 60 min at 37 °C. 436 15,000 HEK293T-ACE2 cells were then added to each well, and the plates were incubated for 48 437 h at 37 °C. Luminescence was measured using Bright-Glo (Promega) on a GM-2000 438 luminometer (Promega) with an integration time of 0.3 s. 439 Plaque reduction neutralization test: One day before the experiment, 100,000 Vero E6 cells were 440 seeded per well of a 24-well plate. A 3-fold serial dilution of the nanobody constructs starting at 441 10 µg/ml were incubated with 100 plaque-forming units (PFU) of the first Swedish clinical 442 isolate of SARS-CoV-2 or variant B.1.351 for 1 h at 37°C. The nanobody-virus mixture was then 443 added to the cells and incubated at 37 °C for 1 h. Cells were washed with PBS, and an overlay of 444 1% CMC/DMEM supplemented with 2% FBS was pipetted into the wells. Three days post-445 infection, cells were fixed in 10% formaldehyde, followed by staining with crystal violet. 446 Plaques were counted and inhibition determined by comparing to control wells on the same 447 plate. 448 449 Flow cytometry 450 HEK293T-hACE2 cells were trypsinized and fixed in 4% formaldehyde in PBS for 20 min. Cells 451 were stained with spike-AbberiorStar-635P not premixed or premixed with Fu2 or control 452 22 nanobody. Fluorescence was quantified using a BD FACSCelesta and the FlowJo software 453 package. 454 455 Surface plasmon resonance 456 Binding kinetics were determined by surface plasmon resonance using a Biacore 2000. All 457 experiments were performed at 25 °C in a running buffer of 10 mM HEPES, 150 mM NaCl, pH 458 7.4, and 0.005% Tween-20 (v/v). Site-specifically biotinylated RBD was immobilized on 459 streptavidin sensor chips (Series S sensor Chip SA, GE Healthcare) to a level of ~200 resonance 460 units (RU). A 2-fold dilution series of the nanobodies was injected at a flow rate of 30 µl/min 461 (association 180 s, dissociation 900 s), and the immobilized RBD was regenerated using 0.1 M 462 glycine-HCL buffer pH 2 for 2x 10 seconds. Data were analyzed using BIAevaluation Software 463 and fitted using the 1:1 Langmuir model with mass transfer. 464 465 Next generation sequencing 466 Next generation sequencing on pre-and post-enrichment nanobody libraries was performed as 467 described in Hanke et al. 2020 14 on an Illumina MiSeq. 468 469 Gel-filtration shift assays 470 For the gel-filtration shift assay, 80 µg of prefusion stabilized spike protein was incubated with 471 or without nanobody for 15 minutes and was run on a Superose 6 increase 10/300 GL (Cytiva), 472 and absorbance at 280 nm was detected. Sample and injection volumes were kept identical 473 between runs to obtain comparable elution profiles.",
            "cite_spans": [],
            "ref_spans": [],
            "section": "Abstract"
        },
        {
            "text": "474 475 Fluorescent pseudotyped lentivirus brightness measurements 476 23 To generate fluorescent lentiviral particles enveloped with the spike protein of the SARS-CoV-2 477 coronavirus (PSV-GFP), HEK 293T cells were reverse-transfected with 3 plasmids: psPAX2 (a 478 gift from Didier Trono, Addgene #12260), pEGFP-Vpr (obtained through the NIH HIV Reagent 479 Program, Division of AIDS, NIAID, NIH: pEGFP-Vpr, ARP-11386, contributed by Dr. Warner 480 C. Greene) and pCMV14-3X-Flag-SARS-CoV-2 S (a gift from Zhaohui Qian, Addgene #145780) 481 at 1:0.5:2 molar ratio using Lipofectamine™ 2000 (0.6 ul per 1 ug DNA; Invitrogen™, 11668019); 482 growth medium was refreshed 16 h after transfection. Virus-rich supernatant was collected twice 483 over the next 48 h and, if needed, stored at 4 °C prior to the concentration. Supernatants were 484 pooled, mixed with the Lenti-X™ Concentrator (Takara Bio, 631231) at 3:1 ratio (v:v) and 485 incubated overnight at 4 °C. The solution was then spun down at 1'500 x g for 45 min at RT, the 486 pellet was resuspended in sterile 1x PBS (Sigma-Aldrich, D8537) and stored at -80 °C. 487 PSV-GFP was incubated with 100 µg/ml Ty1, Fu2 or PBS as control for 1 h. The mixtures were 488 transferred to an 8-well glass bottom Ibidi chamber. Fluorescence Correlation Spectroscopy 489 (FCS) measurements were performed using Zeiss LSM 780 microscope. 488 nm argon ion laser 490 was used to excite GFP. 40x/1.2 NA water immersion objective was used to focus the light in 491 solution. 40-50 curves were taken (5 s each) in solution where PSV-GFP particles diffuse freely. 492 Laser power was set to 0.1% of the total laser power that corresponds to ≈2 µW. Curves were 493 then fitted with FoCuS-point software 34 to extract number of diffusing species and brightness of 494 single diffusing species. 495 496 Cryo-EM sample preparation and imaging 497",
            "cite_spans": [],
            "ref_spans": [],
            "section": "Abstract"
        },
        {
            "text": "Spike trimer (1.8mg/ml) S6-P and Fu2 (2.1mg/ml) were mixed in a 1:6 molar ratio followed by 498 incubation on ice for 10 minutes. Prior to cryo-EM grid preparation, grids were glow-discharged 499 with 25 mA for 2 minutes using an EMS 100X (Electron Microscopy Sciences) glow-discharge 565 Reagent (Invitrogen). Total RNA extractions from buccal swab samples were performed using 566 an adapted TRIzol™ manufacturers protocol with a 45 min precipitation step at -20° C. RNA 567 pellets were resuspended in 20 µl of RNase-free water. 568 RT-PCR reactions were performed using 4 µl of resuspended RNA in a 20 µl reaction volume 569 using the Superscript III one step RT-qPCR system with Platinum Taq Polymerase (Invitrogen) 570 with 400 nM concentrations of each primer and 200 nM of probe. Primers and probes for the 571 CoV-E gene target were as previously described 43 . Primers and probes for the ABL1 target were 572 27 adapted from Ishige et al. 44 to enable detection of the murine homolog: (ABL1_ENF1003_deg: 573 5'-TGGAGATAACACTCTCAGCATKACTAAAGGT-3', ABL1_ENR1063: 5'-574 GATGTAGTTGCTTGGGACCCA-3', ABL1_ENPr1043_deg: 5'-HEX-575 CCATTTTTSGTTTGGGCTTCACACCATT-BHQ1-3'). The CoV-E and ABL1 TaqMan assays 576 were run in multiplex. Detection of the subgenomic CoV-E target was adapted from Wölfel et 577 al. 45 , using a leader/E gene junction specific forward primer: (sgEjunc_SARSCoV2_F: 5'-578 CGATCTCTTGTAGATCTGTTCTCTAAACG-3'). All oligonucleotides were synthesized by 579 Eurofins Genomics. 580 Thermal cycling conditions for all assays consisted of RT at 55 °C for 10 min, denaturation at 95 581 °C for 3 min, and 45 cycles of 95C, 15s and 58C, 30s. Reactions were carried out using a CFX96 582 Connect Real-Time PCR Detection System (Bio-Rad) following manufacturer instructions. To 583 generate standard curves, a synthetic DNA template gBlock (Integrated DNA Technologies) was 584 transcribed using the mMessage mMachine™ T7 Transcription Kit (Invitrogen) and serially 585 diluted. To reduce sampling-related variability, SARS-CoV-2 RNA copies were normalized by 586",
            "cite_spans": [],
            "ref_spans": [],
            "section": "Abstract"
        }
    ],
    "body_text": [
        {
            "text": "Fu2 blocks the RBD from binding ACE2. 157 Structural alignment of an ACE2-RBD structure (PDB: 6LZG 18 ) to the Fu2-spike structure 158 (single RBD) shows that binding of ACE2 would be hindered by Fu2 bound to any of the two 159 interfaces (Fig. 2F ). Fu2 bound to the interface-major would clash with ACE2 residues ~303-331 ",
            "cite_spans": [
                {
                    "start": 38,
                    "end": 41,
                    "text": "157",
                    "ref_id": null
                }
            ],
            "ref_spans": [
                {
                    "start": 239,
                    "end": 247,
                    "text": "(Fig. 2F",
                    "ref_id": "FIGREF11"
                }
            ],
            "section": "Introduction"
        },
        {
            "text": "In the complex, Fu2's long CDR3 (G99 to Y120) plays a significant role in RBD binding. Here, 168 the Fu2 S107-R111 region adopts a b-strand conformation that binds the RBD T376-Y380 b-169 strand to give rise to an energetically favorable inter-chain extension of the RBD anti-parallel b-170 sheet (Figs. 2G and 2H) . Interestingly, the Fu2 CDR1 (G26-Y32) and CDR2 (T52-S57) do not 171 participate in RBD binding, and none of the CDRs is directly involved in the formation of the 172 spike dimer.",
            "cite_spans": [
                {
                    "start": 93,
                    "end": 96,
                    "text": "168",
                    "ref_id": null
                },
                {
                    "start": 297,
                    "end": 314,
                    "text": "(Figs. 2G and 2H)",
                    "ref_id": null
                }
            ],
            "ref_spans": [],
            "section": "167"
        },
        {
            "text": "spike is mostly present in all-down (~60%) or 1-up (~40%) conformation 6 . Our Fu2-spike 177 structure shows the presence of two trimeric spike molecules, both in the 3-up conformation. To test the breadth of neutralization, we evaluated cross-neutralization of SARS-CoV PSV (Fig. 189 3A). While Ty1 did not neutralize SARS-CoV, Fu2 and dimeric Fu2 constructs were 190 neutralizing, but less so than against SARS-CoV-2 PSV. Interestingly, the neutralization curves 191 displayed a much flatter slope as compared to those against SARS-CoV-2 PSV. It required 6.1 192 µg /ml of monomeric Fu2 to reach 50% neutralization in this assay, while 570 ng /ml of and 57 ng/ml of the Fu2-dimer was sufficient for 50% neutralization.",
            "cite_spans": [
                {
                    "start": 275,
                    "end": 284,
                    "text": "(Fig. 189",
                    "ref_id": null
                },
                {
                    "start": 365,
                    "end": 368,
                    "text": "190",
                    "ref_id": null
                }
            ],
            "ref_spans": [],
            "section": "Fu2 stabilizes the RBD in the 'up' conformation."
        },
        {
            "text": "To understand the molecular mechanism of cross-neutralization of SARS-CoV we 195 compared the RBD sequences and performed structural alignments (Figs. 3B, 3C and S4A). differences, suggesting that the divergent interface-minor of SARS-CoV RBD would not permit 198 Fu2 binding. From these analyses we conclude that Fu2 would be unlikely to induce SARS-CoV 199 trimer dimers.",
            "cite_spans": [],
            "ref_spans": [],
            "section": "194"
        },
        {
            "text": "To demonstrate neutralization of replication competent SARS-CoV-2 we 201 performed a plaque reduction neutralization test (PRNT) using infectious SARS-CoV-2, isolated 202 from the first Swedish COVID-19 patient 19 (Fig. 3D ). Similar to neutralization of PSV, 203 monomeric Fu2 neutralized SARS-CoV-2 much better than Ty1, a dimeric construct of Fu2 204 provided a 2.8-fold improvement over the monomeric version of Fu2, while the heterodimer of 205 Ty1 and Fu2 showed a 50-fold improvement compared to monomeric Fu2 in this assay. An important requirement for the development of antivirals is neutralization potential in vivo. To 220 address this, we used K18-hACE2 transgenic mice that express human ACE2 as a model for SARS-CoV-2 infection. To determine if Fu2 could reduce disease severity when administered in 222 early infection, we tested its ability to neutralize the virus and protect mice from signs of disease 223 in vivo (Fig. 4) . When the Fu2-Ty1 heterodimer was administered prophylactically or 224 therapeutically, we noted that it slightly delayed the onset of disease (Fig. S7) . A major issue 225 with using nanobodies therapeutically is their short half-life in vivo. To extend serum half-life, 226 we fused Fu2 to the nanobody Alb1 that binds mouse serum albumin 20 . Mice were challenged 250 Fu2 is also capable of neutralizing SARS-CoV, highlighting its specificity for a 251 more conserved epitope. However, the potency was significantly reduced for the monomeric The RBD-specific nanobody Fu2 displays a particularly unique mode of virus 264 neutralization by rapidly inducing stable spike trimer dimers that are incapable of binding to 265 ACE2. In contrast to spike trimer dimers reported for the full-length spike that are based on S1-266 S1 interactions placing the trimers 'side-by-side' 30 , Fu2 induced a dimer in a 'head-to-head' 267 orientation with the C-termini at the distal ends. Targeting two epitopes increases the binding 268 surface area, but, more importantly, when locked in such a conformation the function of each spike is sterically blocked both by the nanobody and by the other spike in such a way that the 270 whole complex must dissociate for the spike to regain its function.",
            "cite_spans": [
                {
                    "start": 1215,
                    "end": 1218,
                    "text": "226",
                    "ref_id": null
                }
            ],
            "ref_spans": [
                {
                    "start": 214,
                    "end": 222,
                    "text": "(Fig. 3D",
                    "ref_id": "FIGREF12"
                },
                {
                    "start": 933,
                    "end": 941,
                    "text": "(Fig. 4)",
                    "ref_id": "FIGREF13"
                },
                {
                    "start": 1086,
                    "end": 1095,
                    "text": "(Fig. S7)",
                    "ref_id": null
                }
            ],
            "section": "200"
        },
        {
            "text": "The interaction between Fu2 and the RBD is highly unusual, and for a monomer to 272 induce antigen dimerization in this manner, two copies of an antigen must be bound at different 273 epitopes with precisely the right spatial arrangement. This novel mode of antigen binding may be 274 uncommon in naturally elicited antibody repertoires but could be achievable by structure-based (Table S1) . reconstructions. In total 277,372 particles were retained for refinement steps and these particles 520 were processed with C1 symmetry (image processing scheme Fig. S5 ).",
            "cite_spans": [],
            "ref_spans": [
                {
                    "start": 380,
                    "end": 390,
                    "text": "(Table S1)",
                    "ref_id": "TABREF1"
                },
                {
                    "start": 553,
                    "end": 560,
                    "text": "Fig. S5",
                    "ref_id": null
                }
            ],
            "section": "271"
        },
        {
            "text": "These particles were further processed using heterogeneous refinement that resulted in a 522 reconstruction with high-resolution structural features in the core of the spike. One round of 523 homogeneous refinement was followed by non-uniform refinement. All final reconstructions were analysed using 3D-FSC 37 and there were moderate anisotropy in the full map 525 reconstructions while the localized reconstruction displayed no significant anisotropy (Fig. S6A   526 and S6B). All CTF refinements were per-particle CTF refinements interspersed with global 527 aberration correction (beamtilt, trefoil, tetrafoil and spherical aberration). Please see Table S1 for 528 data collection and processing statistics and the respective cryo-EM data processing schemes.",
            "cite_spans": [],
            "ref_spans": [
                {
                    "start": 453,
                    "end": 468,
                    "text": "(Fig. S6A   526",
                    "ref_id": "FIGREF11"
                },
                {
                    "start": 652,
                    "end": 660,
                    "text": "Table S1",
                    "ref_id": "TABREF1"
                }
            ],
            "section": "521"
        },
        {
            "text": "For the Spike-Fu2 dimer interface we used a particle set with partial-signal subtraction of all 530 parts except for Fu2-RBD dimer interface (containing two RBDs and two Fu2). From this we 531 performed local reconstruction (non-uniform). The local reconstruction resulted in a map with 532 2.89Å overall resolution as compared to 3.2Å overall resolution for the full map. Table S2 for refinement and validation were monitored daily until weight drop started, whereupon mice were monitored twice daily.",
            "cite_spans": [],
            "ref_spans": [
                {
                    "start": 373,
                    "end": 381,
                    "text": "Table S2",
                    "ref_id": "TABREF2"
                }
            ],
            "section": "529"
        },
        {
            "text": "During the experiment, weight loss, changes in general health, breathing, body movement and 555 posture, piloerection and eye health were monitored. Mice were typically sacrificed when they 556 achieved 20% weight loss. However, some mice were sacrificed before losing 20% in body 557 weight, when movement was greatly impaired and/or they experienced difficulty breathing that 558 was considered to reach a severity level of 0.5 on Karolinska Institutet's veterinary plan for 559 monitoring animal health. The weight loss in response to infection was highly reproducible. In ",
            "cite_spans": [],
            "ref_spans": [],
            "section": "554"
        }
    ],
    "bib_entries": {
        "BIBREF0": {
            "ref_id": "b0",
            "title": "Escape of SARS-CoV-2 501Y.V2 from neutralization by convalescent 591 plasma",
            "authors": [
                {
                    "first": "S",
                    "middle": [],
                    "last": "Cele",
                    "suffix": ""
                }
            ],
            "year": 2021,
            "venue": "Nature",
            "volume": "593",
            "issn": "",
            "pages": "142--146",
            "other_ids": {}
        },
        "BIBREF1": {
            "ref_id": "b1",
            "title": "Nanobodies: Natural Single-Domain Antibodies",
            "authors": [
                {
                    "first": "S",
                    "middle": [],
                    "last": "Muyldermans",
                    "suffix": ""
                }
            ],
            "year": 2013,
            "venue": "Annu. Rev. Biochem",
            "volume": "593",
            "issn": "",
            "pages": "775--797",
            "other_ids": {}
        },
        "BIBREF3": {
            "ref_id": "b3",
            "title": "MolProbity: All-atom structure validation for macromolecular 695 crystallography",
            "authors": [
                {
                    "first": "V",
                    "middle": [
                        "B"
                    ],
                    "last": "Chen",
                    "suffix": ""
                }
            ],
            "year": 2010,
            "venue": "Acta Crystallogr. Sect. D Biol. Crystallogr",
            "volume": "66",
            "issn": "",
            "pages": "12--21",
            "other_ids": {}
        },
        "BIBREF4": {
            "ref_id": "b4",
            "title": "EMRinger: Side chain-directed model and map validation for 3D cryo-697 electron microscopy",
            "authors": [
                {
                    "first": "B",
                    "middle": [
                        "A"
                    ],
                    "last": "Barad",
                    "suffix": ""
                }
            ],
            "year": 2015,
            "venue": "Nat. Methods",
            "volume": "12",
            "issn": "",
            "pages": "943--946",
            "other_ids": {}
        },
        "BIBREF5": {
            "ref_id": "b5",
            "title": "Acknowledgments: Experiments with replication-competent SARS-CoV-2 were performed in 700 the Biomedicum BSL3 core facility, Karolinska Institutet. We thank Jonas Klingstrom for 701 providing Calu-3 cells and sharing the Swedish SARS-CoV-2 isolate, and Alex Sigal from the",
            "authors": [],
            "year": null,
            "venue": "",
            "volume": "",
            "issn": "",
            "pages": "",
            "other_ids": {}
        },
        "BIBREF6": {
            "ref_id": "b6",
            "title": "Africa Health Research Institute for providing the B.1.351/501Y.V2 isolate. All cryo-EM data 703 were collected in the Karolinska Institutet's 3D-EM facility. We thank Agustin Ure for 704 assistance with figure generation and Tomas Nyman (Protein Science Facility at KI) for 705 providing access to SPR instruments",
            "authors": [],
            "year": null,
            "venue": "",
            "volume": "",
            "issn": "",
            "pages": "",
            "other_ids": {}
        },
        "BIBREF7": {
            "ref_id": "b7",
            "title": "Funding: LH was supported by the David och Astrid Hageléns stiftelse, the",
            "authors": [],
            "year": null,
            "venue": "Clas Groschinskys",
            "volume": "707",
            "issn": "",
            "pages": "",
            "other_ids": {}
        },
        "BIBREF8": {
            "ref_id": "b8",
            "title": "Minnesfond and a Jonas Söderquist's scholarship. This project has received funding from the 708",
            "authors": [],
            "year": null,
            "venue": "",
            "volume": "",
            "issn": "",
            "pages": "",
            "other_ids": {}
        },
        "BIBREF9": {
            "ref_id": "b9",
            "title": "European Union's Horizon 2020 research and innovation program under grant agreement No. 709 101003653 (CoroNAb), to BM and GMM. BMH is supported by the Knut and Alice Wallenberg 710",
            "authors": [],
            "year": null,
            "venue": "",
            "volume": "",
            "issn": "",
            "pages": "",
            "other_ids": {}
        },
        "BIBREF10": {
            "ref_id": "b10",
            "title": "The work was supported by project grants 711 from the Swedish Research Council to BMH",
            "authors": [],
            "year": 2017,
            "venue": "BM",
            "volume": "6702",
            "issn": "",
            "pages": "",
            "other_ids": {}
        },
        "BIBREF11": {
            "ref_id": "b11",
            "title": "Author contributions: Conceptualization: LH, BM, GMM. Methodology: LH, DJS, JMC",
            "authors": [],
            "year": null,
            "venue": "",
            "volume": "",
            "issn": "",
            "pages": "",
            "other_ids": {}
        },
        "BIBREF14": {
            "ref_id": "b14",
            "title": "Writing -original draft: LH, HD. Writing -review & editing",
            "authors": [
                {
                    "first": "H",
                    "middle": [
                        "D"
                    ],
                    "last": "Lh",
                    "suffix": ""
                },
                {
                    "first": "",
                    "middle": [],
                    "last": "Djs",
                    "suffix": ""
                },
                {
                    "first": "",
                    "middle": [],
                    "last": "Lpv",
                    "suffix": ""
                },
                {
                    "first": "Amm",
                    "middle": [],
                    "last": "Eu",
                    "suffix": ""
                }
            ],
            "year": null,
            "venue": "",
            "volume": "",
            "issn": "",
            "pages": "",
            "other_ids": {}
        },
        "BIBREF17": {
            "ref_id": "b17",
            "title": "Data and materials availability: The cryo-EM density maps have been deposited in the 722",
            "authors": [],
            "year": null,
            "venue": "",
            "volume": "",
            "issn": "",
            "pages": "",
            "other_ids": {}
        },
        "BIBREF18": {
            "ref_id": "b18",
            "title": "Electron Microscopy Data Bank under accession codes EMD-12561 (dimer of spike trimer + 6",
            "authors": [],
            "year": null,
            "venue": "",
            "volume": "",
            "issn": "",
            "pages": "",
            "other_ids": {}
        },
        "BIBREF19": {
            "ref_id": "b19",
            "title": "Fu2) and EMD-12465 (localized reconstruction of 2 RBDs + 2 Fu2). The atomic coordinates 724 have been deposited in the Protein Data Bank under IDs 7NS6 (dimers of spike trimers + 6 Fu2",
            "authors": [],
            "year": null,
            "venue": "",
            "volume": "",
            "issn": "",
            "pages": "",
            "other_ids": {}
        },
        "BIBREF20": {
            "ref_id": "b20",
            "title": "All nanobody sequences will be made 726 available on public databases upon publication",
            "authors": [],
            "year": null,
            "venue": "",
            "volume": "",
            "issn": "",
            "pages": "",
            "other_ids": {}
        },
        "BIBREF21": {
            "ref_id": "b21",
            "title": "RBDs and two Fu2s showing in grey the b-hairpins in the Fu2 framework region (39-45) that 746 help to mediate the dimer-of-trimers Fu2-spike complex. (D) Close-up view of (C) (E and F",
            "authors": [],
            "year": null,
            "venue": "",
            "volume": "",
            "issn": "",
            "pages": "",
            "other_ids": {}
        },
        "BIBREF22": {
            "ref_id": "b22",
            "title": "Assessment of Fu2-Ty1 heterodimer binding. Alignment of the Spike-Fu2 structure to the Spike-748",
            "authors": [],
            "year": null,
            "venue": "",
            "volume": "",
            "issn": "",
            "pages": "",
            "other_ids": {}
        },
        "BIBREF23": {
            "ref_id": "b23",
            "title": "Arrows indicate partial overlap of 749 binding surface on RBD. (G) Assessment of Fu2-RBD interaction in RBD-down conformation",
            "authors": [],
            "year": null,
            "venue": "Ty1 structure (RBD in 'up' conformation)",
            "volume": "",
            "issn": "",
            "pages": "",
            "other_ids": {}
        },
        "BIBREF24": {
            "ref_id": "b24",
            "title": "RBD-Fu2 structure superimposed to RBD-down of spike in 2-up conformation (PDB:7A29) (H)",
            "authors": [],
            "year": null,
            "venue": "",
            "volume": "",
            "issn": "",
            "pages": "",
            "other_ids": {}
        },
        "BIBREF25": {
            "ref_id": "b25",
            "title": "Assessment of Fu2-RBD interaction in RBD-down conformation in dimeric spike. 2-up spike 752 (PDB:7A29 13 ) is shown superimposed with the spike dimer-of-trimers",
            "authors": [],
            "year": null,
            "venue": "",
            "volume": "",
            "issn": "",
            "pages": "",
            "other_ids": {}
        }
    },
    "ref_entries": {
        "FIGREF0": {
            "text": "160 and the N-glycan at position 322, while Fu2 bound to interface-minor would mask the interaction 161 surface of ACE2, making it sterically impossible for ACE2 to access the RBD. A comparison of 162 the Fu2 and Ty1 binding site revealed that interface-minor is partially shared between Ty1 and 163 Fu2 (Figs. S2E and S2F), suggesting that in context of the Fu2-Ty1 heterodimer, Ty1 is 164 displaced upon dimerization of the spike trimer. Ty1 can then potentially bind additional spike 165 molecules, explaining the elution profile showing both dimers and higher order spike complexes 166 (Fig. 1E).",
            "latex": null,
            "type": "figure"
        },
        "FIGREF1": {
            "text": "This arrangement allows Fu2 to access all six possible binding sites on RBDs without steric 179 conflict. Alignment of RBD-Fu2 to RBD-down in a 2-up spike structure confirms that binding of 180 Fu2 to RBD in the down conformation is not possible(Fig. S2G). Fu2 bound to either interaction 181 interface on an RBD in the down conformation would clash with neighboring RBDs. Likewise, 182 an alignment of the 2-up spike structure to the Fu2-trimer-dimer shows that RBD-down would 183 clash with the neighboring Fu2 molecule(Fig. S2H). In conclusion, for Fu2 binding and for 184 trimer-dimer assembly, all RBDs must be in the up conformation.",
            "latex": null,
            "type": "figure"
        },
        "FIGREF2": {
            "text": "-neutralizes SARS-CoV, and clinical isolates of SARS-CoV-2 including the 187 B.1.351 variant of concern 188",
            "latex": null,
            "type": "figure"
        },
        "FIGREF3": {
            "text": "PRNT using the B.1.351 (501Y.V2) variant 1 showed that Fu2 very potently 207 neutralized this variant (Fig. 3E) and that the Fu2 dimer and Fu2-Fc again improved 208 neutralization efficiency. The IC50 values were even slightly better than when using the Swedish 209 isolate, but the difference is within the intraassay variability. Ty1 failed to neutralize this virus, 210 and the Fu2-Ty1 heterodimer did not neutralize better than Fu2 alone. The variant B.1.351 211 harbors four amino acid substitutions in the RBD at position K417N, N439K, E484K and 212 N501Y. Only N501 and E484 are in proximity of the Fu2 interaction interface. In silico analyses 213 with the PISA server (25) confirmed that the two interfaces do not change in these mutants. Both 214 buried surface areas of the interfaces as well as the number of possible hydrogen bonds remain 215 unchanged (Fig. 3F). These results and analysis combined suggests that Fu2 likely also 216 neutralizes the recently emerged variants P1 (K417T, E484K, N501Y) and B.1.1.7 (N501Y).",
            "latex": null,
            "type": "figure"
        },
        "FIGREF4": {
            "text": "of Fu2 in a mouse model of SARS-CoV-2 infection 219",
            "latex": null,
            "type": "figure"
        },
        "FIGREF5": {
            "text": "227 with a standardized dose (2.4x10 6 RNA copies) of either a Swedish isolate of SARS-CoV-2 (86 228 plaque forming units, PFU) or the B.1.351 variant (100 PFU). On days 1, 3, 5 and 6 post 229 infection, mice were injected intraperitoneally (i.p.) with 600 µg of the Fu2-Alb1 heterodimer 230 (Fig 4A). All control untreated mice experienced considerable weight loss within the first week 231 of infection, with mice infected with B.1.351 experiencing a slightly faster onset of weight loss.232In contrast, Fu2-Alb1 delayed disease onset and protected mice from severe weight loss 233 following infection with either the wild-type or B.1.351 virus (Fig. 4B and 4C). Quantification of 234 genomic and subgenomic SARS-CoV-2 E-gene at day 5 also demonstrated that Fu2-Alb1 235 reduced viral loads, most clearly in mice infected with wild-type virus(Fig. 4D). Thus, Fu2 is a 236 suitable candidate for antiviral therapy against SARS-CoV-2 and common variants.",
            "latex": null,
            "type": "figure"
        },
        "FIGREF6": {
            "text": "represent a valuable alternative to monoclonal antibodies for virus 240 neutralization 21,22 . Their ease of production, thermal stability, and robust biochemical behavior, 241 combined with straight-forward functionalization and multimerization possibilities, make them 242 suitable candidates for therapeutic applications.",
            "latex": null,
            "type": "figure"
        },
        "FIGREF7": {
            "text": "The newly emerged SARS-CoV-2 B.1.351 variant shows nine amino acid changes 244 in the spike protein. While biological properties of this variant remain to be determined, two amino acid substitutions in the receptor binding motif are of potential concern for vaccine 246 efficacy, neutralization efficiency of existing monoclonal antibody therapies, and altered 247 dynamics of virus spread 23-25 . The novel nanobody described here, Fu2, can effectively 248 neutralize the B.1.351 variant and therefore has a strong and unique potential to form the basis 249 for development of therapeutic interventions against this emerging variant of concern.",
            "latex": null,
            "type": "figure"
        },
        "FIGREF8": {
            "text": "252 nanobody, likely because of decreased affinity to the RBD of this virus. That the dimeric 253 constructs significantly increased potency further supports this hypothesis. A similar observation 254 was made for VHH-72 originally developed against SARS-CoV, but with some neutralization 255 potential in dimeric form against SARS-CoV-2 26,27 . 256 Nanobodies typically have short serum half-lives, ranging from 1-3 hours 28 , 257 compared to 6-8 days of IgG1 29 . This characteristic can dramatically influence applicability for 258 virus neutralization. Accordingly, for a Fu2-Ty1 heterodimer, we could not detect any protective 259 effect when administered prophylactically, while therapeutic administration significantly delayed 260 disease onset and severity (Fig. S7). In contrast, a half-life extended Fu2-Alb1 heterodimer 261showed therapeutic efficacy against 'wild-type' and B.1.351(Fig. 4), suggesting that nanobody-262 based constructs have the potential for SARS-CoV-2 antiviral therapy.",
            "latex": null,
            "type": "figure"
        },
        "FIGREF10": {
            "text": "275 antibody design and might present a general strategy for potent immobilization of viral 276 glycoproteins and other antigens. It remains to be seen whether 'designer' bispecific monomeric 277 nanobodies can push the potency envelope beyond what is currently attainable. 278 An RBD-specific nanobody neutralizes SARS-CoV-2. (A) Overview of different 280 nanobody constructs used in this study: (1) nanobody monomer, (2) nanobody Fc-fusion, (3) 281 chemically linked nanobody homodimer, (4) chemically linked nanobody heterodimer. (B) A 282 SARS-CoV-2 spike pseudotyped lentivirus (PSV) was incubated with a dilution series of the 283 indicated nanobodies at 37°C for one hour before infecting HEK293T-hACE2 cells. 284 Neutralization (in %) compared to untreated PSV is shown. Data from at least two replicates is 285 shown and the error bars represent the standard deviation. (C) Recombinantly expressed, 286 prefusion stabilized, and fluorescently labelled SARS-CoV-2 spike protein was incubated with a 287 control nanobody specific for IAV NP 31 , or Fu2 and used to stain ACE2 expressing HEK293T 288 cells. Cells were analyzed by flow cytometry and a representative histogram is shown. (D) 289Binding kinetics of Fu2 to the RBD were measured by surface plasmon resonance (SPR).290Sensorgram is color-coded based on concentration. The fit is based on the 1:1 Langmuir model 13 and is shown in dark grey solid lines. (E) Recombinantly expressed, prefusion stabilized SARS-. Statistical significance was evaluated using Kolmogorov-Smirnov test.",
            "latex": null,
            "type": "figure"
        },
        "FIGREF11": {
            "text": "Cryo-EM provides structural evidence of Fu2-mediated dimerization of trimeric 299 spike in '3-up' conformation (A) Representative 2D class averages. (B) Cryo-EM map (two 300 different side views) and (C) Atomic model of 'dimeric' spike in complex with Fu2; and two 301 opposite protomers with two Fu2 molecules. Both spike trimers in the complex are present in '3-302 up' conformation (six Fu2 molecules are numbered). (D) Close-up view of the RBD-Fu2 303 interaction interfaces showing the interface-major and interface-minor. (E) A b-hairpin (gray 304 sticks) from the Fu2 framework region (residues 39-45) contacts two RBDs simultaneously in 305 the Fu2-mediated spike trimer-dimer. (F) Modelling of simultaneous spike-Fu2-ACE2 binding 306 shows that Fu2 blocks the binding of ACE2 (PDB:6LZG) 18 to the RBD from two directions. 307 Clashes marked with dashed circles. (G) Fu2 binds the RBD through an extended inter-chain b-308 sheet interaction mediated by the CDR3 region (green). CDR1 (gray) and CDR2 (blue) does not 309 take part in RBD binding (H) Closeup of a part of the CDR3-RBD interface displaying the anti-310 parallel b-strand hydrogen bond pairing between the Fu2 CDR3 region and the RBD (light 311 orange).",
            "latex": null,
            "type": "figure"
        },
        "FIGREF12": {
            "text": "Fu2 cross-neutralizes SARS-CoV and a B.1.351 variant of concern clinical isolate 327 (A) SARS-CoV S pseudotyped lentivirus (PSV) was incubated with the indicated constructs 328 before infecting HEK293T-ACE2 cells, and neutralization is shown compared to untreated PSV. 329 (B and C) Structural basis of SARS-CoV cross-neutralization by Fu2. Structural alignment of 330 SARS-CoV-2 Spike (RBD bound Fu2) with SARS-CoV RBD (PDB:6ACD) 32 . Residues of 331 interface-major and interface-minor shown as sticks, divergent residues are labelled. (D and E) 332 PRNTs with clinical isolates of SARS-CoV-2. 100 plaque forming units (PFU) of SARS-CoV-333 2 19 or B.1.351 (501Y.V2) 1 were incubated with dilution series of the indicated nanobody 334 constructs for 1 h at 37°C before infecting monolayers of Vero E6 cells. Plaques were quantified 335 72 h post infection. Neutralization representing the reduction of plaques relative to the control 336 wells is shown. Error bars represent standard deviation (SD) across replicate experiments. (F) 337 Assessment of Fu2-RBD interaction in RBD variants. In silico mutational analyses of RBD 338 residues and probable impact on Fu2 binding. Fu2 is shown in red and variant residues are 339 indicated.",
            "latex": null,
            "type": "figure"
        },
        "FIGREF13": {
            "text": "Therapeutically administered nanobody rescues mice from lethal SARS-CoV-2 343 infection. 344 (A) Timeline of the challenge experiment. K18-hACE2 transgenic mice were challenged with 86 345 PFU of SARS-CoV-2 (blue, 'wild-type') or 100 PFU of B.1.351 (red) and injected with Fu2-346 Alb1 (half-life extended Fu2) at indicated time points. (B) Weight of mice during the challenge 347 experiment. The mean weight of each mouse of day 0 to day 2 served as baseline and the weight 348 loss relative this baseline is shown. Uninfected mice are shown in grey, untreated infected mice 349 in black. Half of the untreated mice are historical controls from identical, previously conducted 350 experiments. The weight for the same unchallenged control mice is shown in the upper and lower 351 panel. (C) Weight loss for day 5 for each group. (D) Analysis of oropharyngeal samples from 352 mice at day 5 in infected groups. Ratios of E-gene to ABL1 is shown for both genomic and 353 subgenomic RNA. Statistical comparisons are summarized as: *, p≤0.1; **, p≤0.01; **** 354 p≤0.0001; ns, not significant. Groups displaying significant weight loss compared to uninfected 355 mice are annotated above the points for that group. (ATCC-CRL-3216 and ATCC CRL-11268) and Vero E6 cells (ATCC-CRL-361 1586) were maintained in DMEM (Gibco) supplemented with 10% fetal calf serum and 1% 362 penicillin-streptomycin in a humidified incubator with 5% CO2 at 37°C. Calu-3 cells were 363 additionally supplemented with nutrient mixture F12 (Thermo Fisher Scientific). The HEK293T 364 cell line was further engineered to overexpress human ACE2 by lentiviral transduction 14 . All cell 365 lines used for the experiments were negative for mycoplasma as determined by PCR. 366 Infectious SARS-CoV-2 19 and the B.1.351 1 isolate used for PRNTs and the challenge experiment 367 in Fig. S7 were propagated in Vero E6 cells and titrated by plaque assay. Viruses used for the 368 challenge in Fig. 4 were propagated in Calu-3 cells, quantified by qPCR, and titrated by plaque 369 assay in Vero E6 cells. Challenge stocks for experiments shown in Fig. 4 were confirmed by 370 Sanger sequencing to harbor no high frequency cell culture adaptation mutations in spike. 371 372 Proteins and probes 373 The plasmid for the expression of the SARS-CoV-2 prefusion-stabilized spike (2P) ectodomain 374 was a kind gift from the McLellan lab 6 . The plasmid was used for transient transfection of 375 FreeStyle 293F cells using the FreeStyle MAX reagent (Thermo Fisher Scientific). The spike 376 trimer was purified from filtered supernatant on Streptactin XT resin (IBA Lifesciences) or Ni-377 NTA resin and purified by size-exclusion chromatography on a Superdex 200 (Cytiva). For cryo-378 EM a similar construct with 6 proline substitutions (S6-P) was used 33 , and the protein was 379 purified on His-Pur Ni-NTA resin (Thermo Fisher Scientific) followed by size-exclusion chromatography. The RBD domain was cloned upstream of a sortase A motif (LPETG) and a 381 6xHIS tag. The plasmid was used for transient transfection of FreeStyle 293F cells as described 382 above. The protein was purified from filtered supernatant on His-Pur Ni-NTA resin followed by 383 size-exclusion chromatography on a Superdex 200. The albumin binding nanobody Alb1 was 384 described earlier 20 and the sequence was obtained from WO/2006/122787. Nanobodies were 385 cloned in the pHEN plasmid with a C-terminal sortase motif (LPETG) and a 6xHIS tag. BL21 E. 386 coli were transformed with this plasmid, and expression was induced with 1 mM IPTG at OD600 387 = 0.6 and cells were grown overnight at 30 °C. Nanobodies were retrieved from the periplasm by 388 osmotic shock and purified on Ni-NTA resin and size-exclusion chromatography. 389 Sortase A 5M was produced as described before in BL21 E. coli and purified by Ni-NTA and 390 size exclusion chromatography 3 . Fluorescent spike ectodomain was generated by first attaching 391 dibenzocyclooctyine-N-hydroxysuccinimidyl ester (DBCO-NHS) to the spike trimer in a 3:1 392 molar ratio, before attaching AbberiorStar-635P-azide by click-chemistry. The final product was 393 purified from unreacted DBCO and fluorophore on a PD-10 desalting column. The biotinylated 394 RBD was generated using sortase A and amine-PEG3-biotin as a nucleophile. The reaction was 395 performed with 50 µM RBD, 5 µM sortase A 5M, and 8 mM amine-PEG3-biotin in 50 mM Tris 396 pH 7.5, 150 mM NaCl, for 6 hours at 4 °C. Sortase A and unreacted RBD was removed on Ni-397 NTA resin and excess nucleophile was removed by two consecutive purifications on PD-10 398 desalting columns.",
            "latex": null,
            "type": "figure"
        },
        "FIGREF14": {
            "text": ", library generation and nanobody isolation.401    One adult female alpaca (Funny) at PreClinics, Germany, was immunized four times in a 60-day402 immunization schedule. Each immunization consisted of two injections. For the first 403 immunization, 200 µg of prefusion stabilized spike and 200 µg of S1+S2 domain (Sino Biologicals) was used. Remaining immunizations each consisted of one injection with 200 µg 405 RBD and one injection with 200 µg prefusion stabilized spike, both produced in Freestyle 293F 406 cells as described above. Serum from the final bleed at day 60 neutralized SARS-CoV-2 407 pseudoviruses with an ID50 >20 000. The animal study protocol was approved by the PreClinics 408 animal welfare officer commissioner and registered under the registration No. 33.19-42502-05-409 17A210 at the Lower Saxony State Office for Consumer Protection and Food Safety-LAVES 410 and is compliant with the Directive 2010/63/EU on animal welfare. The nanobody phage library 411 was generated as described 14 . Phage display was performed on RBD immobilized generate homo-and hetero-dimers, the different nanobodies were first site-specifically 416 functionalized on the C-terminus using sortase A with either an azide or a dibenzocyclooctine 417 (DBCO) as described in detail here 3 . In brief, for functionalization with DBCO, 70 µM of 418 nanobody was incubated with 5 µM sortase A, 8 mM DBCO-amine (Sigma-Aldrich) in 150 mM unit. CryoMatrix® holey grids with amorphous alloy film (R 2/1 geometry; Zhenjiang Lehua 501 Technology Co., Ltd) were used. 3 μl aliquots of sample solutions were applied to the grids and 502 the grids with sample were then vitrified in a Vitrobot Mk IV (Thermo Fisher Scientific) at 4°C 503 and 100% humidity (blot 10 s, blot force 3, 595 filter papers (Ted Pella Inc.)). Cryo-EM data 504 collection was performed with EPU (Thermo Fisher Scientific) using a Krios G3i transmission-505 electron microscope (Thermo Fisher Scientific) operated at 300 kV in the Karolinska Institutet's 506 3D-EM facility (https://ki.se/cmb/3d-em). Images were acquired in 165 kx nanoprobe EFTEM 507 SA mode with a slit width of 10 eV using a K3 Bioquantum. Exposure time was 1.5 s during 508 which 60 movie frames were collected with a fluency of 0.81 e-/Å2 per frame",
            "latex": null,
            "type": "figure"
        },
        "FIGREF15": {
            "text": "Motion correction, CTF-estimation, Fourier binning (to 1.01 Å/px), picking and extraction in 510 600-pixel boxes (size threshold 400 Å, distance threshold 100 Å, using the pretrained 511 BoxNet2Mask_20180918 model) were performed on the fly using Warp 35 . Due to preferential 512 orientation, we collected a part of the dataset with a 25-degree stage tilt.513A total of 14,081 micrographs were selected based on an estimated resolution cut-off of 4 Å and 514 defocus below 2 microns as estimated by Warp. Furthermore, Warp picked 1,035,962 particles 515 (dimer of trimeric spike with Fu2) based on above-mentioned criteria. Extracted particles were 516 imported into cryoSPARC v3.1 36 for 2D classification, 3D classification and non-uniform 3D 517 refinement. After 2D classification, clean classes with high-resolution features (and with 518 characteristic trimeric spike views) were retained and used to generate ab-initio 3D 519",
            "latex": null,
            "type": "figure"
        },
        "FIGREF16": {
            "text": "EM model building and structure refinement535    The structure of the spike protein trimer PDB: 7KSG 5 was used as a starting model for model536 building. A homology model for Fu2 was generated by SWISS-MODEL 38 with PDB: 5LHN as 537 template (chain B) 39 . Structure refinement and manual model building were performed using 538 Coot 40 and PHENIX 41 in interspersed cycles with secondary structure, Ramachandran, rotamers 539 and bond geometry restrains. Structure figures and EM density-map figures were generated with 540 UCSF ChimeraX 42 and COOT, respectively. Please see",
            "latex": null,
            "type": "figure"
        },
        "FIGREF17": {
            "text": "hACE2 transgenic mice were purchased from Jackson laboratories and maintained as a 545 hemizygous line. Experiments were conducted in BSL3 facilities at the Comparative Medicine 546 department (KM-F) at Karolinska Institutet. Ethics for studies of virus infection and therapeutic 547 intervention were obtained from the Swedish Board of Agriculture (10513-2020). Mice were administered nanobodies as described in the main text and challenged intranasally with Swedish isolate) propagated in Vero E6 cells. Oropharyngeal sampling was performed at the 552 indicated timepoints under light anesthesia with isoflurane. Weight and general body condition 553",
            "latex": null,
            "type": "figure"
        },
        "FIGREF18": {
            "text": "data from 50% of the challenged and untreated animals are historical controls from 561 previous experiments performed under identical conditions. 562 563 RNA Extraction and RT-qPCR for SARS-CoV-2 detection 564 Viral RNA was isolated from buccal swabs collected on dpi 6 and stored in 500 µl of TRIzol™ 16. Schoof, M. et al. An ultrapotent synthetic nanobody neutralizes SARS-CoV-2 by 621 stabilizing inactive Spike. Science 370, 1473-1479 (2021). 622 17. Ibañez, L. I. et al. Nanobodies with in vitro neutralizing activity protect mice against 623 H5N1 influenza virus infection. J. Infect. Dis. 203, 1063-1072 (2011). 624 18. Wang, Q. et al. Structural and Functional Basis of SARS-CoV-2 Entry by Using Human 625 ACE2. Cell 181, 894-904.e9 (2020).626 19. Monteil, V. et al. Inhibition of SARS-CoV-2 Infections in Engineered Human Tissues 627 Using Clinical-Grade Soluble Human ACE2. Cell 181, 905-913.e7 (2020). 628 20. Roovers, R. C. et al. A biparatopic anti-EGFR nanobody efficiently inhibits solid tumour 629 growth. Int. J. Cancer 129, 2013-2024 (2011).630 21. Cardoso, F. M. et al. Single-Domain Antibodies Targeting Neuraminidase Protect against 631 an H5N1 Influenza Virus Challenge. J. Virol. 88, 8278-8296 (2014). 632 22. Power, U. F., Stortelers, C., Allosery, K. & Melero, J. A. Generation and Characterization 633 of ALX-0171 , a Potent Novel Therapeutic Nanobody for the Treatment of Respiratory 634 Syncytial Virus Infection. Antimicrob. Agents Chemother. 60, 6-13 (2016). 635 23. Planas, D. et al. Sensitivity of infectious SARS-CoV-2 B.1.1.7 and B.1.351 variants to 636 neutralizing antibodies. Nat. Med. 1-8 (2021) doi:10.1038/s41591-021-01318-5. 637 24. Tada, T. et al. Neutralization of viruses with European, South African, and United States 638 SARS-CoV-2 variant spike proteins by convalescent sera and BNT162b2 mRNA vaccine-639 elicited antibodies. bioRxiv Prepr. Serv. Biol. 2021.02.05.430003 (2021) 640 doi:10.1101/2021.02.05.430003. 641 25. Hu, J. et al. Emerging SARS-CoV-2 variants reduce neutralization sensitivity to 642 convalescent sera and monoclonal antibodies. Cell. Mol. Immunol. 1-3 (2021) Single-Domain Camelid Antibodies. Cell 181, 1004-1015.e15 (2020). 646 27. Schepens, B. et al. Drug development of an affinity enhanced, broadly neutralizing heavy 37. Zi Tan, Y. et al. Addressing preferred specimen orientation in single-particle cryo-EM 669 through tilting. Nat. Methods 14, 793-796 (2017). 670 38. Waterhouse, A. et al. SWISS-MODEL: Homology modelling of protein structures and Fu2 variants identified by next-generation sequencing (NGS) display similar 731 neutralization potential and binding kinetics. (A) Average difference of Fu2 variants is shown 732 as a tree diagram. (B) Fu2 and seven Fu2-variants were expressed in E. coli, purified, and 733 analyzed by SDS-PAGE and Coomassie staining. (C) A dilution series of Fu2 and its variants 734 were incubated with SARS-CoV-2 pseudotyped lentivirus (PSV) for 1 hour at 37 °C before 735 infecting HEK293T-hACE2 cells. Neutralization (in %) compared to the untreated PSV is 736 shown. (D) Binding kinetics of Fu2 and variants to the RBD were measured by surface plasmon 737 resonance (SPR). Site-specifically biotinylated RBD was immobilized on streptavidin sensor 738 chips, and kinetics for a dilution series of the indicated monomeric nanobodies were measured. 739 Sensorgrams are color-coded based on concentration. The fit is based on the 1:1 Langmuir model 740 and is shown in dark grey solid lines. (E) Kinetic parameters of Fu2 and Fu2 variants binding to 741 the RBD.",
            "latex": null,
            "type": "figure"
        },
        "FIGREF19": {
            "text": "(A) Surface view of the RBD with interface-major and interface-minor color coded. (B) 744 Relative positions of two Fu2 molecules binding the RBD. (C) The interaction between two",
            "latex": null,
            "type": "figure"
        },
        "FIGREF20": {
            "text": "Assessment of Fu2 mediated structural changes in spike structure. (A) Alignment of 756 dimeric spike trimer with spikes in 1-up, 2-up and 3-up conformation (one protomer in 'up' state 757 shown). (B) Structural alignment of dimeric spike trimer with RBDs of 1-up, 2-up and 3-up 758 spikes (protomer in 'up' conformation). (C) Structural comparison of RBD (Fu2-bound dimeric 759 spike) with eight different RBDs structures (7KSG 5 , 7K4N 46 , 7A98 47 , 7A93 47 , 7A29 13 , 6XM3 48 , 760 6XM4 48 , 6ZXN 14 ).",
            "latex": null,
            "type": "figure"
        },
        "FIGREF21": {
            "text": "(A) Sequence alignment of RBDs from SARS-CoV and SARS-CoV-2. Interface-major 764 and interface-minor residues are highlighted. Arrows indicate the different amino acids of the 765 interface. (B) Fu2 variants and analysis of interface residues. Distinct residues of different 766 variants shown as sticks (color coded).",
            "latex": null,
            "type": "figure"
        },
        "FIGREF22": {
            "text": ". S5 Cryo-EM image processing scheme. Particles picked by Warp 35 were processed in 770 cryoSPARC v3.1 36 . Representative 2D class averages are shown. Particles contributing to the 771 clean classes were used to generate ab-initio reconstructions (five classes) followed by 772 heterogeneous refinement. One class showing high-resolution features was refined further (C1 773 symmetry). For localized reconstruction, particle subtraction followed by local refinement (Non-774 uniform) was performed.",
            "latex": null,
            "type": "figure"
        },
        "FIGREF23": {
            "text": ". S6 Cryo-EM validation (A) and (B) 3D FSC 37 and sphericity of 'dimer' of spike trimer and 779 of localized map, (C) and (D) Local resolution estimation of 'dimer' of spike trimer and local 780 resolution estimation of localized map (E) and (F) Angular distribution of 'dimer' of spike trimer 781 reconstruction and localized reconstruction map (G) and (H) FSC curves of 'dimer' of spike 782 trimer and of localized map (I) model-map fitting atomic resolution. . S7. Non-half-life extended nanobody heterodimer reduces disease severity in a SARS-789 CoV-2 challenge model. 790 (A) Timeline of the challenge experiment. K18-hACE2 transgenic mice were challenged with 791 1000 plaque forming units (PFU) of SARS-CoV-2 (Swedish isolate) and received prophylactic 792 (blue) or therapeutic (red) Fu2-Ty1 at the indicated time points. (B) Weight of mice during the 793 challenge experiment. The mean weight of each mouse of day 0 to day 2 served as baseline and 794 the weight loss relative this baseline is shown. Uninfected mice are shown in grey, untreated 795 infected mice in black, prophylactic treatment group in blue and therapeutic group in red. (C) 796 Analysis of oropharyngeal samples from mice at day 6 in infected groups. Ratios of E-gene to 797 ABL1 is shown for both genomic and subgenomic RNA (** p < 0.01, Mann-Whitney U test, 798 one-tailed).",
            "latex": null,
            "type": "figure"
        },
        "TABREF1": {
            "text": "Cryo-EM data collection and processing Energy filter slit width (eV) 10 Data collection automation software EPU",
            "latex": null,
            "type": "table"
        },
        "TABREF2": {
            "text": "Cryo-EM model refinement and validation statistics",
            "latex": null,
            "type": "table"
        }
    },
    "back_matter": []
}