{
    "paper_id": "0a978fc667531a9ef3b79c08f46dcb4b6a89c345",
    "metadata": {
        "title": "",
        "authors": [
            {
                "first": "Luca",
                "middle": [],
                "last": "Vannini",
                "suffix": "",
                "affiliation": {
                    "laboratory": "",
                    "institution": "Hospital Nuestra Señora de Candelaria",
                    "location": {
                        "settlement": "Tenerife",
                        "country": "Spain"
                    }
                },
                "email": "luca.vannini84@gmail.coml.vannini."
            },
            {
                "first": "Alejandro",
                "middle": [],
                "last": "Quijada-Fumero",
                "suffix": "",
                "affiliation": {
                    "laboratory": "",
                    "institution": "Hospital Nuestra Señora de Candelaria",
                    "location": {
                        "settlement": "Tenerife",
                        "country": "Spain"
                    }
                },
                "email": ""
            },
            {
                "first": "Purificación",
                "middle": [],
                "last": "Ramirez Martín",
                "suffix": "",
                "affiliation": {},
                "email": ""
            },
            {
                "first": "Nuria",
                "middle": [],
                "last": "Castejón Pina",
                "suffix": "",
                "affiliation": {},
                "email": ""
            },
            {
                "first": "Julio",
                "middle": [
                    "S"
                ],
                "last": "Hernandez Afonso",
                "suffix": "",
                "affiliation": {
                    "laboratory": "",
                    "institution": "Hospital Nuestra Señora de Candelaria",
                    "location": {
                        "settlement": "Tenerife",
                        "country": "Spain"
                    }
                },
                "email": ""
            },
            {
                "first": "University",
                "middle": [],
                "last": "Rey",
                "suffix": "",
                "affiliation": {},
                "email": ""
            },
            {
                "first": "Juan",
                "middle": [],
                "last": "Carlos",
                "suffix": "",
                "affiliation": {},
                "email": ""
            }
        ]
    },
    "abstract": [],
    "body_text": [
        {
            "text": "To the Editor Although many studies suggest different degrees of myocardial and pulmonary injury during the acute infection and early follow-up [1] [2] [3] , there is disagreement about cardio-pulmonary injury and functional impairment due to Severe Acute Respiratory Syndrome Coronavirus-2 (SARS-CoV-2) during mid-term follow-up [4] [5] [6] [7] [8] . We attempt to evaluate the cardiopulmonary function and assess the pulmonary and myocardial injury objectively in SARS-CoV-2 survivors.",
            "cite_spans": [
                {
                    "start": 144,
                    "end": 147,
                    "text": "[1]",
                    "ref_id": "BIBREF0"
                },
                {
                    "start": 148,
                    "end": 151,
                    "text": "[2]",
                    "ref_id": "BIBREF1"
                },
                {
                    "start": 152,
                    "end": 155,
                    "text": "[3]",
                    "ref_id": "BIBREF2"
                },
                {
                    "start": 330,
                    "end": 333,
                    "text": "[4]",
                    "ref_id": "BIBREF3"
                },
                {
                    "start": 334,
                    "end": 337,
                    "text": "[5]",
                    "ref_id": "BIBREF4"
                },
                {
                    "start": 338,
                    "end": 341,
                    "text": "[6]",
                    "ref_id": "BIBREF5"
                },
                {
                    "start": 342,
                    "end": 345,
                    "text": "[7]",
                    "ref_id": "BIBREF6"
                },
                {
                    "start": 346,
                    "end": 349,
                    "text": "[8]",
                    "ref_id": "BIBREF7"
                }
            ],
            "ref_spans": [],
            "section": "Cardiopulmonary exercise test with stress echocardiography in COVID-19 survivors at 6 months follow-up"
        },
        {
            "text": "We performed a monocenter, prospective, observational study, recruiting in the outpatient's post covid clinic all the consecutive patients dismissed after hospitalization from our institution's pneumology department, between 18 March to 30 June 2020, with a diagnosis of SARS-CoV-2 pneumonia. We included patients > 18 and < 75 years old. According to the WHO Interim Guidance we categorized severity of illness as SARS-CoV-2 mild Pneumonia, Severe Pneumonia and acute respiratory distress syndrome (ARDS) . All the patients performed a static pulmonary function test (PFT), cardiopulmonary exercise test (CPET), and exercise test combined with echocardiography on the same day, six months after the first SARS-CoV-2 positive smear. Rest and peak exercise echocardiography were carried out at the same time of cardiopulmonary exercise test. Echocardiography was performed according to the European/American Society of echocardiography guidelines, CPET was performed using a microprocessor-controlled eddy current brake ergometer . Patients wore a non-rebreathing Hans-Rudolph Mask connected to Vyntus™ CPX Metabolic Cart. All the patients completed after 3 minutes of unloaded warm-up phase a symptoms limited exercise test with a 10/W/min ramp protocol. Patients were encouraged to exercise up to the maximal effort. Oxygen saturation with pulse oximetry and heart rate with 12 lead ECG monitoring was performed during the test. Measurements of mixed expired oxygen, mixed expired carbon dioxide and expired volume were determined at rest and for each breath throughout exercise. Written informed consent was obtained from all patients, and the study was approved by the ethics committee of our institution (CHUNSC_2020_50). The normality of the data distribution was determined using the Kolmogorov-Smirnov test. Parametric unpaired t-test or Mann-Whitney U was used to evaluate the difference between two groups for continuous variables. Comparison between the three groups was performed with ANOVA test for continuous variables. Chi-squared test was used for categorical variables. All comparisons were made using two-tailed tests, and the level of significance was set at p < 0.05. All statistical tests were performed using the open-access statistical package the jamovi project (2021). jamovi (Version 1.6) [Computer Software].",
            "cite_spans": [],
            "ref_spans": [],
            "section": "Cardiopulmonary exercise test with stress echocardiography in COVID-19 survivors at 6 months follow-up"
        },
        {
            "text": "We recruited 41 SARS-CoV-2 survivors, 16 female (39%), mean age 57,3 ± 13,7 years. 9 patients (22%) presented ARDS, 20 patients (49%) presented severe pneumonia, 12 patients (29%) presented mild pneumonia. 29 patients (70%) persisted with symptoms during followup; the main symptoms were dyspnoea (56,1%) and asthenia (51,2%). 46,3% of patients presented a percent predicted peak oxygen uptake (% pVO2) < 80%. This impairment was mild in the majority of patients (39%). 27% of patients presented alteration of Total Lung Capacity (TLC) and/or Diffusion Capacity of CO (DLCO); the grade of alteration was mild except in one ARDS group patient. 37% of patients presented ventilatory inefficiency data. 11 symptomatic patients (27%) presented an abnormal ventilatory response without datas of cardiac or pulmonary vascular sequelae, two patients presented oxygen desaturation with exercise and pathological Dead Space to Tidal Volume Ratio (Vd/VT) increment at exercise peak.",
            "cite_spans": [],
            "ref_spans": [],
            "section": "Cardiopulmonary exercise test with stress echocardiography in COVID-19 survivors at 6 months follow-up"
        },
        {
            "text": "None of the patients presented severe pulmonary hypertension at rest, only one patient presented moderate pulmonary hypertension at rest. 7% of patients presented impaired RV function. No data of LV contractility alteration and no exercise-induced arrhythmias was detected.",
            "cite_spans": [],
            "ref_spans": [],
            "section": "Cardiopulmonary exercise test with stress echocardiography in COVID-19 survivors at 6 months follow-up"
        },
        {
            "text": "Comparing mild pneumonia group, severe pneumonia group and ARD's group, we found no significant trend of higher prevalence of symptoms and pulmonary sequelae according to the severity of illness. No significant trend of lower aerobic capacity between groups was detected (%pVO2: 86% Vs 82% Vs 74%; P 0,243).",
            "cite_spans": [],
            "ref_spans": [],
            "section": "Cardiopulmonary exercise test with stress echocardiography in COVID-19 survivors at 6 months follow-up"
        },
        {
            "text": "We performed a complete static pulmonary test of 37 patients. 17 patients (41,5%) presented abnormal respiratory tests; 13 (76,5%) persisted with dyspnoea during follow-up.",
            "cite_spans": [],
            "ref_spans": [],
            "section": "Cardiopulmonary exercise test with stress echocardiography in COVID-19 survivors at 6 months follow-up"
        },
        {
            "text": "Severe Pneumonia group and ARDS group presented a significant lower DLCO value respect to mild Pneumonia group (6,85 VS 7,72 VS 9,35 mmol/min*kPa; p 0,04, p 0,033). Abnormal DLCO and/or TLC were detected in 10 patients (27%). Forced vital capacity (FVC), forced expiratory volume in one second (FEV1), FEV1/FVC abnormalities were detected in 8 (19,5%), 3 (7,3%), 4 (9,8%) patients, respectively.",
            "cite_spans": [],
            "ref_spans": [],
            "section": "Cardiopulmonary exercise test with stress echocardiography in COVID-19 survivors at 6 months follow-up"
        },
        {
            "text": "Comparing patients with VO2 peak >80% predicted and patients with VO2< 80%, we didn't find a difference in symptoms prevalence (72% Vs 68%; NS).",
            "cite_spans": [],
            "ref_spans": [],
            "section": "Cardiopulmonary exercise test with stress echocardiography in COVID-19 survivors at 6 months follow-up"
        },
        {
            "text": "There was no significant trend of reduced DLCO<80% in VO2<80% group (26,3% Vs 4,5%; p 0,063) and TLC<80% (31,6% Vs 9,1%; p 0,092) ( Table 1) .",
            "cite_spans": [],
            "ref_spans": [
                {
                    "start": 132,
                    "end": 140,
                    "text": "Table 1)",
                    "ref_id": "TABREF1"
                }
            ],
            "section": "Cardiopulmonary exercise test with stress echocardiography in COVID-19 survivors at 6 months follow-up"
        },
        {
            "text": "Many SARS-CoV-2 survivors without cardiac or pulmonary vascular sequelae presented an abnormal ventilatory response to exercise without significant desaturation or pathological Vd/Vt increase. This subgroup of patients showed a similar ventilatory response described by Baratto et al. [5] in a CPET study at the moment of hospital discharge of SARS-CoV-2 survivors and recently by Singh et al. [6] in patients without anemia or pulmonary disease after 11 months of infection. Baratto the absence of blood gas analysis for PaCO2 quantification during exercise, we only could hypothesize according to normal Vd/VT response of these patients that some SARS-CoV-2 survivors could persist with an enhanced chemoreflex sensitivity during follow-up. A normal or supernormal cardiac output argues against deconditioning as the main cause of impaired systemic oxygen extraction and according to Singh et al. [6] could suggest a shift in skeletal muscle fiber type and/or reduced aerobic enzyme activity. LV function is preserved in all patients during follow-up at rest and during exercise. A central cardiac mechanism that limits oxygen delivery is excluded, excepting 3 patients (7.3%), 2 of 3 patients with previous pulmonary disease, that presented RV dilatation and dysfunction. ARDs group patients presented significant dilatation of mid-ventricular linear dimensions compared to mild pneumonia group, reinforcing the hypothesis that RV dilatation is probably related to parenchymal and/or pulmonary vascular disease [1] . Diastolic dysfunction has been described as a possible acute SARS-CoV-2 cardiac damage [1] , despite in ARDs subgroup we observed a trend of shorter mitral inflow E wave deceleration time (190±62 ms VS 254±81 ms; P 0,063) and a higher LA mean volume (28,7 ml/m2 Vs. 19,5 ml/m2; P 0,006), this alteration could be secondary to higher prevalence of hypertension and older patients of this subgroup.",
            "cite_spans": [
                {
                    "start": 285,
                    "end": 288,
                    "text": "[5]",
                    "ref_id": "BIBREF4"
                },
                {
                    "start": 394,
                    "end": 397,
                    "text": "[6]",
                    "ref_id": "BIBREF5"
                },
                {
                    "start": 476,
                    "end": 483,
                    "text": "Baratto",
                    "ref_id": null
                },
                {
                    "start": 899,
                    "end": 902,
                    "text": "[6]",
                    "ref_id": "BIBREF5"
                },
                {
                    "start": 1514,
                    "end": 1517,
                    "text": "[1]",
                    "ref_id": "BIBREF0"
                },
                {
                    "start": 1607,
                    "end": 1610,
                    "text": "[1]",
                    "ref_id": "BIBREF0"
                }
            ],
            "ref_spans": [],
            "section": "Cardiopulmonary exercise test with stress echocardiography in COVID-19 survivors at 6 months follow-up"
        },
        {
            "text": "Patients with previous pulmonary diseases presented the most severe alteration of both DLCO and TLC. Although abnormal DLCO and TLC are the most frequent pulmonary sequelae, they don't explain aerobic capacity deterioration and dyspnoea especially in patients without diffuse pulmonary fibrosis or pulmonary vascular damage.",
            "cite_spans": [],
            "ref_spans": [],
            "section": "Cardiopulmonary exercise test with stress echocardiography in COVID-19 survivors at 6 months follow-up"
        },
        {
            "text": "Differing from previous studies we cannot assert that deconditioning [7] [8] [9] or circulatory causes [8] represent the most common exercise limitation in our cohort. The main limitations of our study is a missing baseline assessment of cardiopulmonary function and PFT before SARS-CoV-2 infection and the presence of patients with previous pulmonary disease; the small number of patients in different subgroups limit the generalizability of the results.",
            "cite_spans": [
                {
                    "start": 69,
                    "end": 72,
                    "text": "[7]",
                    "ref_id": "BIBREF6"
                },
                {
                    "start": 73,
                    "end": 76,
                    "text": "[8]",
                    "ref_id": "BIBREF7"
                },
                {
                    "start": 77,
                    "end": 80,
                    "text": "[9]",
                    "ref_id": "BIBREF8"
                },
                {
                    "start": 103,
                    "end": 106,
                    "text": "[8]",
                    "ref_id": "BIBREF7"
                }
            ],
            "ref_spans": [],
            "section": "Cardiopulmonary exercise test with stress echocardiography in COVID-19 survivors at 6 months follow-up"
        }
    ],
    "bib_entries": {
        "BIBREF0": {
            "ref_id": "b0",
            "title": "Spectrum of cardiac manifestations in COVID-19: a systematic echocardiographic study. Circulation",
            "authors": [
                {
                    "first": "Y",
                    "middle": [],
                    "last": "Szekely",
                    "suffix": ""
                },
                {
                    "first": "Y",
                    "middle": [],
                    "last": "Lichter",
                    "suffix": ""
                },
                {
                    "first": "P",
                    "middle": [],
                    "last": "Taieb",
                    "suffix": ""
                },
                {
                    "first": "A",
                    "middle": [],
                    "last": "Banai",
                    "suffix": ""
                },
                {
                    "first": "A",
                    "middle": [],
                    "last": "Hochstadt",
                    "suffix": ""
                },
                {
                    "first": "I",
                    "middle": [],
                    "last": "Merdler",
                    "suffix": ""
                }
            ],
            "year": 2020,
            "venue": "",
            "volume": "142",
            "issn": "",
            "pages": "342--53",
            "other_ids": {}
        },
        "BIBREF1": {
            "ref_id": "b1",
            "title": "Outcomes of cardiovascular magnetic resonance imaging in patients recently recovered from coronavirus disease 2019 (COVID-19)",
            "authors": [
                {
                    "first": "V",
                    "middle": [
                        "O"
                    ],
                    "last": "Puntmann",
                    "suffix": ""
                },
                {
                    "first": "M",
                    "middle": [
                        "L"
                    ],
                    "last": "Carerj",
                    "suffix": ""
                },
                {
                    "first": "I",
                    "middle": [],
                    "last": "Wieters",
                    "suffix": ""
                },
                {
                    "first": "M",
                    "middle": [],
                    "last": "Fahim",
                    "suffix": ""
                },
                {
                    "first": "C",
                    "middle": [],
                    "last": "Arendt",
                    "suffix": ""
                },
                {
                    "first": "J",
                    "middle": [],
                    "last": "Hoffmann",
                    "suffix": ""
                }
            ],
            "year": 2020,
            "venue": "JAMA Cardiol",
            "volume": "5",
            "issn": "11",
            "pages": "1265--73",
            "other_ids": {}
        },
        "BIBREF2": {
            "ref_id": "b2",
            "title": "Patterns of myocardial injury in recovered troponin-positive COVID-19 patients assessed by cardiovascular magnetic resonance",
            "authors": [
                {
                    "first": "T",
                    "middle": [],
                    "last": "Kotecha",
                    "suffix": ""
                },
                {
                    "first": "D",
                    "middle": [
                        "S"
                    ],
                    "last": "Knight",
                    "suffix": ""
                },
                {
                    "first": "Y",
                    "middle": [],
                    "last": "Razvi",
                    "suffix": ""
                },
                {
                    "first": "K",
                    "middle": [],
                    "last": "Kumar",
                    "suffix": ""
                },
                {
                    "first": "K",
                    "middle": [],
                    "last": "Vimalesvaran",
                    "suffix": ""
                },
                {
                    "first": "G",
                    "middle": [],
                    "last": "Thornton",
                    "suffix": ""
                }
            ],
            "year": 2021,
            "venue": "Eur Heart J",
            "volume": "42",
            "issn": "19",
            "pages": "1866--78",
            "other_ids": {}
        },
        "BIBREF3": {
            "ref_id": "b3",
            "title": "Abnormal pulmonary function in COVID-19 patients at time of hospital discharge",
            "authors": [
                {
                    "first": "X",
                    "middle": [],
                    "last": "Mo",
                    "suffix": ""
                },
                {
                    "first": "W",
                    "middle": [],
                    "last": "Jian",
                    "suffix": ""
                },
                {
                    "first": "Z",
                    "middle": [],
                    "last": "Su",
                    "suffix": ""
                },
                {
                    "first": "M",
                    "middle": [],
                    "last": "Chen",
                    "suffix": ""
                },
                {
                    "first": "H",
                    "middle": [],
                    "last": "Peng",
                    "suffix": ""
                },
                {
                    "first": "P",
                    "middle": [],
                    "last": "Peng",
                    "suffix": ""
                }
            ],
            "year": 2020,
            "venue": "Eur Respir J",
            "volume": "55",
            "issn": "6",
            "pages": "",
            "other_ids": {}
        },
        "BIBREF4": {
            "ref_id": "b4",
            "title": "Impact of COVID-19 on exercise pathophysiology. A combined cardiopulmonary and echocardiographic exercise study",
            "authors": [
                {
                    "first": "C",
                    "middle": [],
                    "last": "Baratto",
                    "suffix": ""
                },
                {
                    "first": "S",
                    "middle": [],
                    "last": "Caravita",
                    "suffix": ""
                },
                {
                    "first": "A",
                    "middle": [],
                    "last": "Faini",
                    "suffix": ""
                },
                {
                    "first": "G",
                    "middle": [
                        "B"
                    ],
                    "last": "Perego",
                    "suffix": ""
                },
                {
                    "first": "M",
                    "middle": [],
                    "last": "Senni",
                    "suffix": ""
                },
                {
                    "first": "L",
                    "middle": [
                        "P"
                    ],
                    "last": "Badano",
                    "suffix": ""
                }
            ],
            "year": 2021,
            "venue": "J Appl Physiol",
            "volume": "",
            "issn": "",
            "pages": "",
            "other_ids": {}
        },
        "BIBREF5": {
            "ref_id": "b5",
            "title": "Persistent exertional intolerance after COVID-19: insights from invasive cardiopulmonary exercise testing",
            "authors": [
                {
                    "first": "I",
                    "middle": [],
                    "last": "Singh",
                    "suffix": ""
                },
                {
                    "first": "P",
                    "middle": [],
                    "last": "Joseph",
                    "suffix": ""
                },
                {
                    "first": "P",
                    "middle": [
                        "M"
                    ],
                    "last": "Heerdt",
                    "suffix": ""
                },
                {
                    "first": "M",
                    "middle": [],
                    "last": "Cullinan",
                    "suffix": ""
                },
                {
                    "first": "D",
                    "middle": [
                        "D"
                    ],
                    "last": "Lutchmansingh",
                    "suffix": ""
                },
                {
                    "first": "M",
                    "middle": [],
                    "last": "Gulati",
                    "suffix": ""
                }
            ],
            "year": 2021,
            "venue": "Chest",
            "volume": "",
            "issn": "",
            "pages": "",
            "other_ids": {}
        },
        "BIBREF6": {
            "ref_id": "b6",
            "title": "Cardiopulmonary exercise testing in COVID-19 patients at 3 months follow-up",
            "authors": [
                {
                    "first": "P",
                    "middle": [],
                    "last": "Clavario",
                    "suffix": ""
                },
                {
                    "first": "V",
                    "middle": [
                        "D"
                    ],
                    "last": "Marzo",
                    "suffix": ""
                },
                {
                    "first": "Lotti",
                    "middle": [
                        "R"
                    ],
                    "last": "Barbara",
                    "suffix": ""
                },
                {
                    "first": "C",
                    "middle": [],
                    "last": "Porcile",
                    "suffix": ""
                },
                {
                    "first": "A",
                    "middle": [],
                    "last": "Russo",
                    "suffix": ""
                },
                {
                    "first": "C",
                    "middle": [],
                    "last": "",
                    "suffix": ""
                }
            ],
            "year": 2021,
            "venue": "Int. J. Cardiol",
            "volume": "",
            "issn": "",
            "pages": "",
            "other_ids": {}
        },
        "BIBREF7": {
            "ref_id": "b7",
            "title": "Cardiopulmonary exercise capacity and limitations 3 months after COVID-19 hospitalisation",
            "authors": [
                {
                    "first": "I",
                    "middle": [],
                    "last": "Skjørten",
                    "suffix": ""
                },
                {
                    "first": "Oaw",
                    "middle": [],
                    "last": "Ankerstjerne",
                    "suffix": ""
                },
                {
                    "first": "D",
                    "middle": [],
                    "last": "Trebinjac",
                    "suffix": ""
                },
                {
                    "first": "E",
                    "middle": [],
                    "last": "Brønstad",
                    "suffix": ""
                },
                {
                    "first": "Ø",
                    "middle": [],
                    "last": "Rasch-Halvorsen",
                    "suffix": ""
                },
                {
                    "first": "G",
                    "middle": [],
                    "last": "Einvik",
                    "suffix": ""
                }
            ],
            "year": 2021,
            "venue": "Eur. Respir. J",
            "volume": "58",
            "issn": "2",
            "pages": "",
            "other_ids": {}
        },
        "BIBREF8": {
            "ref_id": "b8",
            "title": "Deconditioning as main mechanism of impaired exercise response in COVID-19 survivors",
            "authors": [
                {
                    "first": "R",
                    "middle": [
                        "F"
                    ],
                    "last": "Rinaldo",
                    "suffix": ""
                },
                {
                    "first": "M",
                    "middle": [],
                    "last": "Mondoni",
                    "suffix": ""
                },
                {
                    "first": "E",
                    "middle": [
                        "M"
                    ],
                    "last": "Parazzini",
                    "suffix": ""
                },
                {
                    "first": "F",
                    "middle": [],
                    "last": "Pitari",
                    "suffix": ""
                },
                {
                    "first": "E",
                    "middle": [],
                    "last": "Brambilla",
                    "suffix": ""
                },
                {
                    "first": "S",
                    "middle": [],
                    "last": "Luraschi",
                    "suffix": ""
                }
            ],
            "year": 2021,
            "venue": "Eur Respir J",
            "volume": "",
            "issn": "",
            "pages": "870--2021",
            "other_ids": {}
        }
    },
    "ref_entries": {
        "TABREF0": {
            "text": "et al., postulated an enhanced PaCO2 (arterial Co2 partial pressure) chemoreflex sensitivity in SARS-CoV-2 survivors. Because of Contents lists available at ScienceDirect European Journal of Internal Medicine journal homepage: www.elsevier.com/locate/ejim https://doi.org/10.1016/j.ejim.2021.10.004 Received 26 September 2021; Accepted 3 October 2021",
            "latex": null,
            "type": "table"
        },
        "TABREF1": {
            "text": "Clinical Characteristics, Static and dynamic Pulmonary function Tests results, Basal and stress test echocardiographic characteristics of COVID-19 patients at 6 months follow-up. Comparison between Severity of Illness groups and between groups with percent predicted peak oxygen uptake > and < 80%.",
            "latex": null,
            "type": "table"
        },
        "TABREF2": {
            "text": "ARDS=Acute Respiratory Distress Syndrome; FVC= Forced Vital Capacity; FEV1=Forced Expiratory Volume in One Second; TLC=Total Lung Capacity; DLCO: carbon monoxide diffusion capacity. CPET=Cardiopulmonary Exercise Test; Peak VO2= peak oxygen uptake, VO2/HR=Oxygen pulse; PetCO2=End-tidal CO2; VE/ VCO2=Ventilatory Equivalents for Carbon Dioxide, AT= Anaerobic Threshold; Vd/VT=Dead Space to Tidal Volume Ratio;RER=Respiratory Gas Exchange Ratio VCO2/VO2;HRR= Heart Rate Reserve; SaO2= Oxygen Saturation; METs=Metabolic Equivalents;LVEF=Left Ventricle ejection Fraction; LVDd Left Ventricle Diastolic diameter; LVDs Left Ventricle Systolic diameter; LV mass=Left Ventricle mass; DT= Deceleration Time; RA area=Right Atrium Area; LA=left Atrium; RV=Right Ventricle; TAPSE=Tricuspid Annular Plane Systolic Excursion; PHT=Pulmonary Hypertension.",
            "latex": null,
            "type": "table"
        }
    },
    "back_matter": [
        {
            "text": "The authors do not have conflicts of interest to declare. This research did not receive any specific grant from funding agencies in the public, commercial, or not-for-profit sectors.This manuscript is not under consideration elsewhere, none of the manuscript's content has been previously published and all authors have read and approved the manuscript. All the authors have contributed significantly to the submitted paper.",
            "cite_spans": [],
            "ref_spans": [],
            "section": "Declaration of Competing Interest"
        }
    ]
}